[
    {
        "overall_sum": "After a broken engagement with Krish, Jess—an empathetic primary school teacher from London—travels to Paris seeking solace. There, she meets Gabriel, a French war photographer grappling with trauma and the challenge of living with a prosthetic limb due to being held captive in Afghanistan. While residing in Gabriel’s flat, the two form a profound emotional connection, bonding over their vulnerabilities. As Jess aids Gabriel in confronting his inner demons at a renovated chateau, their relationship is tested by Gabriel's struggles with emotional transparency as Jess prepares to return to London.\nJess departs Paris determined to move forward, despite Gabriel’s attempts to express his affection. A near-miss accident leads Jess to reconsider her desires, yet feeling sidelined by Gabriel’s friend, Johnson, motivates her to forge her path. Gabriel misses the chance to stop Jess’s departure, prompting him to confront his trauma. Inspired by insights from conversations with Johnson, Gabriel embarks on his own journey of healing.\nIn London, Jess reflects on Gabriel and fills her time with meaningful pursuits, including organizing a charity skydive for children needing prosthetics, a cause that ties back to her bond with Gabriel. In Paris, Gabriel faces phantom pains that signal his unresolved feelings for Jess. With encouragement from his sister Elodie, he joins a support group and initiates a running club for amputees, marking progress in his recovery.\nOn the day of Jess's skydive, Gabriel surprises her by serving as her photographer—a gesture orchestrated by Elodie. Expressing his love, Gabriel shares his journey of healing and their shared experiences, leading them to embrace their relationship wholeheartedly.\nThe couple embarks on a charity climb up Mount Kilimanjaro, tackling both physical and emotional challenges. They reflect on their journey as they strive to raise funds for a prosthetics charity, overcoming difficulties such as altitude sickness and Gabriel’s unique physical challenges with determination. Upon reaching Uhuru Peak, Gabriel proposes to Jess against a breathtaking backdrop, symbolizing their commitment to facing the future together.",
        "overall_char": "**Jess**:\n- **Profile**: Protagonist; an adventurous and empathetic primary school teacher from London. Drawn to Gabriel for his strength and vulnerability, while struggling with her desire for a balanced life.\n- **Overall Experience**: Jess transforms from a heartbroken woman to someone who embraces challenges. Her relationship with Gabriel remains a defining influence, leading her towards empowerment and self-discovery.\n\n**Gabriel**:\n- **Profile**: Protagonist; A French war photographer grappling with trauma and life with a prosthetic limb. His experiences have left him emotionally reserved yet deeply attached to Jess.\n- **Overall Experience**: Gabriel evolves from isolation to connection, addressing traumas and embracing his love for Jess. His journey reflects openness and a commitment to both personal recovery and their relationship.\n\n**Elodie**:\n- **Profile**: Gabriel’s insightful sister and a supportive teacher who influences his healing journey.\n- **Overall Experience**: Continues to be a stabilizing force in Gabriel's life, instrumental in encouraging him to face his emotions and reconnect with Jess.\n\n**Johnson**:\n- **Profile**: Gabriel’s friend whose healing journey inspires him. Initially a point of tension for Jess but later an encourager for Gabriel.\n- **Overall Experience**: Represents a figure of inspiration for Gabriel's personal growth and reconciliation with Jess.\n\nOther minor characters such as the porters and fellow trekkers enhance the setting and challenges faced during the climb."
    }
]