[
    {
        "overall_sum": "Catalina Ituralde, an undocumented immigrant from Ecuador, balances her life between a prestigious education at Harvard and her immigrant roots in Queens, where she resides with her grandparents. During her spring semester, Catalina becomes engrossed in her studies, including a class on Finnegans Wake and a rapid-paced Portuguese course, as well as her employment at the Peabody Museum. Tensions rise as her family faces the threat of deportation, which psychologically strains Catalina and ignites cultural friction.\nCatalina forms crucial connections to support her grandfather Francisco, who ultimately opts to voluntarily return to Ecuador, leaving behind a note and a stolen khipu from the Peabody, causing familial disruption. This decision forces Catalina to face the responsibilities of preserving her family's legacy and navigating dual identities.\nMeanwhile, Catalina's romantic involvement with fellow student Nathaniel Wheeler combines personal and professional aspects, complicated by his father's interest in making her the subject of a documentary about her life. This explores themes of self-identity and representation ethics, engaging Catalina further in questions about her place within a privileged academic environment and her life's narrative.\nHer interactions at Harvard with rebellious peers and authoritative professors challenge her intellectual and emotional resilience. Upon returning home to find Francisco gone, Catalina deals with the emotional fallout and contemplates her family's narrative of exile and belonging. She consults Don Luis, a trusted community figure, who advises her on handling the ethically and legally complicated situation regarding the khipu.\nIn the epilogue, post-graduation, Catalina and Nathaniel amicably remain friends. Delphine and Kyle relocate to New York City; Delphine starts med school and Kyle becomes a TV writer. Catalina comes to terms with her grandfather's absence, learning to manage household tasks with her grandmother, who begins newfound pursuits like seeking employment and education, symbolizing a fresh start.\nCatalina embarks on tutoring roles for affluent families, facilitated by Nathaniel's father, Byron Wheeler. She finishes her thesis, though it doesn't receive accolades, and mentally grapples with past traumas. Despite postponing therapy, she seeks empowerment in her circumstances, turning abandonment into a source of strength, determined to carve her path amidst adversity.",
        "overall_char": "**Catalina Ituralde**:\n- **Profile**: Catalina is a resourceful, introspective undocumented immigrant at Harvard, dedicating herself to academic success while navigating the complexities of her cultural identity.\n- **Overall Experience**: Catalina's journey involves reconciling her academic ambitions with her undocumented status while coping with familial loss. She emerges as a strong figure aiming to transcend her circumstances and champion her narrative.\n\n**Francisco (Catalina’s Grandfather)**:\n- **Profile**: Francisco represents traditional values and the challenges faced by undocumented immigrants, impacting Catalina's identity and decisions.\n- **Overall Experience**: Francisco's departure underscores the struggle for belonging and the legacy Catalina inherits, influencing her path and inspiring resilience.\n\n**Fernanda (Catalina’s Grandmother)**:\n- **Profile**: Fernanda balances immigrant struggles with familial support, embodying warmth and adaptability.\n- **Overall Experience**: Fernanda is a cornerstone of Catalina's life, guiding her through transitions and embracing change despite challenges.\n\n**Nathaniel Wheeler**:\n- **Profile**: Nathaniel, a Harvard student and Catalina's romantic interest, is characterized by intellectual curiosity and anthropology.\n- **Overall Experience**: Nathaniel's relationship with Catalina fosters her exploration of identity and privilege dynamics, contributing to her personal growth.\n\n**Byron Wheeler**:\n- **Profile**: A filmmaker interested in Catalina’s story, complicating her identity journey.\n- **Overall Experience**: His interest in Catalina's life story intertwines her narrative with broader societal themes, influencing her self-perception and career trajectory."
    }
]