[
    {
        "overall_sum": "Brynn Kwan is a high school senior contending with the effects of Ehlers-Danlos syndrome (EDS) and postural orthostatic tachycardia syndrome (POTS), which present both personal and academic challenges. Her journey takes a dramatic turn after an altercation with a fellow student, Pat, leading to her suspension and threatening her scholarship and future prospects. This incident catalyzes a discussion about systemic inequities faced by people with chronic conditions. Despite initial isolation, Brynn's mother surprisingly supports her, advocating fiercely at a school board meeting to challenge the validity of Brynn's suspension. Encouraged by her family’s and friends’ support, Brynn begins to find her voice and advocacy.\nBrynn's relationship with her ex-boyfriend, Oliver, becomes central as they re-explore their dynamic amid Brynn's vulnerability about her health. Oliver, an aspiring playwright, struggles with mixed emotions about their past relationship and Brynn's health-related secrets. As they navigate these complexities, Oliver tries to understand Brynn’s condition, researching hypermobile Ehlers-Danlos syndrome (hEDS) and accommodating her needs. This openness fosters a renewed connection between them, one built on honesty and understanding.\nThroughout this time, Brynn is supported by her younger sister, Eliza, who evolves from a seemingly detached overachiever to a staunch ally. Eliza’s assertiveness grows as she defends Brynn and engages in her own supportive relationships, marking her transformation. Brynn’s friend Francesca also reestablishes her loyalty, becoming an essential part of Brynn's advocacy efforts against school injustices. Simultaneously, Ethan emerges as a connection for Eliza, showing how Brynn’s situation influences those around her.\nAs the board deliberates on Brynn's future, Brynn reflects on how much she has internalized her fear of judgments, challenging herself to live authentically. Her interactions with Oliver illustrate her evolving perspective; she shares her struggles with honesty and humor, inviting Oliver to understand her experience. They plan a non-traditional homecoming outing to Wildwood, underscoring their rekindled relationship and Oliver’s readiness to meet Brynn halfway.\nBrynn's involvement in altering perspectives extends beyond her personal circle, as she encourages others, like Brandon, who are marginalized. Through these experiences, Brynn carves a path of advocacy grounded on her terms, confronting societal biases and school politics. In the end, Brynn embraces the complexities of living with her conditions, finding strength in community and the possibilities of love with Oliver. Their relationship becomes newfound steady ground in Brynn's unpredictable world.",
        "overall_char": "**Brynn Kwan**:\n- **Profile**: Brynn is the protagonist, a high school senior dealing with Ehlers-Danlos syndrome and POTS, marked by resilience and advocacy aspirations.\n- **Overall Experience**: Progresses from concealing weaknesses to embracing her identity, gaining strength through advocacy. She navigates systemic challenges and societal expectations, learning to wield her voice effectively.\n\n**Oliver De Luca**:\n- **Profile**: Brynn’s ex-boyfriend and high school peer, an aspiring playwright.\n- **Overall Experience**: Evolves from a conflicted figure to a proactive supporter, navigating complex emotions regarding Brynn’s condition and relationship.\n\n**Eliza Kwan**:\n- **Profile**: Brynn’s sister, originally a high achiever.\n- **Overall Experience**: Transforms from an overachieving sibling into a supportive ally, her empathy and role in Brynn’s life growing significantly.\n\n**Francesca**:\n- **Profile**: Brynn’s close friend, characterized by empathy and loyalty.\n- **Overall Experience**: Grows to support Brynn’s advocacy efforts, maintaining a significant role in addressing school injustices.\n\n**Pat Zeller**:\n- **Profile**: Antagonist and primary instigator of Brynn’s suspension.\n- **Overall Experience**: Represents systemic biases within the school, catalyzing Brynn’s advocacy journey.\n\n**Ethan**:\n- **Profile**: Eliza’s new romantic interest, characterized by admiration for her assertive nature.\n- **Overall Experience**: Newly introduced as a character aligning with Eliza, fostering their budding dynamic."
    }
]