[
    {
        "overall_sum": "The story centers on Andres, Renee, and Liora, three teenagers from Miami Beach whose paths intertwine due to a profound mishap. After Liora’s accident renders her comatose, Andres, who has previously made a bargain with Death, and Renee embark on a spiritual journey to an ethereal underworld to rescue her. This journey reveals the complex dynamics of their relationship underpinned by love, memory, and self-identity amid challenges manifesting as spiritual trials represented by the jaguar and peacock spirit animals.\nIn the City of the Dead, ruled by the enigmatic Prince, temptation pervades, enticing souls with forgetfulness. The Prince, embodying the contrast between memory and oblivion, thrives in this realm. The story reveals Virgil, a ghost from Mariupol, who joins Andres and Renee as a guide, imparting wisdom and hope despite the surrounding desolation.\nConfronting the vulture men and the Prince tests the trio’s resolve. Meanwhile, the journey forces Renee and Andres to confront their fears: Renee’s fear of abandonment and Andres’s dread of his past. As they brave the abyss, their resolve deepens, leading them to the Prince’s lair at a mansion in the underworld. Here, they find Liora seemingly enamored by the Prince's promises, yet Renee challenges her to remember the world above.\nIn a climactic confrontation, Andres faces the Prince, revealed to be his shadow from his past self. Through an emotional reconciliation, Andres integrates the Prince, acknowledging his anger and pain without succumbing to it. This confrontation acts as a catalyst for growth, leading Andres to make amends with his past and present self. Liora finds the strength to reject the Prince, deciding with her friends to find a way out of the City.\nReturning to the living world, Andres and Renee visit Liora in the hospital, witnessing her recovery. In an emotional display of bravery, she defies her mother, Mrs. Rose, reaffirming her love for Andres and Renee, asserting her right to live authentically. The narrative concludes with Andres fulfilling his debt to Death, sacrificing his guitar, symbolizing his past, for a hopeful future. He emerges with a newfound acceptance of his imperfections, ready to embrace life with gratitude and resilience, marking the triumphant resolution of their shared journey.",
        "overall_char": "**Andres Santos**:\n- **Profile**: Protagonist battling personal and supernatural demons, boyfriend to Renee and Liora, wrestling with past mistakes.\n- **Overall Experience**: Andres’s journey from past regret to self-acceptance is marked by love, sacrifice, and redemption, finding strength in his relationships and overcoming his shadowed fears to embrace hope.\n\n**Renee Delgado**:\n- **Profile**: Artistic and spiritual, deeply connected with Andres and Liora, guides the trio through crises with strength and wisdom.\n- **Overall Experience**: Renee embodies resilience and emotional intelligence, proving pivotal in facing supernatural and emotional challenges, solidifying her connection with Andres and Liora, and showcasing her unwavering devotion to those she loves.\n\n**Liora Rose**:\n- **Profile**: The catalyst of the narrative, enduring a personal crisis, grappling with familial pressures, caught in the Prince’s spell.\n- **Overall Experience**: Liora’s journey to self-acceptance is intertwined with themes of love and memory, culminating in her rebellion against societal and familial constraints, choosing authenticity over perfection.\n\n**The Prince**:\n- **Profile**: Antagonist and allegorical shadow of Andres’s past, ruling the City of the Dead, thrives on offering the oblivion of forgetting.\n- **Overall Experience**: Embodies the tension between memory and oblivion, his defeat symbolizes the resolution of Andres’s inner conflict, offering commentary on the nature of self-reliance and growth.\n\n**Mrs. Rose**:\n- **Profile**: Liora’s critical mother, embodying societal pressures and expectations, conflicting the central narrative.\n- **Overall Experience**: Her relationship with Liora showcases the tension between conformity and individuality, ultimately yielding space for Liora’s self-discovery and self-assertion."
    }
]