[
    {
        "overall_sum": "Rowan Walsh, an aspiring costume designer, navigates the complexities of Hollywood alongside her boyfriend Zachary Butler, a famous actor. Rowan's past is marked by grief, stemming from her father's death and her previous boyfriend Josh's tragic passing. Zach, a celebrated actor, seeks genuine relationships as he moves away from his manipulative ex-girlfriend, Eva Dean. Their mutual support offers them stability amidst Hollywood's chaos. \nTheir relationship is tested by a scandal when Eva falsely claims Zach is the father of her unborn child, casting doubt on his career and their relationship. Rowan stands by Zach through these challenges, while also facing her own professional obstacles as her costume designs are stolen by Laurent Moreau, a prominent designer. In therapy with Dr. Kaya Baldwin, Rowan works through her grief and guilt, coming to terms with Josh's death and embracing her future with Zach.\nZach confronts Eva, revealing her deceptions about the pregnancy. The confrontation turns violent, leading to police involvement and Eva's arrest. Zach protects himself and Rowan with a recording of their altercation, allowing them to secure their lives and reputations. Rowan finds a career breakthrough after Laurent's dismissal, returning to work on a film production. She eagerly anticipates a future with Zach in their new home, filled with hope and stability.\nIn the epilogue, Zach and Rowan prepare for Oscars night. While dressing at the Roosevelt Hotel, Zach decides to propose to Rowan. In the limo en route to the ceremony, he seizes the moment, and Rowan joyously accepts. Zach wins the Best Actor award for \"Midnight Skies\" and publicly announces their engagement, bringing their love story full circle amidst resounding applause. The narrative concludes as they embrace their love, with Zach finally finding peace and fulfillment.",
        "overall_char": "**Rowan Walsh**:\n- **Profile**: Protagonist; aspiring costume designer with a talent for creativity and resilience. Initially burdened by grief, she evolves as she navigates her career and emotional growth with Zach.\n- **Overall Experience**: Overcoming past grief and challenges, Rowan finds professional success and personal happiness. Her relationship with Zach offers stability and love, guiding her toward a fulfilling future.\n\n**Zachary Butler**:\n- **Profile**: Renowned actor seeking meaningful relationships after escaping Eva Dean's toxic influence. He is strong, empathetic, and protective of those he loves.\n- **Overall Experience**: Zach's journey from toxic relationships to genuine love culminates in his proposal to Rowan. His career triumphs alongside personal happiness, creating a balanced and fulfilling life.\n\n**Eva Dean**:\n- **Profile**: Zach's manipulative ex-girlfriend. Her schemes serve as a catalyst for turmoil but ultimately fail.\n- **Overall Experience**: Eva's disruptive actions eventually lead to her legal troubles and downfall, affirming Zach and Rowan's path forward free from her influence.\n\n**Jeremy Butler**:\n- **Profile**: Zach's supportive brother, who maintains close family ties and offers encouragement.\n- **Overall Experience**: He remains a source of familial support and encouragement throughout Zach's journey.\n\n**Dr. Kaya Baldwin**:\n- **Profile**: Rowan’s compassionate therapist who guides her through emotional healing.\n- **Overall Experience**: Helps Rowan reconcile with her past, contributing to her emotional well-being and acceptance of her future with Zach."
    }
]