[
    {
        "overall_sum": "Gigi Shin, a seventh-grade aspiring visual artist, wants to attend the Starscape Young Artists’ Program as a step toward the Tisch School of the Arts at NYU. Her parents, however, prefer a more conventional career path for her. Determined, Gigi forms the Ace Squad with friends Zeina, Carolina, and Emma to fundraise for Starscape through a peer tutoring club. Each friend contributes their strengths to different subjects, gradually attracting more students. Gigi struggles to balance her school responsibilities and the club amid increasing parental pressure, especially after a low science quiz score.\nTensions rise within the Ace Squad due to Gigi's leadership style and her decision to tutor Paul, a former student of Carolina’s, without consulting the group. This prompts the squad to establish rules for fair participation, strengthening their unity. Gigi connects with Paul, demonstrating her evolving maturity and complex friendship dynamics. When Gigi’s parents find out about her poor quiz score and secret club activities, she opens up about her artistic dreams, urging them to see the value of the club. They give her a chance to prove the worth of the Ace Squad.\nTo convince her parents, Gigi and her friends organize an arts-and-crafts party to showcase the club’s impact. Despite personal and academic hurdles, the event is a lively success, even drawing interest from their peers. Paul hints at a possible date, adding a personal subplot to Gigi’s journey. Gigi finally discovers her science test grade online—a ninety-one, which boosts her confidence and proves to her parents that she can balance schoolwork and the club.\nDuring the party’s conclusion, Gigi’s parents, along with those of her friends, decide to continue the Ace Squad, suggesting parental supervision and emphasizing the importance of maintaining grades. The parental support signifies a newfound understanding of the club’s mission and the children’s ambitions. Gigi and her friends celebrate by showcasing their diverse macaroni art at Emma’s house, symbolizing their collaborative efforts and individual contributions to the club. Through navigating challenges, securing parental support, and embracing their diverse talents, the Ace Squad fosters a sense of community and determination to continue pursuing their goals. With newfound resolve, Gigi looks forward to the next steps in her journey, ready to face whatever lies ahead.",
        "overall_char": "**Gigi Shin**:\n- **Profile**: Seventh-grade protagonist, aspiring visual artist, balancing artistic dreams with parental expectations and leadership responsibilities within the Ace Squad.\n- **Overall Experience**: Gigi develops self-awareness and leadership while managing pressures from family and the club. Her journey reflects her dedication to her artistic aspirations and learning to work collaboratively within the Ace Squad, all while navigating relationships with peers and family.\n\n**Zeina Hassan**:\n- **Profile**: Gigi’s close friend, Ace Squad’s English tutor, balancing her artistic aspirations with familial pressure for a medical career.\n- **Overall Experience**: Zeina consistently balances artistic and familial demands, providing stability and support within the Ace Squad and embracing collective goals.\n\n**Carolina Garcia**:\n- **Profile**: Ace Squad’s math/science tutor, interested in game design, balancing artistic pursuits with scientific interests under parental expectations.\n- **Overall Experience**: Harmonizes STEM interests with artistic pursuits, maintaining personal goals alongside group commitments and reinforcing strong interpersonal dynamics.\n\n**Emma Chen**:\n- **Profile**: Ace Squad’s newest member, skilled in languages and debate, blending personal and club aims.\n- **Overall Experience**: Adapts to the Ace Squad, aligning individual aspirations with club objectives, and fostering mutual growth and learning.\n\n**Paul Kim Wiley**:\n- **Profile**: Gigi’s peer seeking tutoring, personal connection deepens as he improves academically with the squad’s help.\n- **Overall Experience**: Intertwines academic progress with personal growth, fostering a deepening connection with Gigi amid shared experiences.\n\n**Tommy**:\n- **Profile**: Gigi’s younger brother, representing familial support dynamics, an enthusiastic participant in club activities.\n- **Overall Experience**: Acts as a familial support figure, providing contrast to Gigi’s struggles and motivations.\n\n**Parents**:\n- **Profile**: Gigi’s parents reconcile traditional values and academic expectations with their daughter's ambitions, facing financial limitations.\n- **Overall Experience**: Transition from traditionalist views to a supportive stance on Gigi’s artistic ambitions, highlighting cultural reconciliation and evolving parental understanding."
    }
]