[
    {
        "overall_sum": "Mara Billings, a production assistant for a fabricated haunting show called \"Haunt Sweet Home,\" grapples with her role's moral implications and a yearning for artistic fulfillment through woodcarving, a skill inspired by her grandmother. Complicated family dynamics, particularly with her cousin Jeremy, the charismatic but distant host, underscore her personal conflicts. The show exploits historic sites through engineered hauntings, with the Cleaveland House becoming pivotal when Mara's staged act inadvertently convinces skeptical homeowners of its authenticity.\nMara's path shifts with Jo's enigmatic entrance, whose supernatural presence unveils truths Mara avoids, compelling her to confront issues of identity and purpose. Despite wrestling with the work's deceit, Mara hesitates between accepting or rejecting its opportunities. Her connection with Jo—and the wood sculpture housing Jo's spirit—illuminates Mara's quest for self-worth and authenticity. Jo serves as both a creative muse and an otherworldly partner, with her presence challenging Mara to rethink her future.\nDuring a pivotal night at the Cleaveland House, a physically exhaustive escapade leads Mara to reconsider her involvement. Returning to the familial setting, she navigates her dual world of spirits and sculptures. Jo's disclosure of the unexpected, alien elements in the haunting emphasizes the supernatural's unpredictable nature, forcing Mara to reassess their symbiotic bond. Encounters with family, especially Oma's validating of Mara's craftsmanship, affirm her artistic journey and encourage exploration of new professional paths free from the restraints of her previous role.\nThe convergence of past and present reaches a clarifying point as Mara embraces the continuation with Jo, her woodcarving, and a newly offered production role that incorporates suggestions for authentic hauntings, bridging her creative aspirations with professional needs.",
        "overall_char": "**Mara Billings**:\n- **Profile**: Protagonist; aspiring artist and production assistant on a reality TV show. Tied to familial expectations while seeking identity through art aligned with her grandmother’s influence.\n- **Overall Experience**: Mara's journey is marked by reconciling her artistic desires with personal and professional challenges, leading to an enriched understanding of her self-worth and artistic identity.\n\n**Jo (Johanna Bowen)**:\n- **Profile**: Mysterious coworker with supernatural origins, tied to a sculpture Mara created. Embodies an intersection between Mara’s artistry and spiritual understanding.\n- **Overall Experience**: Serves as a bridge between Mara's artistic endeavors and spiritual realization, crucial for Mara’s journey to self-awareness and authenticity.\n\n**Jeremy**:\n- **Profile**: Mara's charismatic yet distant cousin, host of the reality show. Reflects familial tensions and expectations.\n- **Overall Experience**: Continues to be a symbol of family and professional expectation, shaping Mara’s self-perception and decision-making.\n\n**Oma**:\n- **Profile**: Mara’s grandmother, a seasoned woodcarver serving as Mara's artistic guide and mentor.\n- **Overall Experience**: A supportive influence on Mara’s development as an artist, facilitating her exploration of identity and authenticity.\n\n**Sathya (previously mentioned)**:\n- **Profile**: Support staff at Lulu’s restaurant.\n- **Overall Experience**: Reflects the theme of personal ambition and the influence of external narratives on identity.\n\n**Maggie and Conor Ferguson**:\n- **Profile**: Proprietors of the broadcasted Cleaveland House.\n- **Overall Experience**: Represent the tension between authentic living and the artifice of narrative constructions in the show."
    }
]