[
    {
        "overall_sum": "Jimena, an undocumented teenager in Brooklyn, confronts fears of deportation, understanding that her unstable situation affects every aspect of her life. She initially plots to marry for citizenship, considering relationships as a means to this end. Her friendship with Vitaly, a supportive neighbor, offers stability as they navigate personal and external challenges. Despite mutual but unspoken affection between Jimena and Vitaly, she refrains from pursuing romance due to her precarious situation.\nDuring a pivotal moment, Jimena confides in Sof, her best friend, about her undocumented status, which forges a stronger bond and brings relief and acceptance. This newfound openness helps her connect with Vitaly, especially during prom and a tense incident at a beach encounter with police where his support proves invaluable. Meanwhile, she meets Blue, an activist committed to social justice, at a DREAMers rally. His compassionate offer of marriage as a pathway to citizenship presents Jimena with a viable legal option.\nAmid growing tensions between heartfelt desires and practical necessities, Jimena accepts Blue’s offer, seeing it as the pragmatic choice for her future. They plan to announce their engagement at her birthday party, framing it as a genuine relationship for immigration purposes. But inside, Jimena grapples with her true feelings for Vitaly and the distinction between legal safety and romantic ideals.\nAt Jimena's birthday-slash-engagement party, organized by Sof, broader conflicts culminate. While Blue’s genuine but platonic proposal provides a lifeline, Jimena’s emotions are tested by Vitaly’s unexpected arrival and personal proposal, revealing his own desire to marry her genuinely. His revelation comes as a shock, disrupting well-laid plans and sparking heated discussions about the authenticity of their intentions and their intertwined futures. Jimena ultimately chooses Vitaly, realizing that their relationship is based on genuine love rather than a legal contract.\nIn a whirlwind decision, Jimena and Vitaly marry at Borough Hall, with Sof serving as their witness and Blue present as a supportive friend. As they step into their new life together, Jimena’s happiness is underscored by lingering concerns about how her undocumented status might impact her genuine relationship with Vitaly. Nevertheless, she resolves to embrace their future together, buoyed by love and renewed hope for stability.",
        "overall_char": "\n**Jimena**:\n- **Profile**: Protagonist, an undocumented teenager in Brooklyn confronted with the challenge of securing her future legally while navigating personal desires.\n- **Overall Experience**: Jimena evolves from secrecy and a focus on pragmatic survival strategies to embracing genuine affection and hope for a secure future with Vitaly, navigating the emotional complexities of love and legal obligations.\n\n**Blue**:\n- **Profile**: A young activist offering a practical path to citizenship through marriage to Jimena. His role embodies hope and social justice.\n- **Overall Experience**: Throughout the story, Blue remains a compassionate and supportive figure, helping Jimena navigate a challenging path to citizenship and grounding her amidst chaos with his steady pragmatism.\n\n**Vitaly**:\n- **Profile**: Jimena’s neighbor and steady support, aspiring Oxford student. He represents emotional trust and develops his affection for Jimena into a genuine desire to marry.\n- **Overall Experience**: Vitaly transitions from a supportive friend to a romantic partner for Jimena, ultimately committing to a future together despite challenges, illustrating his growth and deepening emotional connection with her.\n\n**Sof**:\n- **Profile**: Jimena’s best friend, consistently supportive, represents stability and understanding amid Jimena’s tumultuous journey.\n- **Overall Experience**: Sof embodies loyal friendship and a voice of reason throughout Jimena's challenges, providing crucial support as Jimena navigates her precarious status and personal relationships."
    }
]