[
    {
        "overall_sum": "Clove, also known by her prior identity Calla Lily, is a mother grappling with the traumatic shadow cast by her abusive father and the consequential imprisonment of her mother, who took the blame for his death to protect Clove. Relocated in Oregon, Clove strives to shield her children, Nova and Lark, from the chaos of her own upbringing. Clove’s precarious stability is disrupted when figures and truths from her past surface, especially through her complex friendship with Celine, originally introduced as Jane, a critical figure from Clove’s history in Hawaii.\nAs Clove is compelled to confront her past, Celine kidnaps Clove's children to reunite them with Clove’s mother, whom Celine had been secretly visiting. The intervention of The Butcher, a former lover, forces Clove to delve deep into memories of her role in her father’s death, ultimately unraveling the weave of her childhood trauma. Clove’s husband, initially unaware of her past, is caught in a storm of deception and revelation that tests their marriage's foundations.\nTogether, Clove and her husband manage to locate their children, culminating in a charged confrontation with Celine. Here, Celine discloses her survival from oppressive circumstances under her deceitful mother and her subsequent transformation. She demands that Clove face her history and liberate her mother by publicizing her story. Recognizing the necessity of this, Clove crafts her narrative, bracing to face the repercussions of unveiling hidden pasts.\nThe narrative reaches an emotional zenith in a reunion with Clove’s mother in prison, where issues of maternal sacrifice and the perpetuation of abusive cycles are brought to the fore. Clove reconciles with her mother’s past decisions, forging a path to not only liberate her mother but also reclaim her own narrative identity. \nThe epilogue details a morning of reflection and newfound hope for Clove. Her husband’s acknowledgment of her strength and their mutual understanding mark a potential reconciliation and partnership. Meanwhile, Celine brings urgent news about the viral spread of Clove’s story, underpinning Clove’s journey toward publically addressing the injustices that have clandestinely governed her life. The widespread support kindles optimism for her mother's release, emphasizing Clove’s resolve to see her family greet the future unbound by past shadows.",
        "overall_char": "**Clove/Calla Lily**:\n- **Profile**: Protagonist; a mother determined to protect her children from the traumas of her past while grappling with her own history of family abuse and identity.\n- **Overall Experience**: Clove's journey is marked by an evolution from secrecy and internalization of trauma to public acknowledgment and action, aiming for redemption and justice for herself and her family.\n\n**Clove's Mother**:\n- **Profile**: A passive figure who accepted blame for her husband's death, now serving time in prison, embodying sacrifice and resilience.\n- **Overall Experience**: Represents both victimhood and unseen strength, compelling Clove towards truth and justice, as her story becomes pivotal to the unfolding narrative.\n\n**Celine/Jane**:\n- **Profile**: Clove’s pivotal childhood friend from Hawaii, presumed dead, reemerges with a new identity, emblematic of survival and the pursuit of justice.\n- **Overall Experience**: Transforms from a symbol of shared victimhood to one of agency, challenging Clove to confront and reclaim her past.\n\n**Clove's Husband**:\n- **Profile**: A supportive yet initially unknowing partner, caught off guard by revelations of Clove’s past.\n- **Overall Experience**: Navigates the turbulence of trust and revelation within their marriage, ultimately embodying the hope for familial stability and mutual understanding."
    }
]