[
    {
        "overall_sum": "The story follows Angelo Bernardi and his brothers, who are compelled by their grandfather Nonno's will to marry within six weeks or forfeit their inheritance. Angelo, an academic, harbors unspoken feelings for his friend Olivia, also a university professor. As Olivia goes through a breakup with her boyfriend Darrell, Angelo seizes the moment to comfort her, thereby strengthening their emotional bond. Seeing Nonno's will as an opportunity, Angelo proposes a marriage of convenience to Olivia, hoping their relationship will become genuine while fulfilling the will's requirements. Olivia, though hesitant due to the unconventional arrangement, agrees, trusting Angelo's intentions.\nThe couple plans a modest wedding in the Adirondacks, aligning with Olivia's dream wedding. Initially apprehensive about their families' reactions, Olivia struggles with the idea of pretending. However, their engagement appears convincing to everyone. On the eve of their wedding, Olivia drunkenly admits her fear of falling in love and getting hurt, revealing her deep-seated feelings. This admission solidifies their mutual affection.\nTheir wedding day transforms the once-formal arrangement into a genuine union as their feelings evolve. Despite the initial contractual nature, their growing affection turns the marriage into a lasting partnership. Angelo remains committed to nurturing a loving relationship with Olivia beyond Nonno’s will, seeing their future together as a sincere endeavor.\nThree years into their marriage, Angelo and Olivia celebrate their third anniversary with their extended family, including Luca, who is now married with children. The event underscores the realization of Nonno's plan, as each brother has found a partner. Olivia and Angelo reflect on how Nonno's will led them to acknowledge their feelings and solidify their relationship. A toast to Nonno serves as an acknowledgment of his influence from beyond the grave in uniting the family under unexpected circumstances.",
        "overall_char": "**Angelo**:\n- **Profile**: Protagonist and member of the Bernardi brothers, bound by Nonno’s will to marry to inherit family wealth. An academic, deeply in love with Olivia.\n- **Overall Experience**: Initially motivated by the will, Angelo focuses on developing a sincere relationship with Olivia, fulfilling both the will’s conditions and his emotional desires. Over time, he finds lasting happiness in their authentic love.\n\n**Olivia**:\n- **Profile**: A university professor and Angelo's close friend, intelligent and independent, gradually opens up to her romantic inclinations.\n- **Overall Experience**: Transitioning from skepticism to embracing her genuine feelings for Angelo, Olivia transforms a marriage of convenience into a loving and enduring partnership.\n\n**Luca**:\n- **Profile**: Angelo’s brother, initially resistant to marrying for inheritance, now a family man with a wife and children.\n- **Overall Experience**: From resisting the will's conditions, Luca embraces family life, finding fulfillment in marriage and fatherhood, crediting Nonno’s will for sparking change.\n\n**Nonno**:\n- **Profile**: The late grandfather whose will dictates the family’s actions.\n- **Overall Experience**: Although not present, Nonno’s influence is pervasive, successfully encouraging his grandsons to find happiness through marriage."
    }
]