[
    {
        "overall_sum": "Riley Jo, a Korean American teenager, faces challenges at Carlmont Academy, navigating racial biases and family expectations while pursuing a music career. Initially struggling to assert herself in the school band, RGB, she contends with the privileged Bodhi Collins and their dismissive advisor, Blake Collins. During a pivotal Spring Concert, Riley performs a new song, expressing frustration with racial inequities, witnessed by her family, signaling a moment of self-assertion.\nHer friendship with Xander, a filmmaker documenting the school's music scene, highlights deeper societal biases. Xander's documentary, capturing these biases, sparks mixed reactions and an investigation into Riley and Xander's conduct. Facing potential consequences, Riley urges investigation into Blake's discriminatory behavior, revealing broader systemic issues.\nConversations with her family bring reconciliation and understanding of their immigrant history. Ms. Morales, a supportive teacher, encourages Riley to continue her music journey, highlighting the importance of authenticity. As Riley grapples with the investigation, she finds strength in friendships and decides not to be defined by the industry's biases.\nThroughout her final month at Carlmont, Riley writes about her Asian American experiences and supports efforts to hold Bodhi accountable. The investigation concludes with minimal repercussions for Bodhi, but shines a light on systemic discrimination. Back in Arkansas, Riley reconnects with her family, who now better understand and support her aspirations. Her father's encouragement rekindles her musical dreams. She chooses Hartfordshire U for college, near home but expansive in possibilities. Throughout, Riley discovers resilience through self-expression, building hopes for inclusivity in music.\nMonths later, at Hartfordshire U, Riley excels in music composition and finds support from family and friends. She maintains hope for future reconciliations, valuing personal and artistic growth. Riley receives an unexpected opportunity from 88rising, a record label interested in her music. This moment symbolizes her commitment to authenticity, embracing her identity and breaking free from past limitations imposed by figures like Blake. With support from her family, especially her mother, Riley feels empowered to pursue her passion, confident in her unique voice within the music industry.",
        "overall_char": "**Riley Jo**:\n- **Profile**: The protagonist, a musically driven Korean American teenager, navigating Carlmont Academy's challenges and societal biases.\n- **Overall Experience**: Riley’s journey reflects struggles for recognition and authenticity amid biases, finding strength through self-expression and advocating diversity in music. This segment highlights her evolution from compromise to authenticity.\n\n**Griff**:\n- **Profile**: A bandmate of Riley in RGB, navigating similar struggles about acceptance and success in the music industry.\n- **Overall Experience**: Griff represents the complexity of balancing cultural identity and industry pressures, evolving toward clarity and reconciliation with Riley.\n\n**Xander McNeil**:\n- **Profile**: A filmmaker documenting Carlmont's music scene and challenging systemic biases.\n- **Overall Experience**: Xander acts as a catalyst for revealing biases, supporting Riley's growth while facing his own challenges in their friendship dynamics.\n\n**Aerie Jung**:\n- **Profile**: Riley's supportive roommate and ASA leader, focusing on cultural representation.\n- **Overall Experience**: Aerie symbolizes the importance of support and representation, assisting Riley in addressing biases and striving for authenticity in music.\n\n**Elise Jo**:\n- **Profile**: Riley's younger sister, who supports and advises Riley, representing familial love and insight.\n- **Overall Experience**: Elise symbolizes familial love and wisdom, offering new perspectives and supporting Riley's evolving aspirations."
    }
]