[
    {
        "overall_sum": "Aihui Ying infiltrates the Engineers Guild in Fei under her brother Min’s identity to uncover the truth behind her father's murder and uphold his engineering legacy. As she navigates the guild's political and academic challenges, Ying forms alliances, interferes with sinister plots, and uncovers secrets that change her perspective on the people around her. She suspects political motives behind adversaries like Master Gerel, strengthening her resolve to protect her father’s research.\nYing’s mission is complicated by her brother Wen's arrival in Fei and wars against the Great Jade Empire. At a palace banquet, Ying discovers a jade pendant tied to her father’s death, intertwined with Ye-yang, raising conflicting emotions when her sister Nian’s engagement to him is announced. Further investigations hint at imperial threats, with Ye-yang providing insights reshaping Ying's understanding of her father’s murder. His involvement intensifies Ying's resolve as she distances herself to protect her father’s legacy.\nAs her obsession with research grows, Ying creates potent weaponry and engages in hidden dynamics of secrecy and ambition. Her cannonball design’s success during the guild’s test garners attention and leads to a fateful audience with High Commander Aogiya Lianzhe—a man tied to her father’s past. This confrontation unveils personal betrayals and the familial ties between the High Commander and Master Lianshu.\nYing faces a critical moment of choice when the High Commander demands her father’s journal. She defies him, opting for vengeance. A tense confrontation arises, and Ye-yang betrays his father to seize power while allowing Ying to execute her retribution. After succeeding, Ying realizes she has been a pawn in Ye-yang’s calculated rise to power. Dissatisfied with this reality, she chooses to return to her roots, leaving behind the treacherous world of Fei.\nIn the countryside, Ying contemplates the past and her resolve to honor her father’s ideals. Despite Ye-yang’s attempts to reconcile and his promise to return, Ying decides to preserve her values, rejecting political entanglement and choosing personal integrity over ambition.",
        "overall_char": "**Aihui Ying**:\n- **Profile**: Protagonist; Resilient, resourceful, seeking truth about her father’s murder while maintaining an engineering legacy, disguised as her brother.\n- **Overall Experience**: Ying evolves from a seeker of answers to someone seeking justice. She becomes disillusioned by betrayals but determined to remain true to herself and her father’s ideals.\n\n**Ye-yang**:\n- **Profile**: Enigmatic beile; Initially supportive, revealed deeply involved in Ying’s father's murder, strategically manipulative.\n- **Overall Experience**: Ye-yang's journey is one of complexity, from ally to manipulator. His ambition leads to manipulating those around him, ultimately shaping him as a powerful yet morally ambiguous figure.\n\n**Nian**:\n- **Profile**: Ying’s sister, engaged to Ye-yang, unaware of the underlying political and personal turmoils.\n- **Overall Experience**: Serves as a familial link that complicates Ying’s emotional landscape when intertwined with Ye-yang’s plots.\n\n**High Commander (Aogiya Lianzhe)**:\n- **Profile**: Antagonist; Once Ying’s father’s friend, linked to his death, driven by power and legacy.\n- **Overall Experience**: His role highlights the conflict between legacy and integrity, ultimately dying as a result of the power struggles he fueled.\n\n**Lady Odval**:\n- **Profile**: Member of the High Commander’s household, initially unaware of plots against him.\n- **Overall Experience**: Represents the casualties of power struggles, her fate sealing political narratives created by Ye-yang."
    }
]