[
    {
        "overall_sum": "Mama Mary Okafor's planned seventieth birthday in Toronto unexpectedly transforms into a funeral gathering, unraveling buried family tensions and divergent beliefs. As the family converges, Joy Okafor, the protagonist, grapples with balancing cultural expectations and her own skepticism, further complicated by Auntie Nancy's sensational claims of a pending resurrection. These claims turn the somber occasion into a public spectacle, drawing both family and media into an uncertain wait for the miracle, amidst growing skepticism.\nAs events unfold, Michael Okafor, Joy's brother, faces profound revelations about his adoption and marital woes. His search for guidance brings him to Joy’s ex-husband David, adding layers of complexity to an already tangled narrative. Personal conflicts reach a tipping point, contrasting Joy's pragmatic approach with Nancy’s prophetic beliefs and the involvement of religious figures like Pastor Lazarus. While the senior family members wrangle over matters of faith and familial duty, the younger generation—Jamil, Sarah, Yemi, and Rob—undertakes a journey of personal discovery and belief. Rob’s recent relocation to Ghana introduces an additional layer of familial pressure. The verification of Michael’s adoption through a spiritual ritual challenges traditional family understandings of kinship, sparking deeper introspection.\nDespite Nancy’s confident assertions, the anticipated resurrection event does not materialize, inciting a severe panic attack in Joy, who buckles under the pressure of familial obligations. Dialogues with ex-husband David reveal the depth of her responsibilities and juxtapose Joy’s burden against Jamil’s innocence. Yet, hints of family reconciliation emerge when Joy and Michael share a moment of reflection on their mother's cherished music, bridging gaps over long-hidden family secrets.\nRob proposes a wake for Auntie Mary, gaining reluctant support from Joy, who finds peace in the shared responsibility. As Nancy's grief surfaces through her resistance, her daughter Nnenna, despite her own fatigue, decides to assist with arrangements, indicating a shift towards unity. The family's emotional and logistic preparations for the wake mirror their internal trials. Meanwhile, Rob attempts to summon guests but faces disappointment; in response, he repositions the wake as a family-focused memorial. Ezekiel’s encouragement for Rob to be candid about his life choices reflects an acceptance and boundary of familial love, hinting at a slow transformation in family dynamics. The events are set against the scene of a family both mourning and beginning to reconcile, with Joy emerging ready to confront the new reality, placing family and healing above external pressures.\nAs the family gathers for the wake, Joy applies the finishing touches to her appearance, embodying her mother's spirit despite her absence. In an intimate setting, her son Jamil reads a meaningful Bible verse chosen by Mama before her passing, catalyzing a shared sense of peace and connection. A butterfly landing on Mama’s picture serves as an emblem of her presence, soothing Joy and awakening a reverent recognition in Auntie Nancy, bridging the gap between faith, loss, and acceptance.",
        "overall_char": "**Joy Okafor**:\n- **Profile**: Protagonist, pragmatic and deeply emotional life coach, dealing with cultural traditions and personal loss.\n- **Overall Experience**: Grapples with cultural challenges, personal loss, and aspires to reconcile through vulnerability and familial bonds, focusing more on family healing over past work responsibilities.\n\n**Michael Okafor**:\n- **Profile**: Joy’s brother, unreliable with recent revelations about adoption, seeks acceptance and understanding.\n- **Overall Experience**: Transitions from familial discord to self-awareness, seeking healing and mending family ties after learning about his adoption.\n\n**Rob**:\n- **Profile**: Joy and Michael’s cousin, moved to Ghana, light-hearted and supportive.\n- **Overall Experience**: Offers light-hearted support, seeking to strengthen familial bonds amidst grief and personal growth in his transition to Ghana.\n\n**David**:\n- **Profile**: Joy’s ex-husband, father of Jamil, provides support amidst family turmoil.\n- **Overall Experience**: Acts as a mediator and a supportive anchor, highlighting the complex role of past and present in family healing.\n\n**Jamil**:\n- **Profile**: Joy’s son, observant and curious about belief.\n- **Overall Experience**: Embodies youthful curiosity and serves as a potential bridge for family unity during turbulent times.\n\n**Sarah**:\n- **Profile**: Michael’s daughter, undergoing self-discovery amid family secrets and tension over identity.\n- **Overall Experience**: Embarks on self-discovery and explores themes of identity, within family contexts.\n\n**Nancy**:\n- **Profile**: Joy and Michael's aunt, firm believer in resurrection claims.\n- **Overall Experience**: Provides a counterpoint of faith amidst practicality, navigating grief and beliefs while impacting family dynamics.\n\n**Nnenna**:\n- **Profile**: Joy's cousin, Nancy’s daughter, often caught between family conflict.\n- **Overall Experience**: Supports family healing despite internal family pressures, reflecting potential for personal growth."
    }
]