[
    {
        "overall_sum": "Maddie Sanderson embarks on a poignant quest to fulfill her late brother Josh’s last wishes, spreading his ashes at meaningful destinations connected to his life. The journey takes Maddie to places like Idaho’s Sawtooth Mountains, Kansas, North Dakota, and Alaska. These locations symbolize stages in Maddie's journey of grief, healing, and a burgeoning relationship with Dom, a close friend of Josh's. Maddie confronts personal and familial challenges, especially with her mother, Cecilia, whose actions ultimately cause distance between them. \nMaddie navigates nostalgia and heartache surrounding Dom, Josh’s childhood friend and her travel companion, while also dealing with her asthma and emotional breakdowns, symbolizing her inner turmoil. A critical turning point occurs in North Dakota when a familial crisis involving Dom’s ex-wife, Rosaline, forces Maddie to face her feelings alone. Dom’s proposed future with Maddie presents its challenges as they address their emotions clouded by past relationships—particularly Dom's marriage to Rosaline, driven more by responsibility than love.\nAs Maddie returns to Seattle, the pressure of professional life and unresolved emotions intensifies. Support from family friends Adam and Carter Perry, along with Dom, helps Maddie confront her past and its grip on her. Their companionship reinforces her journey back to Alaska, which becomes a symbolic location for both Maddie’s final farewell to Josh and her acceptance of living with loss. In Alaska, Maddie discovers one of Josh’s hidden puzzles, revealing a photo of him and Rosaline and enriching her understanding of his life.\nThe journey's culmination fosters forgiveness, understanding, and deeper relationships as Maddie and Rosaline connect over their shared love for Josh. Josh’s past reveals a hidden depth to Rosaline’s prior relationship with him, bringing closure and insight to Maddie. Through these experiences, Maddie accepts her love for Dom, addressing fears of abandonment. She emerges from the journey embracing a loving future with Dom, built on mutual understanding and overcoming past doubts.\nIn the epilogue, Maddie, Dom, Rosaline, Adam, and Carter take more trips to honor Josh. They reflect on their respective healing paths, reinforced by mutual support and shared memories of Josh. Maddie rejects her mother Cecelia’s attempts to profit from Josh’s memory, solidifying the family she’s built with Dom, Rosaline, and their friends. This newfound family bonds through communal rituals of memory and love, as seen when they embrace Rosaline’s difficulty in spreading Josh’s ashes, allowing her—and themselves—space for healing. These connections ensure that Josh’s essence lives on within them. Maddie closes her journey, having found peace and a supportive family with whom she continues Josh’s legacy by cherishing life’s joys and challenges.",
        "overall_char": "**Maddie Sanderson**:\n- **Profile**: The protagonist focused on fulfilling her brother Josh’s last wishes, she faces her grief and forms a burgeoning romance with Dom, while navigating complex family dynamics.\n- **Overall Experience**: Maddie transitions from emotional avoidance to vulnerability and healing. With Dom and her newfound family’s support, she secures peace with her brother’s memory and courage to embrace love.\n\n**Dominic \"Dom\" Perry**:\n- **Profile**: Maddie’s companion and Josh’s loyal friend whose love grows into a romantic bond with Maddie.\n- **Overall Experience**: Dom evolves from a supportive friend to Maddie’s romantic partner, pivotal in her healing and emotional journey. His unwavering understanding is central to their evolving relationship.\n\n**Rosaline**:\n- **Profile**: Dom’s ex-wife and Josh’s secret love, who faces emotions tied to past relationships and losses.\n- **Overall Experience**: Her memories with Josh and emotional honesty illuminate Josh’s past for Maddie, fostering shared understanding and reconciliation between them."
    }
]