[
    {
        "overall_sum": "Following the mysterious death of Parrish Eddings, the Saint Cecilia Resort becomes a battleground of secrets and crime. Traci Eddings, the resort's manager, uncovers a web of family secrets and conspiracies. Central to the turmoil is a hidden past involving Fred Eddings's manipulation of Shannon and the revelation that Livvy, Shannon's daughter, is Fred's secret child. Livvy finds herself in the center of these conflicts, asserting her presence within the Eddings family and seeking justice for Parrish with her friend, Felice, the resort’s chef.\nTheir investigation exposes a theft ring involving Garrett Wycoff, orchestrated by resort manager Charlie Burroughs. After surviving a fire set in their dormitory, Livvy and Felice play pivotal roles in unraveling other criminal activities within the resort. Shannon stands by Traci, further exposing the corrupt activities of Ric Eddings and his attempts to manipulate his father’s will, which threaten the entire estate.\nScott Whelan, a veteran investigator, joins forces with Traci, seeking justice over his brother Hudson’s suspicious death, which ties into Parrish’s case. Amidst these developments, Traci and Shannon focus on their mission against Fred and Ric’s pervasive influence, while navigating personal and professional challenges.\nAs the plots around the resort deepen, Traci discovers Madelyn’s involvement in schemes targeting Livvy and the family, aiming to secure the Eddings' legacy for herself. In a pivotal and dramatic confrontation at Traci's home, Garrett, threatening Felice, is subdued. Garrett’s confessions unveil Madelyn’s orchestration of the crimes, revealing the events were driven by family vendettas and greed.\nIn the ensuing confrontation, Madelyn arrives, and after a struggle, she shoots Garrett. Law enforcement arrests her, and Traci captures this on her phone, wrapping up the immediate threat in the family’s pursuit of justice.\nFollowing these events, Traci and Whelan reflect on their relationship and reconcile romantically. Whelan decides to discontinue his role at the resort to avoid conflicts now that they are a couple. Traci later confronts Ric Eddings over his role in the family’s turmoil and his hostile intentions toward Olivia, reinforcing her determination to protect Olivia’s rightful heritage.\nOne year later, Livvy takes on her new role as co-owner of the hotel, growing more confident and establishing her place in the family. With Traci pregnant and content alongside Whelan, they look forward to the future, while Livvy and other key figures, like Felice and Shannon, embrace new beginnings. The resort begins a new chapter free from the shadows of betrayal.",
        "overall_char": "**Olivia (Livvy)**:\n- **Profile**: Resourceful and determined, Livvy faces familial and moral crises, pivotal in asserting her influence within the Eddings' affairs amid unfolding truths.\n- **Overall Experience**: Livvy, once facing familial upheaval, emerges as a vital figure advocating for justice and equilibrium amidst betrayal, asserting her place within the Eddings legacy.\n\n**Traci Eddings**:\n- **Profile**: Resilient manager of the Saint Cecilia Resort, dealing with familial crises as secrets unravel around her.\n- **Overall Experience**: Traci moves from familial victimhood to justice-seeker, emphasizing her growth and alliances to reclaim integrity within her family legacy and the resort.\n\n**Scott Whelan**:\n- **Profile**: Astute investigator unearthing intersecting mysteries, involved in personal vendettas tied to resort malfeasances.\n- **Overall Experience**: His commitment intertwines with Traci's pursuit of truth, enhancing their shared drive for revelations, amidst mounting personal stakes.\n\n**Shannon**:\n- **Profile**: Traci’s reliable ally resurfaces from a complex past to confront Fred's lasting repercussions and protect her daughter.\n- **Overall Experience**: Her story arc reflects healing and fortitude, reinforcing ties and counteracting ingrained corruption to ensure familial justice.\n\n**Felice**:\n- **Profile**: Courageous chef central to exposing resort irregularities, showcasing loyal bravery.\n- **Overall Experience**: Felice embodies rebounding vigor, folding culinary passions with crucial alliances and righteous defiance against pervasive threats.\n\n**Garrett Wycoff**:\n- **Profile**: Initially complicit in crimes within the resort, revealing deeper connivance.\n- **Overall Experience**: His confessions signify a turning point in revealing systemic issues within Saint Cecilia while aiding key characters in confronting these truths."
    }
]