[
    {
        "overall_sum": "Frankie McGrath, haunted by her brother Finley's death, enlists as an Army nurse and witnesses the brutal realities of the Vietnam War, developing a romantic bond with pilot Rye Walsh. Returning to the U.S. in March 1969, she faces societal hostility and severe PTSD. With the support of friends Barb and Ethel, she becomes an anti-war activist and resumes her nursing career. A brief romantic connection with psychiatrist Henry Acevedo offers potential solace.\nIn 1972, an unplanned pregnancy leads to a miscarriage, profoundly affecting her relationship with Henry. She decides against marrying him, unable to move past her feelings for Rye. After discovering Rye is a POW who has returned and secretly married, Frankie is devastated but decides to face her painful reality head-on. She attempts to rebuild her life amid nightmares from Vietnam. A recurrence of traumatic memories results in her relying on pills and impairs her work, leading to forced leave.\nRepeated encounters with Rye intensify her turmoil. A visit from Rye reveals his struggles and enduring feelings, pushing Frankie to confront her past wounds. As her life wavers between passion and shame over their affair, it culminates in a near-tragic accident. Recovering in a hospital, she faces her mental health struggles. Detox treatment helps her understand her PTSD better, starting her journey to recovery.\nBalancing between recovery and trauma, with the help of Henry and Dr. Alden, she begins a new life, selling her parents' bungalow and moving to Montana with Barb. In Montana, Frankie sets up a ranch named \"The Last Best Place\" as a haven for women who served in Vietnam, supporting them through their traumas alongside Donna.\nIn September 1982, she receives an invitation for the unveiling of the Vietnam Veterans Memorial and a reunion of the 36th Evac Hospital staff. She attends with Barb and Ethel. At the event, she faces her past, reconnects with old comrades, reconciles with her father, and reunites with Jamie, her former love. Frankie's journey culminates in a moment of healing and hope, emphasizing a story of remembrance and resilience.",
        "overall_char": "**Frankie McGrath**:\n- **Profile**: Protagonist; former Army nurse dealing with PTSD, addiction, and personal trauma.\n- **Overall Experience**: Evolves from a deeply troubled individual haunted by war memories to a resilient woman who finds purpose in helping others. Her journey to recovery culminates in moments of healing and closure at the memorial.\n\n**Rye Walsh**:\n- **Profile**: Vietnam War pilot and POW; Frankie's former lover, married to Melissa.\n- **Overall Experience**: Represents Frankie's unresolved past. His return forces Frankie to confront her emotions and trauma, pushing her towards healing and self-acceptance.\n\n**Henry Acevedo**:\n- **Profile**: Psychiatrist and director of the detox facility; Frankie's former romantic interest.\n- **Overall Experience**: Acts as a beacon of support. His guidance helps Frankie address her PTSD and addiction, fostering her emotional growth and recovery.\n\n**Barb**:\n- **Profile**: Frankie's longtime friend and fellow nurse from Vietnam.\n- **Overall Experience**: Serves as a close friend and anchor, helping Frankie through recovery and building the ranch. Attends the memorial event, emphasizing the shared bond and healing from their war experiences.\n\n**Ethel**:\n- **Profile**: Frankie's longtime friend and fellow nurse from Vietnam.\n- **Overall Experience**: An essential figure in Frankie's journey, providing emotional support and participating in shared war memories and recovery efforts.\n\n**Donna**:\n- **Profile**: Nurse and Vietnam vet; partners with Frankie at the Last Best Place Ranch.\n- **Overall Experience**: Joins Frankie in building a haven for women veterans, offering mutual support and healing through shared work and experiences.\n\n**Finley McGrath**:\n- **Profile**: Frankie's deceased brother, a figure of lasting emotional impact.\n- **Overall Experience**: Represents the personal cost of war on Frankie. His death motivates her service, activism, and journey toward healing."
    }
]