[
    {
        "overall_sum": "Riley Larson, a recent high school graduate, embarks on a journey to New York City to explore independence and self-discovery through a guided \"Getaway List.\" Reuniting with childhood friend Tom and her ex-boyfriend Jesse, she forms new bonds with spirited photographer Mariella and budding writer Luca. The city's vibrant backdrop sets the stage for Riley's emotional evolution as she contends with family pressures, creative aspirations, and deepening friendships. Throughout the summer, an anonymous admirer sends heartfelt gifts via the \"Dear, Love\" Dispatch app, which influences group dynamics. Riley discovers Tom's involvement, prompting her to reassess their relationship. However, rather than seeking romance, Riley commits to nurturing their friendship, reinforcing her sense of self-worth. Confrontations with Jesse encourage her to pursue honesty in her relationships, contributing to the complexity of her interactions with both Tom and others.\nAs Riley navigates these relationships, Mariella and Luca emerge as a romantic couple amid familial discoveries during an event dubbed Brownie Bonanza. Meanwhile, Tom's revelation of his mother's absence in New York preludes his impending departure, becoming a pivotal moment for the group and prompting Riley to confront her feelings for him. Despite confessing her long-standing affection, she prioritizes Tom's journey towards personal growth, spurring him to leave amid intimate confessions and emotional farewells. The parting ignites Riley's self-reflection, recognizing the transient yet profound bonds formed over the summer.\nFollowing Tom's departure, Riley and her mother reconcile in New York, mending misunderstandings about her life choices, the significance of her friends, and her mother's own NYC youth. This dialogue brings clarity and motivation for Riley to stay in New York, balancing independence with familial love. Upon her mother’s visit, Riley becomes more attuned to the joys and challenges of city life, while Tom's absence leaves the group in search of equilibrium without their grounding force. As tensions surface between the friends, their collective decision invites them to reach out to Tom, highlighting his emotional and social value through shared memories and impactful contributions to the city.\nIn a bold move, the group travels to Tom’s aunt's winery in Virginia. They bring a scrapbook filled with their summer's adventures and \"Dear, Love\" stories, illustrating Tom’s efforts in knitting people together in New York. When Riley encounters Tom, poised to leave again, their laughter and emotional reunion rekindle his connection to the group. As he shares his intentions to resolve personal issues regarding his mother back in New York, Riley’s acknowledgment of their inseparable bond reassures him of the home they've built together with their friends. Ready to embrace the next chapter in their lives, the group, now reunited, returns to New York, celebrating the nurturing camaraderie and love that brought them closer together.\nIn the epilogue, Riley and her friends launch \"The Getaway List\" app, highlighting their growth and achievements. The project celebrates creativity and collaboration among Riley, Mariella, and Luca. Tom has embraced his role in their community and is preparing to celebrate his anniversary with Riley through a camping trip, symbolizing a new beginning for their relationship. Their journey culminates in understanding home as a feeling rather than a place, capturing the essence of self-discovery, friendship, and the resilience that brought them to this point.",
        "overall_char": "**Riley Larson**:\n- **Profile**: Protagonist, recent high school graduate navigating independence and self-discovery in NYC. Creative, introspective, exploring familial ties and personal ambitions.\n- **Overall Experience**: Riley’s time in NYC highlights her journey of self-discovery, marked by complex emotions and strengthened by friendships and family ties. Her decision to stay in New York reflects growth and newfound self-understanding.\n\n**Tom**:\n- **Profile**: Childhood friend central to Riley’s emotional journey, balancing personal desires and friendship commitments. Involved with the \"Dear, Love\" Dispatch app.\n- **Overall Experience**: Tom's growth is marked by resilience, navigating personal struggles while recognizing his role in supporting a community. His return to New York symbolizes a renewed commitment to relationships and self-exploration.\n\n**Jesse**:\n- **Profile**: Former boyfriend, lively musician encouraging sincerity and honesty in relationships.\n- **Overall Experience**: Transitions from past romantic interest to steadfast friend, advocating honesty and friendship in relationships, contributing to a supportive dynamic within the group.\n\n**Mariella**:\n- **Profile**: Spirited and savvy photographer, critical friend aiding Riley.\n- **Overall Experience**: Represents the potential for deep, supportive friendships, advocating open communication and personal development, culminating in a new relationship with Luca.\n\n**Luca**:\n- **Profile**: Aspiring writer, creative and supportive, integral to the group’s artistic endeavors.\n- **Overall Experience**: Embodies stability and creativity while representing ambition and evolving friendships, culminating in a new romantic relationship with Mariella.\n\n**Riley's Mother**:\n- **Profile**: Supportive, deeply connected to Riley’s aspirations and challenges, with a past in New York influencing current perceptions.\n- **Overall Experience**: Balances concerns with encouraging Riley’s autonomy. Her personal history informs her supportive role in Riley’s journey."
    }
]