[
    {
        "overall_sum": "In March 2019, climbers Dylan Prescott, Luke Woodhaven, Clay Foster, and Sylvia Burnett travel into a seemingly haunted Kentucky forest for a climbing adventure. Initially joyful and full of camaraderie, the trip quickly devolves into terror as Luke suffers from an infected leg, Sylvia goes missing, and the once vibrant forest exudes an unsettling atmosphere. As fear intertwines with the eerie environment, Dylan assumes leadership, managing growing tensions and supernatural events, including ominous animal mutilations that compound their fears.\nFlashbacks to 1982 reveal the forest's tragic past, where a séance led to a massacre of teenagers, resulting in the genesis of its curse, tying into the present. Clay, influenced by supernatural forces, reveals that he murdered Sylvia. The group rapidly disintegrates, leaving Dylan and Luke to abandon Clay, who eventually falls victim to the forest's ghosts.\nLeft alone with Luke, Dylan discovers a ghostly cabin filled with eerie spectacles. Following an escalating confrontation, Dylan is forced to defend herself against Luke, who, warped by paranoia and supernatural deceit, accuses her of killing his dog, Slade. In a desperate bid for survival, Dylan kills Luke, an act that causes immense emotional turmoil and leaves her isolated and desperate.\nStruggling through the hostile environment, Dylan continuously battles the psychological strain and the forest's manipulative power. Her phone offers a brief hope of rescue before the malevolent entities close in on her. In the harrowing climax, Dylan climbs a rock wall, only to be confronted by ghostly apparitions of her deceased companions. Her desperate climb ends in a deadly fall as the supernatural realm claims her.\nIn the aftermath, Tabitha, Clay's friend, grows concerned after not hearing from the group in April 2019. Her investigations uncover that the entire valley has mysteriously disappeared. Despite her pleas, local authorities cannot locate any traces of the missing climbers. The storyline garners national attention with rampant speculation and supernatural theories adding layers of intrigue. Subsequent searches reveal the ghostly influence over the area, yet concrete evidence remains elusive until the place finally finishes \"digesting,\" leaving no trace.",
        "overall_char": "**Dylan Prescott**:\n- **Profile**: Dylan is the protagonist—a resilient and pragmatic climber thrust into survival mode amidst supernatural dangers. Her leadership and resourcefulness are repeatedly challenged amid escalating horrors.\n- **Overall Experience**: Dylan evolves from an ambitious climber into a battle-hardened survivor, confronting psychological strain, supernatural threats, and personal betrayal. Her journey underscores themes of resilience and the tragic cost of survival.\n\n**Luke Woodhaven**:\n- **Profile**: Dylan's boyfriend, whose injuries and perceptions twist into vivid hallucinations, leaving him vulnerable to the forest's manipulations.\n- **Overall Experience**: Luke serves as a bridge between reality and illusion, his descent into paranoia becoming a crucial narrative pivot. His tragic fate highlights the catastrophic interplay of mistrust and supernatural influence.\n\n**Clay Foster**:\n- **Profile**: A once-steady scholar whose paranoia and aggressive behavior devolve into madness under the forest’s malign influence.\n- **Overall Experience**: Clay epitomizes the destructive power of the forest’s curse, his eventual gruesome fate manifesting the collapse from rationality to madness.\n\n**Sylvia Burnett**:\n- **Profile**: A vibrant member of the climbing group whose disappearance and death are central to the unfolding tragedy.\n- **Overall Experience**: Sylvia’s abrupt murder catalyzes the unraveling of the group, her fate revealing the forest’s relentless hunger for souls.\n\n**Tabitha**:\n- **Profile**: Clay’s friend who becomes concerned over the missing group. Driven by worry, she embarks on a search for answers.\n- **Overall Experience**: Tabitha acts as a link between the vanished climbers and the outside world. Her exploration of the missing group adds layers of intrigue and frustration to the narrative backdrop."
    }
]