[
    {
        "overall_sum": "At Alfred Nobel Academy (ANA), a series of events unfolds surrounding a group called the Fishermen, known for their toxic culture and abuse. Elizabeth Wang, a victim of this group, seeks justice after being assaulted by Jude Ripley and coerced by August Owens. Her efforts to report the incidents are dismissed by the apathetic Headmaster Webber. Driven by the need for justice, Elizabeth, with the help of her ally Sade, investigates the Fishermen to expose their crimes. After surviving a life-threatening altercation involving Jude and August, Elizabeth is saved by April Owens, whose loyalties are torn between the Fishermen and her conscience.\nConcurrently, Sade, alongside Persephone and Baz, launches a website to let students anonymously share their experiences, challenging the school's authority and drawing wider attention to the issue. April confesses to Jude's murder, claiming it was to protect her boyfriend, Francis. Sade confronts April, unveiling layers of manipulation within their group. Francis confesses his part in the affair, expressing remorse yet prioritizing the protection of April. The school's response to the scandal is insufficient, only offering superficial measures against bullying.\nElizabeth decides to leave ANA to start anew after her traumatic experiences. Before leaving, she shares a touching moment with Baz and Sade, who continue their fight against the injustices at the academy. During an assembly, Headmaster Webber announces Sade's expulsion for her involvement with the website. Despite the initial shock, Sade receives support from her friends, Persephone and Baz. Shortly before leaving, she learns her expulsion is under review by the board after Webber is replaced by a more supportive headmaster, Ms. Laurens.\nFast forward a year, and much has changed. Ana is led by the newer headmaster, focusing on students' well-being and holding guilty Fishermen accountable, although some systemic issues remain. Sade decides to stay at ANA, continuing her studies, and enjoying life as part of the school's swim team and in a relationship with Persephone. While she still grapples with her trauma and dreams of her late sister, Sade finds strength and happiness in her friendships and new experiences, concluding her journey with a renewed sense of hope and belonging.",
        "overall_char": "**Elizabeth Wang**:\n- **Profile**: A conscientious student at ANA, Elizabeth plays a pivotal role in confronting the Fishermen and pushing against institutional negligence.\n- **Overall Experience**: Elizabeth evolves from a victim to a proactive force against the Fishermen, ultimately deciding to move forward with her life by leaving ANA.\n\n**Sade**:\n- **Profile**: A determined and resilient student, Sade becomes a crucial ally in Elizabeth’s campaign for justice at ANA.\n- **Overall Experience**: Sade experiences significant personal growth, confronting systemic injustice and her own grief, emerging more confident and surrounded by supportive friendships.\n\n**Persephone**:\n- **Profile**: A supportive and intelligent student, Persephone is part of Sade’s close circle, offering both friendship and romantic interest.\n- **Overall Experience**: Persephone stands as a strong pillar for Sade, contributing to her personal growth and happiness at ANA.\n\n**Baz**:\n- **Profile**: Sade’s humorous friend, loyal and playful, essential to the group’s camaraderie.\n- **Overall Experience**: Baz maintains his role as a steadfast friend, supporting the fight against the Fishermen and providing comic relief amidst the tension.\n\n**Miss Blackburn**:\n- **Profile**: Administrative figure open to justice and institutional change, despite her initial stern demeanor.\n- **Overall Experience**: Miss Blackburn emerges as an ally, pushing back against previous administrative negligence to advocate for student welfare.\n\n**Headmaster Webber**:\n- **Profile**: Symbolizes institutional indifference, embodying the systemic failure to protect students at ANA.\n- **Overall Experience**: Represents the inertia of existing power structures, ultimately ousted to ensure a safer environment at ANA."
    }
]