[
    {
        "overall_sum": "The story centers on Audrey \"Audie\" Love, a woman who believes her family's curse compels her to assist others in finding love while depriving her of the chance to experience it herself. This belief is challenged through her relationship with Rhett Song, her college best friend. After a decade of friendship, Audie is chosen to be the best man at Rhett's wedding to Carmilla Marion, an actress from a prestigious family. Although Rhett truly cares for Carmilla, the elaborate wedding arrangements, primarily focused on Carmilla's preferences, unsettle him.\nAs the wedding preparations unfold in Periodical, Connecticut, Rhett confides in Audie, expressing doubts about the marriage and his connection with Carmilla. One fateful night at Ye-Haute, a quirky local bar, leads to inebriation and an intimate, unresolved emotional moment between Audie and Rhett, stirring fears about interfering with destiny and rekindling Audie's belief in her curse.\nThe morning after, chaos ensues when Rhett is found missing, prompting Audie and Theo Luck, Carmilla's best friend and maid of honor, to trace Rhett's steps in a quest to find him. Audie is torn, assuming her curse has pushed Rhett toward a different soulmate, risking the wedding. During the search, Audie grapples with her emotions and unresolved issues with Theo, who surprisingly admits to his attraction towards her. Theo's steady presence challenges Audie's previous notions, laying the groundwork for potential catharsis from her supposed curse.\nIn the course of their investigation, Audie and Theo uncover that Rhett and Carmilla have eloped, leaving an explanatory note. This revelation comes as a relief yet a shock, confirming Rhett's genuine love for Carmilla, and highlighting Audie's misconceived curse. Theo humorously laments the stress caused by the missing couple, while Audie, having realized the potential for new love with Theo, decides to focus on the present moment instead of her perceived future of loneliness. As they prepare to inform the gathered wedding guests, Audie and Theo choose to spend the remaining time together, highlighting their burgeoning romance.",
        "overall_char": "**Audie (Audrey Love)**:\n- **Profile**: Protagonist entangled in a belief of a family curse hindering her own love life while aiding others in finding their soulmates. Known for her intelligence, wit, and the complexity of her friendship with Rhett.\n- **Overall Experience**: Audie's journey is marked by overcoming fears of loneliness and confronting her supposed curse, leading to potential romance with Theo while affirming Rhett’s feelings for Carmilla.\n\n**Rhett Song**:\n- **Profile**: Audie’s best friend from college, known for charm and a history of failed relationships. Engaged to Carmilla, displaying genuine care but troubled by wedding stress and uncertainty.\n- **Overall Experience**: Rhett’s narrative arc resolves the tension between true affection and societal expectations, relying on Audie for support and culminating in a decision driven by genuine love.\n\n**Carmilla Marion**:\n- **Profile**: Rhett's fiancé, an actress, and socialite with a warm and captivating personality, representing a challenge to Audie's fears.\n- **Overall Experience**: Serves as both a catalyst for the story’s central conflicts and a resolution to Rhett and Audie’s emotional journey, confirming familial and romantic connections.\n\n**Theo Luck**:\n- **Profile**: Carmilla’s closest friend and maid of honor, charming and insightful. Previously involved in minor flirtations with Audie.\n- **Overall Experience**: Emerges as crucial in transforming Audie's understanding of love and breaking beyond her self-imposed limits set by her family's curse, suggesting a joyful new path forward."
    }
]