[
    {
        "aspects": [
            "Characters",
            "Emotional Impact",
            "Enjoyment and Engagement"
        ],
        "review": [
            "This book offers a genuine and relatable portrayal of living with a chronic illness, making readers feel truly seen.",
            "I cried multiple times while reading this book; it was profoundly moving and stirred deep emotions within me.",
            "While the book is packed with emotional moments, it’s also incredibly funny. The humor is well-balanced, enhancing the overall enjoyment of the story."
        ],
        "conclusion": "This novel is a powerful blend of humor and heartbreak, offering a deeply emotional experience while also providing much-needed representation for those with chronic illnesses. It’s a must-read for anyone looking for a story that resonates on a personal level.",
        "rating": "5",
        "review_likes": "8",
        "reviewer_id": "86311895-spiri-skye",
        "reviewer_followers": "21 followers",
        "reviewer_review_nums": "523 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Emotional Impact:**  \n  I bawled my eyes out several times while reading this book. It was incredibly moving and evoked strong emotions.\n  \n- **Humor:**  \n  Despite the emotional moments, the book was also funny as hell. The humor was well-balanced and added a layer of enjoyment to the story.\n  \n- **Representation:**  \n  If you have a chronic illness, this book makes you feel truly seen. The portrayal of living with a chronic condition was authentic and relatable.\n\n**Conclusion:**  \nThis novel is a powerful blend of humor and heartbreak, offering a deeply emotional experience while also providing much-needed representation for those with chronic illnesses. It’s a must-read for anyone looking for a story that resonates on a personal level.\n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The story follows Brynn's suspension from school, prompting her to reflect on her life and aspirations. This coming-of-age novel delves into themes of self-discovery, identity, and the pursuit of authenticity in the face of challenges.",
            "In this story, Brynn Kwan navigates a dual existence: at school, she serves as the head of the yearbook committee and is a favorite for prom queen, yet she conceals her disabilities from her peers. Her internal monologue is engaging, witty, and relatable, often featuring amusing dialogues with various parts of her body. Despite facing numerous challenges, her struggles are portrayed with authenticity, making her more negative thoughts resonate genuinely.",
            "The narrative captivates with its blend of humor and emotional depth, while the internal monologues introduce a unique and entertaining dimension to the storytelling.",
            "I adored Brynn as a character; her journey is both inspiring and relatable. This engaging YA novel offers a heartfelt and humorous take on serious themes, making it a highly recommendable read."
        ],
        "conclusion": "This YA coming-of-age novel is a heartfelt and humorous exploration of self-discovery, identity, and living authentically. Brynn’s charming and relatable internal communication, combined with the well-handled emotional depth, makes this a highly recommended read.",
        "rating": "4",
        "review_likes": "9",
        "reviewer_id": "19007770-akacya",
        "reviewer_followers": "297 followers",
        "reviewer_review_nums": "1,513 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development (Brynn):**  \n   - Brynn Kwan lives a double life: at school, she’s the head of the yearbook committee and a top pick for prom queen, but she hides her disabilities from everyone.  \n   - Her internal communication is charming, funny, and relatable. She often has humorous internal conversations with different parts of her body.  \n   - While she deals with a lot of challenges, her more negative internal communication is handled well and feels authentic.  \n\n- **Plot and Themes:**  \n   - The story revolves around Brynn’s suspension from school, which leads her to reflect on her life and how she wants to live it to its full potential.  \n   - It’s a coming-of-age novel that explores themes of self-discovery, identity, and living authentically despite challenges.  \n\n- **Writing Style and Tone:**  \n   - The narrative is engaging, with a mix of humor and emotional depth.  \n   - The internal monologues add a unique and entertaining layer to the storytelling.  \n\n- **Overall Impression:**  \n   - I loved Brynn as a character and found her journey both inspiring and relatable.  \n   - This is a great YA novel that I highly recommend for its heartfelt and humorous approach to serious themes.  \n\n**Conclusion:**  \nThis YA coming-of-age novel is a heartfelt and humorous exploration of self-discovery, identity, and living authentically. Brynn’s charming and relatable internal communication, combined with the well-handled emotional depth, makes this a highly recommended read.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters"
        ],
        "review": [
            "The romance between Brynn and Oliver feels underdeveloped and lacks depth. Oliver's character is poorly defined, and their three-year relationship, which ended abruptly, is not adequately explored. The second-chance romance trope is poorly executed, with Brynn's sudden revelation of lingering feelings for Oliver coming across as abrupt and unconvincing. Overall, the romance could have been better balanced with the heavier coming-of-age themes.",
            "Brynn's relationship with her father is both heartwarming and relatable, as he empathizes with her struggles and uses mobility aids like crutches, leg braces, and a wheelchair. The dynamic between Brynn and her able-bodied sister realistically captures the complexities of sibling relationships in families dealing with chronic illness. The family's overall supportiveness stands out, and I find a personal connection in their experiences, as my own family is entirely disabled."
        ],
        "conclusion": "Overall, *CONDITIONS OF A HEART* is a compelling and relatable read for those familiar with chronic illnesses, particularly EDS. While the representation of MCAS and POTS could be more accurate, the book excels in portraying the emotional and physical challenges of living with chronic conditions. The family dynamics and diverse representation are standout elements, though the romance subplot feels underdeveloped. Despite this, the book is highly recommended for its heartfelt storytelling and educational value about EDS.",
        "rating": "4",
        "review_likes": "6",
        "reviewer_id": "27301869-sydney-sydneys-books",
        "reviewer_followers": "140 followers",
        "reviewer_review_nums": "827 reviews",
        "reformatted_ori_review": "**Aspects:**\n\n- **Representation of Chronic Illnesses:**\n   - The book provides a relatable portrayal of living with hypermobile EDS, MCAS, and POTS, particularly for those who identify as \"spoonies\" or \"zebras.\"\n   - Brynn's journey of self-acceptance and the challenges of managing chronic illnesses are well-captured, especially for those diagnosed later in life.\n   - The inclusion of Brynn's father, who is also chronically ill, adds depth to the representation and highlights the importance of familial support.\n   - However, the depiction of MCAS and POTS feels less accurate compared to EDS, with some inconsistencies (e.g., Brynn eating a cracker without consequences, which is unrealistic for someone with MCAS).\n\n- **Family Dynamics:**\n   - Brynn's relationship with her father is heartwarming and relatable, as he understands her struggles and uses mobility aids like crutches, leg braces, and a wheelchair.\n   - The dynamic between Brynn and her able-bodied sister is realistic and mirrors the complexities of sibling relationships in families with chronic illnesses.\n   - The family's overall supportiveness is a highlight, though the reviewer notes their own family is entirely disabled, adding a personal layer of relatability.\n\n- **Romance Subplot:**\n   - The romance between Brynn and Oliver feels underdeveloped and lacks depth.\n   - Oliver's character is not well-defined, and their relationship history (a three-year relationship that ended abruptly) is not explored sufficiently.\n   - The second-chance romance trope is not effectively executed, and the sudden revelation of Brynn's lingering feelings for Oliver feels abrupt and unconvincing.\n   - The reviewer suggests the romance could have been better balanced with the heavier coming-of-age themes.\n\n- **Pandemic Discussions:**\n   - The book includes discussions of the COVID-19 pandemic, which, while relevant, feel repetitive at times.\n   - The reviewer appreciates the inclusion but suggests the focus could have been shifted more toward other aspects of the story.\n\n- **Diverse Representation:**\n   - The book features a Korean American main character with EDS, MCAS, and POTS, as well as diverse side characters, including a pansexual character in a wlw relationship, a Dominican American character, and a Vietnamese character.\n   - The representation is praised for its inclusivity and authenticity.\n\n**Conclusion:**\nOverall, *CONDITIONS OF A HEART* is a compelling and relatable read for those familiar with chronic illnesses, particularly EDS. While the representation of MCAS and POTS could be more accurate, the book excels in portraying the emotional and physical challenges of living with chronic conditions. The family dynamics and diverse representation are standout elements, though the romance subplot feels underdeveloped. Despite this, the book is highly recommended for its heartfelt storytelling and educational value about EDS.\n\n**Rating Scores:**\n- The reviewer docks a star due to the underdeveloped romance, suggesting a rating of 4 out of 5 stars."
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Expectation Fulfillment"
        ],
        "review": [
            "In this compelling story, Brynn Kwan, a scholarship student at a private school, grapples with an unjust suspension following an altercation during a pep rally. Encouraged by her supportive family, including her parents, sister, and cousin, Brynn decides to leave school but ultimately learns that her life, despite its challenges, is still worth fighting for. The second-chance romance with her ex-boyfriend Oliver adds an emotional layer, enriching the narrative and highlighting the power of resilience and love.",
            "The book features an engaging and authentic writing style, particularly in its portrayal of Brynn's struggles and triumphs. The author skillfully balances emotional moments with realistic dialogue and internal monologues, making the story relatable and impactful.",
            "This book features content warnings for ableism and discussions about life during COVID, so readers should approach it with awareness. It comes highly recommended for fans of Talia Hibbert, Melissa See, and Jules Machias, who value strong representation and emotional depth in their stories."
        ],
        "conclusion": "This #ownvoices YA novel is a standout in its portrayal of living with invisible disabilities and chronic pain. Brynn’s journey of self-discovery, resilience, and advocacy is both inspiring and deeply moving. The authentic representation of EDS and POTS, combined with a heartfelt second-chance romance and a fight against systemic injustice, makes this book a must-read.",
        "rating": "5",
        "review_likes": "6",
        "reviewer_id": "6021548-shannon",
        "reviewer_followers": "371 followers",
        "reviewer_review_nums": "6,658 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation of Invisible Disability and Chronic Pain:**  \n  This book provides an incredible portrayal of living with an invisible disability and chronic pain, specifically hypermobile Ehlers-Danlos syndrome (EDS) and Postural Orthostatic Tachycardia Syndrome (POTS). The internal conversations Brynn has with the parts of her body causing her pain are particularly realistic and vivid, offering a deep understanding of what it’s like to live with these conditions.  \n\n- **Character Development and Relationships:**  \n  Brynn Kwan, the protagonist, is a scholarship student at a private school who faces an unfair suspension and exclusion from senior year activities after a pep rally altercation. Her decision to drop out of school is met with support from her parents, sister, and cousin, who help her realize that her life, though different, is still worth fighting for. The second-chance romance with her ex-boyfriend Oliver is a highlight, adding emotional depth to the story.  \n\n- **Themes of Resilience and Advocacy:**  \n  Brynn’s journey includes a David-and-Goliath-style fight against the school board, which sides with a privileged student whose parents use their wealth to excuse his bad behavior. This subplot emphasizes themes of resilience, standing up for oneself, and challenging systemic injustices.  \n\n- **Writing Style and Authenticity:**  \n  The book’s writing style is engaging and authentic, particularly in its depiction of Brynn’s struggles and triumphs. The author’s ability to balance emotional moments with realistic dialogue and internal monologues makes the story both relatable and impactful.  \n\n- **Content Warnings and Audience Appeal:**  \n  The book includes content warnings for ableism and discussions about life during COVID, making it important for readers to approach with awareness. It is highly recommended for fans of authors like Talia Hibbert, Melissa See, and Jules Machias, who appreciate stories with strong representation and emotional depth.  \n\n**Conclusion:**  \nThis #ownvoices YA novel is a standout in its portrayal of living with invisible disabilities and chronic pain. Brynn’s journey of self-discovery, resilience, and advocacy is both inspiring and deeply moving. The authentic representation of EDS and POTS, combined with a heartfelt second-chance romance and a fight against systemic injustice, makes this book a must-read.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Themes",
            "Enjoyment and Engagement"
        ],
        "review": [
            "Brynn's relationship with her dad was a standout aspect of the story. Their shared understanding, humor, and similar personalities created a beautiful and heartwarming bond. Additionally, the dynamics between Brynn, her mom, and sister were effectively portrayed, showcasing the complexities of navigating chronic illness within a family.",
            "This fast-paced story captures a kingdom facing a storm, infused with a found family theme and set against the charming backdrop of a cat café. While it includes subtle romantic elements, the emphasis is on Brynn’s journey of self-identity and personal growth. Brynn's experiences are both relatable and inspiring, resonating even with readers who don't have chronic illnesses.",
            "This book was profoundly moving and brought me to tears, which is a rare experience for me. It's a must-read for anyone with a chronic illness, but I believe readers of all ages, especially high schoolers, will find something relatable in Brynn's story. It has quickly become one of my favorite disability reads and a standout in the YA genre."
        ],
        "conclusion": "This is a beautifully written, heartfelt story that authentically captures the experience of living with chronic illness. It’s both raw and uplifting, with relatable characters and a compelling narrative. I highly recommend it to readers of all ages, particularly those who enjoy YA and stories about self-discovery and resilience.",
        "rating": "4",
        "review_likes": "5",
        "reviewer_id": "93222793-tara",
        "reviewer_followers": "11 followers",
        "reviewer_review_nums": "413 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation of Chronic Illness:**  \n   - The chronic illness representation in this book was incredibly authentic and relatable, especially for someone with the same conditions as the main character, Brynn.  \n   - The portrayal of pain, insurance struggles, medical care issues, and the fear of disclosing disability to classmates felt raw and true, almost like flashbacks to my own life.  \n   - The author, Bethany Mangle, handled these scenes with love and care, making them deeply impactful.  \n\n- **Character Relationships:**  \n   - Brynn’s relationship with her dad was one of my favorites. Their shared understanding, humor, and similar personalities made their bond beautiful and heartwarming.  \n   - The dynamic between Brynn, her mom, and sister was also well-represented, highlighting the challenges of navigating chronic illness within a family.  \n\n- **Story and Themes:**  \n   - The story itself was fast-paced, with a \"storm the kingdom, found family\" vibe, and featured a cat café, which I loved.  \n   - While there were small romantic elements, the focus was more on Brynn’s self-identity and personal growth.  \n   - Even for readers without chronic illnesses, Brynn’s journey is relatable and inspiring.  \n\n- **Overall Impact and Recommendation:**  \n   - This book was emotionally powerful and brought me to tears, which is rare for me.  \n   - It’s a must-read for anyone with a chronic illness, but I believe all ages, especially high schoolers, would find something to connect with in Brynn’s story.  \n   - It’s now one of my favorite disability reads and a standout YA novel overall.  \n\n**Conclusion:**  \nThis is a beautifully written, heartfelt story that authentically captures the experience of living with chronic illness. It’s both raw and uplifting, with relatable characters and a compelling narrative. I highly recommend it to readers of all ages, particularly those who enjoy YA and stories about self-discovery and resilience.  \n\n**Rating Scores:**  \n4.5 stars"
    },
    {
        "aspects": [
            "Themes",
            "Emotional Impact",
            "Originality"
        ],
        "review": [
            "The novel thoughtfully explores important themes, particularly ableism, weaving this discussion seamlessly into the narrative.",
            "This story is a powerful blend of empowerment, emotion, and tenderness, offering a deeply resonant reading experience. It has the ability to make readers feel seen, whether they relate to Brynn’s struggles, navigate chronic illness, or conceal aspects of themselves to fit societal expectations.",
            "The addition of a cat café brings a delightful and unforgettable element to the story."
        ],
        "conclusion": "*Conditions of a Heart* is a profoundly impactful and relatable novel that resonates with readers on multiple levels. Its emotional depth, unique elements, and thoughtful exploration of themes make it a highly recommended read.",
        "rating": "5",
        "review_likes": "5",
        "reviewer_id": "29599654-kate",
        "reviewer_followers": "967 followers",
        "reviewer_review_nums": "1,542 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Relatability and Representation:**  \n  The book has the power to make people feel seen, whether they relate to Brynn’s conditions, experience living with a chronic illness, or feel the need to hide parts of themselves to appear ‘palatable’ to the outside world.  \n\n- **Emotional Impact:**  \n  The story is empowering, moving, infuriating, sweet, and gentle, creating a deeply emotional reading experience.  \n\n- **Unique Elements:**  \n  The inclusion of a cat café adds a charming and memorable touch to the narrative.  \n\n- **Themes and Content Warnings:**  \n  The novel addresses important themes, including ableism, which is thoughtfully discussed throughout the story.  \n\n**Conclusion:**  \n*Conditions of a Heart* is a profoundly impactful and relatable novel that resonates with readers on multiple levels. Its emotional depth, unique elements, and thoughtful exploration of themes make it a highly recommended read.  \n\n**Rating Scores:**  \n4.5/5"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Emotional Impact"
        ],
        "review": [
            "The final copy contained some typos and inconsistencies, such as issues with Brynn's car, her eating habits, and the underdeveloped portrayal of her disabilities, including POTS and MCAS. While these details were noticeable, they did not significantly detract from the overall experience. The ending offered a satisfying happily-ever-after for Brynn while also leaving some aspects open-ended, highlighting the ongoing struggles of individuals with disabilities to be heard and respected. The narrative steered clear of overly idealistic portrayals, maintaining a realistic tone throughout.",
            "The portrayal of familial relationships was a standout aspect, emphasizing the significance of growth, effort, and learning in understanding and supporting loved ones with disabilities. The messy, imperfect dynamics felt both realistic and meaningful.",
            "This book resonated with me on a profound level, articulating emotions I often struggle to express. It fosters empathy by immersing readers in Brynn's frustrations, exhaustion, and struggles, even for those who may not directly relate to her experiences. The depiction of Brynn's emotions, relationships, and disabilities is remarkable. The writing masterfully transforms feelings into words, eliciting both laughter and tears—sometimes at the same time. The emotional depth and authenticity of the story render it truly unforgettable."
        ],
        "conclusion": "This book is a deeply emotional and authentic exploration of disability, relationships, and personal growth. Despite minor editing flaws, it is a powerful and relatable story that resonates on multiple levels. The author's writing and character development are exceptional, making this a must-read.",
        "rating": "5",
        "review_likes": "3",
        "reviewer_id": "6246070-ak",
        "reviewer_followers": "35 followers",
        "reviewer_review_nums": "712 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Emotional Resonance and Empathy:**  \n   - The book resonated deeply with me, putting so many feelings into words.  \n   - It builds empathy by setting up situations that help readers understand Brynn's frustrations, exhaustion, and struggles, even if they can't directly relate to her experiences.  \n   - The portrayal of Brynn's emotions, relationships, and disabilities was phenomenal.  \n\n- **Representation of Disabilities:**  \n   - Brynn's experiences with chronic illness (hEDS, MCAS, and POTS) felt authentic and relatable, especially her struggles with pain, negotiating with her body, and feeling trapped by societal perceptions of disability.  \n   - The inclusion of COVID-19 in the story highlighted how the world often leaves disabled individuals behind.  \n\n- **Character Development and Relationships:**  \n   - The familial relationships were a highlight, showing the importance of growth, effort, and learning in understanding and supporting loved ones with disabilities.  \n   - The messy, imperfect nature of these relationships felt realistic and meaningful.  \n\n- **Ending and Realism:**  \n   - The ending provided a satisfying HEA for Brynn while leaving some aspects open-ended, reflecting the ongoing struggles of people with disabilities to be heard, seen, and respected.  \n   - The story avoided overly idealistic portrayals, maintaining a realistic tone.  \n\n- **Writing and Emotional Impact:**  \n   - The writing was a masterclass in turning feelings into words, evoking both laughter and tears, sometimes simultaneously.  \n   - The emotional depth and authenticity made the story unforgettable.  \n\n- **Editing and Consistency:**  \n   - The final copy had some typos and inconsistencies (e.g., issues with Brynn's car, her eating habits, and the underdeveloped portrayal of her disabilities like POTS and MCAS).  \n   - These issues didn't detract significantly from the overall experience but were noticeable.  \n\n**Conclusion:**  \nThis book is a deeply emotional and authentic exploration of disability, relationships, and personal growth. Despite minor editing flaws, it is a powerful and relatable story that resonates on multiple levels. Bethany Mangle's writing and character development are exceptional, making this a must-read.  \n\n**Rating Scores:**  \n- Plot: 5/5  \n- Characters: 5/5  \n- World Building: 5/5  \n- Writing: 4.5/5  \n- Pacing: 5/5  \n- Overall: 5/5"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Themes",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The romance in the story was sweet, showcasing the characters’ deep and genuine love for one another. This heartfelt connection was a definite highlight for me.",
            "I found the writing less effective overall, particularly due to difficulty in following the main character's motivations and emotions. Her motivations often felt abrupt and poorly paced, which hindered my ability to connect with her.",
            "I appreciated the thoughtful representation of disability and the candid discussions surrounding it. These elements added significant depth to the story.",
            "The book holds significant potential, and there are many elements I truly enjoyed. However, I found the author's writing style challenging, which made it difficult for me to finish this book, especially after struggling with *All the Right Reasons*."
        ],
        "conclusion": "While the book has many strengths, including strong disability representation and a heartfelt romance, the writing style and character development fell short for me. The main character's motivations and emotions felt inconsistent and poorly paced, which detracted from my overall enjoyment.",
        "rating": "3",
        "review_likes": "3",
        "reviewer_id": "27258706-anniek",
        "reviewer_followers": "844 followers",
        "reviewer_review_nums": "2,340 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Potential and Enjoyment:**  \n  The book has a lot of potential, and there are many aspects I enjoyed or even loved. However, I struggled with the author's writing style, especially after not finishing *All the Right Reasons* and finding it difficult to complete this book.\n\n- **Representation and Themes:**  \n  I loved the disability representation and the honest conversations surrounding disability. These aspects were handled thoughtfully and added depth to the story.\n\n- **Romance:**  \n  The romance was very sweet, and it was clear that the characters genuinely loved each other deeply. This was one of the highlights of the book for me.\n\n- **Writing Style and Character Development:**  \n  I liked the writing less overall, particularly because I struggled to follow the main character's motivations and emotions. There was something off about how her motivations or lack of emotions were portrayed—they often felt sudden and poorly paced, which made it hard to connect with her.\n\n**Conclusion:**  \nWhile the book has many strengths, including strong disability representation and a heartfelt romance, the writing style and character development fell short for me. The main character's motivations and emotions felt inconsistent and poorly paced, which detracted from my overall enjoyment.\n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language"
        ],
        "review": [
            "I would have liked to see more of Brynn's friends and Oliver.",
            "This is one of the best-written books I've encountered that addresses chronic illness and disability. The prose is strikingly authentic and, at times, profoundly heartbreaking."
        ],
        "conclusion": "This novel stands out as one of the best portrayals of chronic illness and disability I’ve encountered, with its realistic and emotionally impactful writing. While the story was deeply moving, I felt that certain characters, like Brynn’s friends and Oliver, could have been further developed.",
        "rating": "4",
        "review_likes": "3",
        "reviewer_id": "108211207-lexi-rachelle-reads",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "161 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Writing Quality:**  \n  - \"This was one of the best written books with chronic illness and disability I’ve ever read.\"  \n  - The writing was incredibly real and at times heartbreaking.  \n\n- **Character Development:**  \n  - I wish we could’ve seen more of Brynn’s friends and Oliver.  \n\n**Conclusion:**  \nThis novel stands out as one of the best portrayals of chronic illness and disability I’ve encountered, with its realistic and emotionally impactful writing. While the story was deeply moving, I felt that certain characters, like Brynn’s friends and Oliver, could have been further developed.  \n\n**Rating Scores:**  \n3.5⭐️"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language"
        ],
        "review": [
            "The plot was well-paced and aligned perfectly with the book's tone. However, I would have preferred a more extended ending.",
            "Brynn is a captivating main character, and I felt a strong connection to her throughout her journey. The relationships in this book were my favorite aspect; I enjoyed watching Brynn's bonds with her family and friends evolve. Her connection with her dad, in particular, was heartwarming. Additionally, the romance was simply adorable!",
            "The writing style quickly draws you into the story and its characters. While the book addresses serious themes, it also incorporates humor, particularly through Brynn's delightful sarcasm, which adds a refreshing touch."
        ],
        "conclusion": "This novel is a heartfelt and immersive read, with a strong focus on character development and relationships. Brynn’s journey is both inspiring and relatable, and the balance of serious themes with humour adds depth to the story. While the pacing is generally well-done, the ending could have been more extended. Overall, it’s a touching and enjoyable book.",
        "rating": "4",
        "review_likes": "2",
        "reviewer_id": "43341221-paige-pagebypaigebooks",
        "reviewer_followers": "11 followers",
        "reviewer_review_nums": "401 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development (Brynn):**  \n   - Brynn was an amazing main character to read about.  \n   - I felt very connected to Brynn and was rooting for her throughout her journey.  \n\n- **Writing Style:**  \n   - Bethany's writing style immediately immerses you into the story and its characters.  \n\n- **Relationships:**  \n   - My favourite aspect of this book was the relationships.  \n   - I loved reading about how Brynn's connection to her family and friends grew and developed throughout the story.  \n   - I especially liked reading about Brynn and her dad. They have such a strong connection, which is so heartwarming.  \n\n- **Plot and Pacing:**  \n   - The plot was well-paced and fit the tone of the book perfectly.  \n   - However, I would have liked for the ending to be a bit more drawn out.  \n\n- **Tone and Themes:**  \n   - While this book does focus on serious topics, it's also filled with humour that made me smile, like Brynn's sarcasm!  \n\n- **Romance:**  \n   - The romance was adorable!  \n\n**Conclusion:**  \nThis novel is a heartfelt and immersive read, with a strong focus on character development and relationships. Brynn’s journey is both inspiring and relatable, and the balance of serious themes with humour adds depth to the story. While the pacing is generally well-done, the ending could have been more extended. Overall, it’s a touching and enjoyable book.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language"
        ],
        "review": [
            "The romance was sweet and occasionally cute, but it also had its frustrating moments. While there were highlights, it ultimately failed to fully captivate me. Brynn’s friends felt underdeveloped due to limited interactions, and I would have appreciated more character depth to enhance the story. However, I truly enjoyed the representation of disability and the discussions surrounding chronic illness. Brynn's internal dialogues with her body parts were both informative and humorous, adding depth to her character and the overall narrative.",
            "I enjoyed the book's writing style and pacing, which kept the story engaging and created a smooth flow, enhancing my overall reading experience."
        ],
        "conclusion": "Overall, I found this book to be a worthwhile read. It offered meaningful representation, engaging internal dialogues, and a well-paced narrative. While the romance and supporting characters could have been stronger, the book’s strengths made it a memorable and enjoyable experience.",
        "rating": "4",
        "review_likes": "2",
        "reviewer_id": "137030944-lizzy-x1faf6-lorenhalesgirl",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "93 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation and Themes:**  \n  I truly enjoyed the disability representation and the conversations about living with a chronic illness. The internal dialogues Brynn had with her body parts were both informative and funny, adding depth to her character and the narrative.  \n\n- **Romance:**  \n  The romance was sweet and cute at times, but it also felt frustrating. While it had its moments, it didn’t fully captivate me.  \n\n- **Character Development (Supporting Characters):**  \n  I felt that Brynn’s friends lacked depth, as we didn’t get many interactions with them. I would have loved to see their characters developed more to enrich the story.  \n\n- **Writing Style and Pacing:**  \n  I liked the writing style and pacing of the book. It was engaging and made the story flow smoothly, contributing to an enjoyable reading experience.  \n\n**Conclusion:**  \nOverall, I found this book to be a worthwhile read. It offered meaningful representation, engaging internal dialogues, and a well-paced narrative. While the romance and supporting characters could have been stronger, the book’s strengths made it a memorable and enjoyable experience.  \n\n**Rating Scores:**  \n3.75🌟"
    },
    {
        "aspects": [
            "Characters",
            "Emotional Impact"
        ],
        "review": [
            "In the story, Brynn initially conceals her condition, striving to maintain a perfect facade and avoiding vulnerability due to past wounds. Her journey is marked by a struggle with her health, relationships, and future aspirations, highlighting significant personal growth. A strong bond with her father, who also has EDS, contrasts with her loving but less understanding mother and sister, adding depth to the narrative. While Brynn initially keeps her friends at arm's length, the evolution of these relationships becomes a crucial aspect of her development as she learns to share her struggles more openly.",
            "This heartfelt and relatable book skillfully explores the complexities of growing up with a chronic illness. It balances heavy themes with moments of hope and connection, creating a poignant narrative."
        ],
        "conclusion": "*Conditions of a Heart* is a touching and well-crafted novel that excels in its portrayal of chronic illness, personal growth, and systemic challenges. With richly developed characters, meaningful relationships, and insightful commentary on healthcare and societal injustices, it offers a heartfelt and impactful reading experience.",
        "rating": "4",
        "review_likes": "2",
        "reviewer_id": "8652150-shannon-miz",
        "reviewer_followers": "1,078 followers",
        "reviewer_review_nums": "1,377 reviews",
        "reformatted_ori_review": "**Aspects:**\n\n- **Disability Representation:**\n   - The book provides excellent representation of living with a disability, specifically Ehlers-Danlos syndrome (EDS).\n   - It highlights the challenges of navigating life as a young person with a chronic illness, including the emotional and physical struggles.\n\n- **Character Development (Brynn):**\n   - Brynn initially tries to hide her condition and present a perfect persona, avoiding vulnerability due to past hurt.\n   - Her journey involves grappling with her health, relationships, and future plans, showcasing significant personal growth.\n\n- **Themes of Injustice and Systemic Issues:**\n   - The story addresses injustices at Brynn's school and critiques the healthcare system, particularly its treatment of individuals with chronic illnesses.\n   - It emphasizes the additional challenges faced by female patients within the healthcare system.\n\n- **Family Dynamics:**\n   - Brynn shares a strong bond with her father, who also has EDS, while her mother and sister, though loving, struggle to fully understand her experience.\n   - The portrayal of family relationships adds depth to the narrative.\n\n- **Friendships and Relationships:**\n   - Brynn initially keeps her friends at a distance, but the evolution of these relationships is a key part of her growth.\n   - The story explores how her friendships transform as she becomes more open about her struggles.\n\n- **Emotional Depth and Relatability:**\n   - The book is heartfelt and relatable, capturing the complexities of growing up with a chronic illness.\n   - It balances heavy themes with moments of hope and connection.\n\n**Conclusion:**\n*Conditions of a Heart* is a touching and well-crafted novel that excels in its portrayal of chronic illness, personal growth, and systemic challenges. With richly developed characters, meaningful relationships, and insightful commentary on healthcare and societal injustices, it offers a heartfelt and impactful reading experience.\n\n**Rating Scores:**\n- No specific numerical rating is mentioned in the review, but the overall sentiment is highly positive."
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Themes",
            "Emotional Impact",
            "Enjoyment and Engagement"
        ],
        "review": [
            "Brynn Kwan, the protagonist, is a well-developed and relatable character. Her struggles with chronic illness are portrayed with nuance and authenticity, adding depth to the narrative. The dynamics between Brynn and her best friends further enrich the story.",
            "The writing is evocative and relatable, making the narrative compelling enough to finish in a single day. The author skillfully conveys complex emotions through the protagonist, Brynn Kwan, showcasing remarkable depth.",
            "This book offers a touching portrayal of chronic illness, love, and friendship. It delves into the challenges of navigating high school while concealing personal struggles. The narrative beautifully weaves themes of resilience, vulnerability, and self-acceptance throughout.",
            "This book left me speechless. The narrative felt profoundly authentic, particularly for those grappling with chronic illness. The author skillfully encapsulates the isolation, fear, and negativity often experienced in such situations. It’s rare to find a story that makes you feel truly seen and understood, but this one did.",
            "This book is essential reading for anyone seeking a heartfelt, emotionally rich narrative. It compellingly explores the experience of living with chronic illness, highlighting the strength found in vulnerability. I strongly recommend it to those who appreciate diverse representation and impactful storytelling."
        ],
        "conclusion": "*Conditions of a Heart* by the author is a profoundly moving and authentic novel that beautifully captures the challenges and emotions of living with chronic illness. It’s a story of love, friendship, and resilience that left me speechless and deeply seen. I’m grateful to have read this advanced copy and can’t wait for its release on February 20th.",
        "rating": "5",
        "review_likes": "2",
        "reviewer_id": "140416331-han",
        "reviewer_followers": "58 followers",
        "reviewer_review_nums": "49 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Emotional Impact and Authenticity:**  \n   - The book left me completely speechless after finishing it.  \n   - The story felt incredibly *real*, especially for those dealing with chronic illness.  \n   - Bethany Mangle perfectly captured the isolating, scary, and negative emotions associated with chronic illness.  \n   - This is one of the few books that made me feel truly seen and understood.  \n\n- **Representation and Themes:**  \n   - The book provides heartwarming representation of chronic illness, love, and friendship.  \n   - It explores the challenges of navigating high school while hiding personal struggles.  \n   - The story is filled with themes of resilience, vulnerability, and self-acceptance.  \n\n- **Writing Style and Narrative:**  \n   - The writing is deeply evocative and relatable.  \n   - The narrative is compelling enough to finish the book in one day.  \n   - The author’s ability to convey complex emotions through the protagonist, Brynn Kwan, is remarkable.  \n\n- **Character Development:**  \n   - Brynn Kwan, the female main character, is well-developed and relatable.  \n   - The portrayal of her struggles with chronic illness is nuanced and authentic.  \n   - The dynamics between Brynn and her best friends add depth to the story.  \n\n- **Overall Appeal:**  \n   - This book is a must-read for anyone looking for a heartfelt, emotionally resonant story.  \n   - It’s a powerful exploration of living with chronic illness and finding strength in vulnerability.  \n   - I highly recommend it to readers who value representation and meaningful storytelling.  \n\n**Conclusion:**  \n*Conditions of a Heart* by Bethany Mangle is a profoundly moving and authentic novel that beautifully captures the challenges and emotions of living with chronic illness. It’s a story of love, friendship, and resilience that left me speechless and deeply seen. I’m grateful to have read this advanced copy and can’t wait for its release on February 20th.  \n\n**Rating Scores:**  \n5🌟 (Five stars)"
    },
    {
        "aspects": [
            "Characters",
            "Themes",
            "Emotional Impact"
        ],
        "review": [
            "Brynn's story is a compelling journey of self-discovery. It beautifully portrays her struggles with self-perception, her uncertain future, and her approach to life. The narrative effectively captures her oscillation between good and bad days, her insecurities about her body, and her fear of being unable to escape the challenges that confront her.",
            "This heartfelt and tender book explores disability and illness in a post-COVID world, particularly from a teen's perspective. It examines how societal attitudes and the rush to return to 'normal' have marginalized disabled, chronically ill, and vulnerable individuals. The narrative highlights the profound impact of others' perceptions on self-identity and underscores the lack of knowledge and empathy among doctors regarding conditions like Ehlers-Danlos syndrome, as well as their failure to listen to patients.",
            "This book profoundly explores vulnerability and the fear of being forgotten or misunderstood, encapsulated in the poignant quote: \"afraid for us, afraid of us, and afraid to become us.\" It evokes deep empathy for those whose lives have been irrevocably changed by illness or disability, highlighting that the new 'normal' is often fraught with peril."
        ],
        "conclusion": "*Conditions of a Heart* is a poignant and thought-provoking novel that sheds light on the struggles of disabled and chronically ill individuals in a world eager to move on from the pandemic. Through Brynn's journey, the book offers a heartfelt exploration of self-perception, societal neglect, and the enduring challenges of living with chronic illness.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "10921074-usom",
        "reviewer_followers": "282 followers",
        "reviewer_review_nums": "3,024 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Themes and Subject Matter:**  \n  - The book is heartfelt and tender, examining disability and illness in a 'post' COVID world, particularly for teens.  \n  - It explores how societal attitudes and the rush to return to 'normal' have left disabled, chronically ill, or vulnerable individuals behind.  \n  - The story delves into the impact of others' perceptions and treatments on how we see ourselves.  \n  - It highlights the lack of knowledge and empathy among doctors regarding conditions like Ehlers-Danlos syndrome and their failure to listen to patients.  \n\n- **Character Development:**  \n  - Brynn's story is a journey of self-discovery, as she grapples with her perception of herself, her future, and her approach to life.  \n  - The narrative captures her struggles with good and bad days, her uncertainty about her body, and her fear of being unable to outrun the challenges she faces.  \n\n- **Emotional Impact:**  \n  - The book resonates deeply with its exploration of vulnerability and the fear of being forgotten or misunderstood, as encapsulated in the quote: \"afraid for us, afraid of us, and afraid to become us.\"  \n  - It evokes empathy for those whose lives have been permanently altered by illness or disability, emphasizing that the new 'normal' remains fraught with danger.  \n\n**Conclusion:**  \n*Conditions of a Heart* is a poignant and thought-provoking novel that sheds light on the struggles of disabled and chronically ill individuals in a world eager to move on from the pandemic. Through Brynn's journey, the book offers a heartfelt exploration of self-perception, societal neglect, and the enduring challenges of living with chronic illness.  \n\n**Rating Scores:**  \n(No specific rating scores were mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "World-Building and Setting",
            "Expectation Fulfillment"
        ],
        "review": [
            "I appreciated the romance in the story, especially Brynn's reconnection with her ex, whom she still loves deeply. The challenge of her struggle to be open about herself added depth, and I enjoyed witnessing her growth in this area. As someone with a chronic illness, I resonated with Brynn's feelings of grief and hopelessness, but I also admired her character development as she began to envision a new future for herself.",
            "The writing style was engaging, and I appreciated the humor woven into the narrative, even as it tackled difficult topics and emotions.",
            "The book respects its teenage audience, avoiding the condescension often found in YA literature. Even when the characters' ages shape their actions—such as Brynn's conflicts with her sister—their experiences feel genuine and relatable.",
            "Contemporary teen romance isn't typically my go-to genre, but I found this book surprisingly enjoyable."
        ],
        "conclusion": "This book exceeded my expectations, offering an engaging and authentic portrayal of teenage struggles, a heartfelt romance, and meaningful character growth. Despite not being my usual genre, it left a lasting impression.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "3737366-rai",
        "reviewer_followers": "6 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**  \n- **Genre and Personal Preference:**  \n  \"Contemporary Teen Romance\" is not a genre I normally read, but I genuinely enjoyed this book.  \n\n- **Writing Style and Tone:**  \n  I found the writing style engaging and appreciated the humor, even though the story deals with difficult topics and emotions.  \n\n- **Authenticity and Representation of Teenagers:**  \n  I didn’t feel like the book talked down to teenagers or made light of their problems, which can sometimes happen in YA literature. Even when the characters' ages influenced their actions (like Brynn's fights with her sister), it felt authentic.  \n\n- **Romance and Character Dynamics:**  \n  I liked the romance element, particularly that it involved Brynn reconnecting with her ex, whom she’s still deeply in love with. The obstacle between them—her struggle to be open about herself—added depth, and I enjoyed seeing her growth in this area.  \n\n- **Character Development and Relatability:**  \n  As someone with a chronic illness, I could relate to Brynn’s sense of grief and hopelessness. However, I also appreciated her character growth as she began to reconsider what her future might look like.  \n\n- **Overall Enjoyment:**  \n  I’m really glad I picked this book up because I enjoyed it from beginning to end!  \n\n**Conclusion:**  \nThis book exceeded my expectations, offering an engaging and authentic portrayal of teenage struggles, a heartfelt romance, and meaningful character growth. Despite not being my usual genre, it left a lasting impression.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Writing and Language",
            "Enjoyment and Engagement"
        ],
        "review": [
            "I was disappointed with the ending. **SPOILERS!** The story builds up to a preliminary hearing aimed at overturning the kids' punishments, but then it abruptly concludes without revealing whether Brynn remains suspended from activities after reuniting with Oliver. This lack of resolution feels frustrating, especially since it was a central theme of the book.",
            "I initially believed this was a debut novel due to its somewhat clunky writing style. Some metaphors felt unclear, and the author often crafted overly long sentences.",
            "This is undoubtedly the funniest book I've ever read!"
        ],
        "conclusion": "While the book is incredibly funny and entertaining, the writing style feels unpolished, and the ending leaves much to be desired, especially since it doesn’t resolve the central conflict.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "130058014-juniper-lee",
        "reviewer_followers": "8 followers",
        "reviewer_review_nums": "367 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Humor:**  \n  - This is probably the funniest book I have ever read!!  \n\n- **Writing Style:**  \n  - I did think that this was a debut novel because the writing style is a little clunky.  \n  - Some metaphors didn’t really make sense.  \n  - The author has a tendency to write sentences that were way too long.  \n\n- **Ending:**  \n  - I wasn’t a fan of the ending.  \n  - SPOILERS!!! We go to a preliminary hearing about overturning the kids’ punishments and then… well, that’s it.  \n  - We don’t hear about if Brynn remains suspended from fun things because she gets back together with Oliver, and well, THE END EVERYONE.  \n  - I’m kind of annoyed because that was the Whole Point of the book too.  \n\n**Conclusion:**  \nWhile the book is incredibly funny and entertaining, the writing style feels unpolished, and the ending leaves much to be desired, especially since it doesn’t resolve the central conflict.  \n\n**Rating Scores:**  \n- Not explicitly mentioned in the review."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Emotional Impact"
        ],
        "review": [
            "The final 20% of the book felt cringeworthy, particularly the dialogue. Additionally, several loose ends were left unresolved, which ultimately left me feeling unsatisfied.",
            "I found myself conflicted about Brynn's actions, particularly when she lashed out at her family. While some of her behavior felt justified, other moments came across as overly self-pitying. However, Oliver and Brynn's dad provided delightful charm, adding a great dynamic to the story.",
            "Though I may not share Brynn's daily health struggles, her meltdowns and quest for direction in life resonated with me deeply."
        ],
        "conclusion": "Overall, this book was a mixed experience for me. While I appreciated the representation of a disabled MC and found some aspects relatable, the pacing issues, unresolved plot points, and Brynn’s inconsistent behavior made the latter part of the story less enjoyable.",
        "rating": "3",
        "review_likes": "1",
        "reviewer_id": "65466442-rachel",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "21 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation of Disability:**  \n  I was glad to read a book with a disabled main character (MC) since we don’t see that represented a lot. As someone writing a short story with a disabled MC, this book helped me prepare for my project. It also made me reflect on how easy it is to take my own health for granted.  \n\n- **Relatability and Emotional Impact:**  \n  While I can’t relate to Brynn’s daily health struggles, seeing her have meltdowns and grapple with what she wants from life definitely hit close to home.  \n\n- **Pacing and Resolution:**  \n  The last 20% of the book became cringey, especially the dialogue. There were also a lot of loose ends that didn’t get addressed, which left me feeling unsatisfied.  \n\n- **Character Development and Behavior:**  \n  I felt conflicted about Brynn’s actions, like lashing out at her family. I understand that this might have been intentional, but while some of her behavior was warranted, other times it felt like she was being overly “woe is me.”  \n\n- **Supporting Characters:**  \n  Bonus points for Oliver and Brynn’s dad—they were so cute and added a lot of charm to the story.  \n\n**Conclusion:**  \nOverall, this book was a mixed experience for me. While I appreciated the representation of a disabled MC and found some aspects relatable, the pacing issues, unresolved plot points, and Brynn’s inconsistent behavior made the latter part of the story less enjoyable.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Emotional Impact",
            "Enjoyment and Engagement"
        ],
        "review": [
            "Brynn's struggles and emotions are vividly portrayed, particularly in her raw and authentic moments of contemplating dropping out.",
            "The author expertly conveys intense emotions through vivid imagery, especially in the scene where Brynn stares into the void, the hum of the refrigerator seamlessly blending into the background and amplifying her frustration and despair.",
            "This book powerfully captures the grief of missing out due to chronic illness. As someone who has also struggled to experience a typical teenage life, I deeply resonate with Brynn, the protagonist, who longs for a sense of normalcy.",
            "This book is filled with clever insults that had me laughing out loud. I’m definitely planning to use some of them in real life, like “self-righteous, unmutated bitch.”"
        ],
        "conclusion": "This novel masterfully balances emotional depth with humor, making it both relatable and entertaining. It resonated deeply with me, especially in its portrayal of living with a chronic illness and the longing for a normal life. The creative insults and authentic dialogue added a layer of humor that I thoroughly enjoyed.",
        "rating": "4",
        "review_likes": "2",
        "reviewer_id": "145663584-playlist-by-luna",
        "reviewer_followers": "2 followers",
        "reviewer_review_nums": "118 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Emotional Resonance and Relatability:**  \n   - The book perfectly portrays the grief of missing out due to a chronic illness.  \n   - As someone who hasn’t been able to experience \"normal\" teenage life, I relate deeply to Brynn, the protagonist, who just wants to feel normal.  \n\n- **Character Development:**  \n   - Brynn’s struggles and emotions are vividly depicted, especially in moments like when she contemplates dropping out, which felt raw and authentic.  \n\n- **Humor and Dialogue:**  \n   - The book includes many creative insults that made me laugh out loud, and I’m definitely planning to use some of them in real life (e.g., “self-righteous, unmutated bitch”).  \n\n- **Writing Style and Atmosphere:**  \n   - The author captures intense emotions through vivid descriptions, such as the scene where Brynn stares into nothingness, with the hum of the refrigerator blending into the background, creating a palpable sense of frustration and despair.  \n\n**Conclusion:**  \nThis novel masterfully balances emotional depth with humor, making it both relatable and entertaining. It resonated deeply with me, especially in its portrayal of living with a chronic illness and the longing for a \"normal\" life. The creative insults and authentic dialogue added a layer of humor that I thoroughly enjoyed.  \n\n**Rating Scores:**  \n4 ⭐"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Themes",
            "Emotional Impact"
        ],
        "review": [
            "The romance between Brynn and Oliver feels natural and well-integrated into the narrative, adding emotional depth without overshadowing the book's primary themes.",
            "Brynn Kwan is a relatable and enigmatic protagonist whose journey from concealing her disabilities to embracing her inner strength is both compelling and authentic. The supporting characters, including her father, who shares her condition, her mother, and her sister, are well-developed and enrich the narrative. Each character faces their own struggles, heartbreaks, and triumphs. Even Oliver, Brynn’s long-term boyfriend, leaves a lasting impression despite his limited presence in the story.",
            "The novel is beautifully crafted, with the author’s personal experience with disability lending authenticity and depth to the narrative. The humor is skillfully timed, providing balance to the heavier themes and infusing levity into the story.",
            "The novel delves into themes of chronic illness, self-acceptance, and familial love. It highlights the significance of understanding and patience, reminding us that we often remain unaware of the struggles others face.",
            "The story elicits a spectrum of emotions, from empathy for Brynn's unjust challenges to admiration for her resilience. Her journey, marked by painful lows and culminating in self-acceptance, is both heart-wrenching and uplifting."
        ],
        "conclusion": "*Conditions of a Heart* by the author is a beautifully crafted novel that combines authentic characters, heartfelt themes, and a compelling emotional journey. Brynn’s story of living with a chronic illness, learning self-acceptance, and navigating family dynamics is both moving and inspiring. The well-timed humor and organic romance add layers to the narrative, making it a highly recommended read. I look forward to more from this talented author!",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "6177612-dedra-a-book-wanderer",
        "reviewer_followers": "74 followers",
        "reviewer_review_nums": "1,100 reviews",
        "reformatted_ori_review": "**Aspects:**\n\n- **Themes and Message:**\n   - The novel explores themes of living with a chronic illness, self-acceptance, and family love.\n   - It emphasizes the importance of understanding and patience toward others, as we often don’t know what they’re going through.\n\n- **Character Development:**\n   - Brynn Kwan is a deeply relatable and enigmatic protagonist. Her journey from hiding her disabilities to embracing her inner strength is compelling and authentic.\n   - The side characters, including Brynn’s father (who shares her condition), her mother, and her sister, are well-developed and add depth to the story. Each character has their own struggles, heartbreaks, and triumphs.\n   - Oliver, Brynn’s long-term boyfriend, leaves a strong impression despite limited page time.\n\n- **Emotional Impact:**\n   - The story evokes a wide range of emotions, from empathy for Brynn’s unfair struggles to admiration for her resilience.\n   - The emotional journey from Brynn’s lowest points to her eventual self-acceptance is both heart-wrenching and uplifting.\n\n- **Writing Style:**\n   - The novel is beautifully written, with the author’s personal experience with disability adding authenticity and depth to the narrative.\n   - The humor is well-timed, balancing the heavier themes and adding levity to the story.\n\n- **Romance Subplot:**\n   - The romance between Brynn and Oliver feels organic and seamlessly integrated into the story.\n   - It adds emotional depth without overshadowing the main themes of the book.\n\n- **Overall Enjoyment:**\n   - The book is highly engaging, with authentic characters, humor, and a strong emotional pull.\n   - It’s a rewarding read that leaves a lasting impression.\n\n**Conclusion:**\n*Conditions of a Heart* by Bethany Mangle is a beautifully crafted novel that combines authentic characters, heartfelt themes, and a compelling emotional journey. Brynn’s story of living with a chronic illness, learning self-acceptance, and navigating family dynamics is both moving and inspiring. The well-timed humor and organic romance add layers to the narrative, making it a highly recommended read. I look forward to more from Bethany Mangle!\n\n**Rating Scores:**\n4.5 glowing stars!"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Themes",
            "Expectation Fulfillment"
        ],
        "review": [
            "Brynn, the protagonist, deals with hEDS and PoTs, making her struggle to appear normal while navigating daily challenges both relatable and poignantly depicted. Her journey toward self-acceptance and the courage to share her vulnerabilities form a central theme of the story. The humorous internal monologues she has with her body parts, particularly the Shakespearean-style reflections, enrich her character with both humor and depth. \n\nHer relationship with her father is heartwarming; he provides understanding and support, infused with a loving, joking bond. In contrast, her interactions with her mother and sister are more strained; although they wish to help, they lack a full understanding of her condition. The exploration of her dynamic with her ex, Oliver, further illustrates how her health issues influenced her choice to distance herself from him. Overall, the narrative offers a nuanced portrayal of Brynn’s experiences and relationships.",
            "The narrative blends emotion with humor, making it both engaging and relatable, particularly for those who rely on laughter as a coping mechanism. The internal dialogues and witty exchanges enhance the storytelling, adding a delightful and distinctive layer to the experience.",
            "This book beautifully explores themes of self-discovery and acceptance, emphasizing the importance of embracing one’s vulnerabilities. It sheds light on the challenges of living with invisible chronic conditions and the societal pressures to conform to a notion of normalcy.",
            "This book is essential for anyone with chronic conditions, especially invisible ones, as it offers validation and understanding. It also serves as a valuable resource for those who know someone facing similar challenges, providing insight into their experiences."
        ],
        "conclusion": "This novel is a heartfelt and humorous exploration of living with invisible chronic conditions, centered on Brynn’s journey of self-acceptance. The well-developed relationships, emotional depth, and relatable humor make it a compelling read for both those with chronic conditions and their loved ones.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "19770496-leona-ateachersguidetoreading",
        "reviewer_followers": "6 followers",
        "reviewer_review_nums": "257 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development and Representation:**  \n   - Brynn, the protagonist, has hEDS and PoTs, and her struggle to appear \"normal\" while dealing with daily challenges is relatable and well-portrayed.  \n   - Her journey of self-acceptance and learning to share her vulnerabilities is a central theme.  \n   - The internal monologues with her body parts, especially the Shakespearean-style one, add humor and depth to her character.  \n\n- **Relationships:**  \n   - Brynn’s relationship with her father is heartwarming and supportive; he understands her struggles and shares a joking, loving bond with her.  \n   - Her relationship with her mother and sister is more strained, as they want to help but don’t fully understand her condition.  \n   - The dynamic with her ex, Oliver, is explored, showing how her condition influenced her decision to distance herself from him.  \n\n- **Themes and Messages:**  \n   - The book emphasizes self-discovery, acceptance, and the importance of being comfortable with one’s vulnerabilities.  \n   - It highlights the challenges of living with invisible chronic conditions and the societal pressures to appear \"normal.\"  \n\n- **Writing Style and Tone:**  \n   - The narrative is emotional yet sprinkled with humor, making it engaging and relatable, especially for those who use humor as a coping mechanism.  \n   - The internal dialogues and witty exchanges add a unique and enjoyable layer to the storytelling.  \n\n- **Audience and Impact:**  \n   - The book is a must-read for individuals with chronic conditions, particularly invisible ones, as it provides validation and understanding.  \n   - It’s also valuable for those who know someone with similar conditions, offering insight into their challenges.  \n\n**Conclusion:**  \nThis novel is a heartfelt and humorous exploration of living with invisible chronic conditions, centered on Brynn’s journey of self-acceptance. The well-developed relationships, emotional depth, and relatable humor make it a compelling read for both those with chronic conditions and their loved ones.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Enjoyment and Engagement"
        ],
        "review": [
            "Brynn's relationships are intricately developed and realistic, especially her heartwarming bond with her father, which infuses humor and personality into the story. The dynamics with her mother and sister, who do not share her condition, are also portrayed authentically, showcasing their challenges in understanding and supporting her. Additionally, Brynn's interactions with her ex-boyfriend Oliver and her friends enrich her high school experience, adding further depth to the narrative.",
            "The book's humor effectively lightens the serious subject matter, making the story both engaging and relatable. Brynn's sarcastic inner monologue, along with quirky elements like her father's passion for Pokémon and metal rock, adds charm and depth to the narrative."
        ],
        "conclusion": "Conditions of a Heart is a beautifully written and emotionally charged young adult novel that tackles important themes of chronic illness, identity, and self-acceptance with grace and authenticity. The well-developed relationships, authentic representation, and balance of humor and seriousness make it a highly recommended read.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "173845673-nicole-austin",
        "reviewer_followers": "5 followers",
        "reviewer_review_nums": "296 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation of Chronic Illness:**  \n   - The portrayal of chronic illness, specifically Ehlers-Danlos syndrome, is authentic and relatable.  \n   - The book provides a compassionate and careful depiction of the challenges of living with chronic pain, including medical care issues and the fear of disclosure.  \n   - Brynn’s perspective, as well as her father’s, adds depth to the representation, offering a raw and true understanding of her journey.  \n\n- **Character Development and Relationships:**  \n   - Brynn’s relationships are well-developed and realistic, particularly her bond with her father, which is heartwarming and adds humor and personality to the story.  \n   - The portrayal of Brynn’s relationships with her mother and sister, who don’t share her condition, is also realistic, highlighting their struggles to understand and support her.  \n   - The inclusion of Brynn’s ex-boyfriend, Oliver, and her interactions with friends add layers to her high school experience.  \n\n- **Themes of Identity and Vulnerability:**  \n   - The novel explores themes of identity, vulnerability, and self-acceptance, focusing on Brynn’s journey to be true to herself and allow others into her life.  \n   - Brynn’s inner monologue balances seriousness and humor, with her sarcasm adding levity to the narrative.  \n\n- **Humor and Tone:**  \n   - The humor throughout the book injects light into the serious subject matter, making the story engaging and relatable.  \n   - Brynn’s sarcastic inner monologue and the inclusion of quirky elements, like her father’s love for Pokémon and metal rock, add charm and personality.  \n\n- **Inclusion of Unique Settings and Details:**  \n   - The cat cafe scenes, with descriptions of the cats and their antics, are a delightful addition that adds warmth and humor to the story.  \n\n- **Educational and Social Value:**  \n   - The novel offers valuable representation for those with chronic illnesses and encourages readers to reflect on issues of ableism.  \n   - It would be a great addition to high school English classrooms for its themes and representation.  \n\n**Conclusion:**  \n\"Conditions of a Heart\" is a beautifully written and emotionally charged young adult novel that tackles important themes of chronic illness, identity, and self-acceptance with grace and authenticity. The well-developed relationships, authentic representation, and balance of humor and seriousness make it a highly recommended read.  \n\n**Rating Scores:**  \n(No specific rating scores were mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Themes"
        ],
        "review": [
            "The romance between Brynn and Oliver felt a bit off for me. Oliver's overly theatrical personality made me chuckle, though I'm not sure younger readers would find it amusing or cringe-worthy. Since Brynn and Oliver start the story on bad terms and there's little insight into their past relationship, their arc lacked the depth of Brynn's overall journey.",
            "The father-daughter relationship between Brynn and her dad was truly exceptional. Their playful banter and his kindness highlighted a stark contrast to Brynn's struggles with her mother. The family dynamics were compelling, though I wished for a deeper exploration of Brynn's healing process with her able-bodied family members. While they often misunderstood her needs and acted as mild antagonists, they had redeeming moments toward the end. I craved more explicit conversations and insights into their lives and challenges. Ultimately, Brynn's personal growth, especially in opening up to her best friends, felt more fulfilling than her romantic storyline.",
            "The writing is both vulnerable and honest, infused with humor that captures the essence of living with chronic illness. This refreshing blend makes the narrative not only relatable but also essential.",
            "The concise yet powerful exploration of the post-pandemic world in this book was thought-provoking. It reveals how society has moved on without considering who was included or promised safety, and it emphasizes the enduring impact of careless remarks. Additionally, the book addresses crucial themes such as ableism, classism, homophobia, bullying, grief, and racism, notably through Brynn's reflections on racist comments related to COVID-19 as a Korean American."
        ],
        "conclusion": "*Conditions of a Heart* is a beautiful and impactful read that offers a deeply relatable portrayal of chronic illness and disability. While the romantic subplot felt a bit underdeveloped, Brynn’s personal growth journey and her relationships with her family and friends were compelling and heartwarming. The book also provides thoughtful social commentary on post-pandemic life and societal inequities. Overall, it’s a must-read for anyone seeking authentic representation and emotional depth.",
        "rating": "4",
        "review_likes": "3",
        "reviewer_id": "147956803-steph-starrysteph",
        "reviewer_followers": "518 followers",
        "reviewer_review_nums": "368 reviews",
        "reformatted_ori_review": "**Aspects:**\n\n- **Representation of Chronic Illness and Disability:**\n   - The portrayal of Brynn’s chronic illnesses (EDS, POTS, MCAS) felt authentic and deeply relatable. The vulnerability, honesty, and humor in the disabled teenage perspective were perfect.\n   - The depiction of medical gaslighting and dismissive doctors was groan-inducing and resonated strongly with my own experiences.\n   - Brynn’s paperwork and her struggles with specialists reminded me of the FAQ binder I created as a teen to navigate medical appointments.\n\n- **Character Development and Relationships:**\n   - Brynn’s father-daughter relationship was spectacular. Their banter and quips were delightful, and his kindness and understanding stood out, especially in contrast to her mother’s struggles to relate.\n   - The family dynamics were intriguing, though I wished for more focus on healing Brynn’s relationships with her able-bodied family members. While they served as mild antagonists who often misunderstood her needs, they had shining moments toward the end. I wanted more explicit conversations and insight into their lives and struggles.\n   - Brynn’s personal growth journey, particularly in letting her best friends into her life, was more satisfying than her romantic arc.\n\n- **Romantic Subplot:**\n   - The romance with Oliver felt a bit silly to me. His overly theatrical personality made me giggle, but I’m unsure if younger readers would find it fun or cringe-worthy.\n   - Since Brynn and Oliver were on the outs at the start, and there wasn’t much insight into their previous relationship, their arc didn’t feel as fulfilling as Brynn’s overall journey.\n\n- **Themes and Social Commentary:**\n   - The brief yet impactful discussion about the post-pandemic world (where COVID-19 was eradicated) was thought-provoking. It highlighted how society moved on without considering who was included or promised safety, and how thoughtless comments can have lasting, hurtful effects.\n   - The book also touched on important themes like ableism, classism, homophobia, bullying, grief, and racism (with a brief mention of Brynn’s reflections on racist COVID-19 remarks as a Korean American).\n\n- **Writing Style and Tone:**\n   - The writing was vulnerable, honest, and funny, capturing the essence of living with chronic illness. The humor was particularly refreshing and necessary.\n\n**Conclusion:**\n*Conditions of a Heart* is a beautiful and impactful read that offers a deeply relatable portrayal of chronic illness and disability. While the romantic subplot felt a bit underdeveloped, Brynn’s personal growth journey and her relationships with her family and friends were compelling and heartwarming. The book also provides thoughtful social commentary on post-pandemic life and societal inequities. Overall, it’s a must-read for anyone seeking authentic representation and emotional depth.\n\n**Rating Scores:**\n(No specific rating scores were mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language"
        ],
        "review": [
            "The story centers on Brynn as she navigates an unjust suspension and grapples with chronic illnesses during her senior year. It touches on themes of self-perception, the mourning of a future lost, and personal growth. The backdrop of a post-COVID-19 world adds a unique and relatable dimension to Brynn's journey.",
            "This book features Brynn, a disabled Korean American protagonist with hypermobile Ehlers-Danlos syndrome, mast cell activation syndrome, and POTS. It offers diverse representation, including a pansexual character in a sapphic relationship, a Dominican American character, and a Vietnamese character. As a disabled reader, I found Brynn’s experiences relatable and appreciated the emphasis on disabled voices and stories. The well-executed second-chance romance was enjoyable and has sparked my interest in exploring more books with this trope. Although the romance was less prominent than I anticipated, I valued the focus on Brynn’s personal journey. I also appreciated the inclusion of a sapphic side relationship among Brynn’s friends. Brynn is a deeply developed character, and I felt a genuine connection to her throughout the story. Her growth and resilience in overcoming challenges were both inspiring and well portrayed.",
            "The story unfolds over a brief period, providing an in-depth exploration of Brynn's life and experiences. The pacing is natural, and the writing creates a vivid, immersive atmosphere."
        ],
        "conclusion": "Overall, *Conditions of a Heart* is a heartfelt and relatable contemporary novel that beautifully centers a disabled protagonist and explores themes of self-discovery, resilience, and growth. The diverse representation, well-executed second-chance romance, and unique post-COVID-19 setting make it a standout read. I thoroughly enjoyed it and look forward to reading more from the author in the future.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "53116872-marybeth-marybee-books",
        "reviewer_followers": "12 followers",
        "reviewer_review_nums": "143 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation and Inclusivity:**  \n   - The book features a disabled Korean American protagonist, Brynn, who has hypermobile Ehlers-Danlos syndrome, mast cell activation syndrome, and POTS.  \n   - It includes diverse representation, such as a pansexual side character in a sapphic relationship, a Dominican American side character, and a Vietnamese side character.  \n   - As a disabled reader, I found Brynn’s experiences relatable and appreciated the uplifting of disabled voices and stories.  \n\n- **Plot and Themes:**  \n   - The story follows Brynn during part of her senior year as she navigates an unfair suspension and her chronic illnesses.  \n   - It explores themes of self-perception, mourning a future she can’t have, and personal growth.  \n   - The inclusion of a post-COVID-19 world added a unique and relatable layer to the story.  \n\n- **Romance and Relationships:**  \n   - The book features a well-executed second-chance romance, which I enjoyed and now makes me want to explore more books with this trope.  \n   - While there wasn’t as much romance as I expected, I appreciated the focus on Brynn’s personal journey.  \n   - I also liked the inclusion of a sapphic side relationship involving Brynn’s friends.  \n\n- **Character Development:**  \n   - Brynn’s character is deeply developed, and I felt like I truly got to know her throughout the story.  \n   - Her growth and resilience in overcoming challenges were inspiring and well-portrayed.  \n\n- **Writing and Pacing:**  \n   - The story takes place over a short period, allowing for a deep dive into Brynn’s life and experiences.  \n   - The pacing felt natural, and the writing made the story feel real and immersive.  \n\n**Conclusion:**  \nOverall, *Conditions of a Heart* is a heartfelt and relatable contemporary novel that beautifully centers a disabled protagonist and explores themes of self-discovery, resilience, and growth. The diverse representation, well-executed second-chance romance, and unique post-COVID-19 setting make it a standout read. I thoroughly enjoyed it and look forward to reading more from Bethany Mangle in the future.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Themes"
        ],
        "review": [
            "The incident in which Brynn was suspended for attempting to break up a fight, despite her disability resulting in an ER visit, was infuriating and underscored systemic issues, particularly within a private school environment. The mounting pressure on Brynn—stemming from her breakup, difficulties with friends, and internal struggles—culminated in an emotional outburst that felt both raw and justified.",
            "Brynn's character is profoundly compelling. Her authentic struggles with her disability and the efforts to conceal it from her friends and boyfriend resonate deeply. By crafting a new persona to evade being perceived as sick, she adds complexity to her journey. The tension between Brynn and her father, who shares the same illness, is skillfully developed, with his perspective prompting Brynn to reconsider her commitment to fighting for her needs.",
            "The author’s writing is as engaging and emotionally charged as anticipated from her previous works. The narrative adeptly balances Brynn’s personal struggles with broader societal issues, creating a story that is both intimate and thought-provoking.",
            "This story poignantly captures the experience of living with a chronic illness, particularly in the context of the pandemic. It resonates deeply with teens facing similar challenges while also educating those who may not understand. The narrative thoughtfully delves into themes of resilience, self-advocacy, and the emotional burden of concealing one’s struggles."
        ],
        "conclusion": "This novel was a powerful and emotional read, with a well-developed protagonist and a plot that tackled important themes. Brynn’s journey resonated deeply, and the story’s relevance to teens dealing with chronic illness or seeking empathy for others makes it a strong contender for a reading award. Bethany Mangle has delivered another impactful book.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "1065635-lisa-mandina",
        "reviewer_followers": "491 followers",
        "reviewer_review_nums": "2,165 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n  - Brynn’s character was deeply compelling. Her struggles with her disability and the way she hid it from her friends and boyfriend felt authentic and relatable.  \n  - Her decision to create a new persona to avoid being seen as \"sick\" added layers to her character, making her journey more impactful.  \n  - The tension between Brynn and her father, who shared the same disease, was well-developed. His perspective helped Brynn realize she might be giving up on fighting for what she needed.  \n\n- **Plot and Conflict:**  \n  - The incident where Brynn was suspended for trying to break up a fight, despite her disability leading to an ER visit, was infuriating and highlighted systemic issues, especially in a private school setting.  \n  - The buildup of pressure on Brynn—her breakup, her struggles with friends, and her internal conflict—culminated in an emotional explosion that felt both raw and justified.  \n\n- **Themes and Relevance:**  \n  - The portrayal of living with a chronic disease, especially during the pandemic, was poignant and timely. It offered a perspective that could resonate with teens who share similar experiences or educate those who don’t.  \n  - The story effectively explored themes of resilience, self-advocacy, and the emotional toll of hiding one’s struggles.  \n\n- **Writing Style and Author’s Skill:**  \n  - Bethany Mangle’s writing was engaging and emotionally charged, as expected from her previous works.  \n  - The narrative successfully balanced Brynn’s personal struggles with broader societal issues, making the story both intimate and thought-provoking.  \n\n**Conclusion:**  \nThis novel was a powerful and emotional read, with a well-developed protagonist and a plot that tackled important themes. Brynn’s journey resonated deeply, and the story’s relevance to teens dealing with chronic illness or seeking empathy for others makes it a strong contender for a reading award. Bethany Mangle has delivered another impactful book.  \n\n**Rating Scores:**  \n- No specific numerical rating was mentioned in the review. However, the reviewer expressed strong admiration for the book and its themes, indicating a high level of satisfaction."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Themes"
        ],
        "review": [
            "The incident at school resulting in Brynn's suspension serves as a pivotal moment, prompting her to reflect on her life and disability. Her project with Oliver adds depth to the narrative, encouraging Brynn to confront her fears and reevaluate her past choices. The pacing effectively facilitates a thorough exploration of both her internal and external struggles.",
            "Brynn Kwan is a fully developed character who feels genuine and relatable. Her struggle with vulnerability, as she strives to embrace her disability while not allowing it to define her, makes her story compelling. Brynn's resilience in the face of physical and emotional challenges is inspiring, and her supportive family adds depth to her journey. Oliver, her ex-boyfriend, is likable, and their rekindled connection brings added emotional weight to the narrative.",
            "The writing authentically captures the complexities of living with a disability. Brynn's chronic pain and her attempts to conceal her condition from others are portrayed with both sensitivity and realism.",
            "This book delves into themes of self-acceptance, disability, and the delicate balance between vulnerability and strength. Brynn's heartfelt journey to embrace her Ehlers Danlos Syndrome and navigate her future is both touching and emotionally resonant. The story's authenticity makes it relatable and impactful."
        ],
        "conclusion": "This book is a beautifully written, heartwarming story about self-acceptance, resilience, and the challenges of living with a disability. Brynn’s journey is both emotionally resonant and inspiring, and the supporting characters add depth and warmth to the narrative. It’s a realistic and authentic novel that I believe everyone should read.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "24263945-ashley-dang",
        "reviewer_followers": "1,489 reviews",
        "reviewer_review_nums": "1,489 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n   - Brynn Kwan is a well-fleshed-out character who feels authentic and relatable.  \n   - She struggles with vulnerability, trying not to let her disability define her while also learning to accept it.  \n   - Her resilience in the face of physical and emotional challenges makes her story compelling.  \n   - Brynn’s family is supportive and sweet, adding depth to her journey.  \n   - Oliver, her ex-boyfriend, is a likable character, and their rekindled connection adds emotional weight to the story.  \n\n- **Themes and Emotional Impact:**  \n   - The book explores themes of self-acceptance, disability, and the struggle to balance vulnerability with strength.  \n   - Brynn’s journey to come to terms with her Ehlers Danlos Syndrome and her future is heartwarming and emotionally resonant.  \n   - The story feels realistic and authentic, making it relatable and impactful.  \n\n- **Plot and Pacing:**  \n   - The incident at school that leads to Brynn’s suspension serves as a turning point, giving her time to reflect on her life and disability.  \n   - The project with Oliver provides a meaningful subplot that helps Brynn confront her fears and reconsider her past decisions.  \n   - The pacing allows for a deep exploration of Brynn’s internal and external struggles.  \n\n- **Writing Style and Authenticity:**  \n   - The writing feels genuine and captures the complexities of living with a disability.  \n   - The portrayal of Brynn’s chronic pain and her efforts to hide her condition from others is handled with sensitivity and realism.  \n\n**Conclusion:**  \nThis book is a beautifully written, heartwarming story about self-acceptance, resilience, and the challenges of living with a disability. Brynn’s journey is both emotionally resonant and inspiring, and the supporting characters add depth and warmth to the narrative. It’s a realistic and authentic novel that I believe everyone should read.  \n\n**Rating Scores:**  \n(No specific rating scores were mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes"
        ],
        "review": [
            "The book opens in medias res, with Brynn and Oliver already broken up. This technique draws the reader into Brynn's carefully constructed life, intricately designed to conceal her disability. The narrative effectively foreshadows the impending collapse of her fragile existence, providing insight into her motivations and struggles before everything unravels.",
            "Brynn’s relationship with her father is a standout element of the story. Sharing the same condition, he offers a level of understanding and empathy that her well-meaning mother and sister cannot provide. This dynamic deepens the narrative and underscores the significance of shared experiences in building connections. Over the course of the novel, Brynn experiences substantial growth. Initially, she believes that hiding her medical diagnosis will stabilize her relationships. However, she gradually realizes that keeping her disability a secret limits her. While various characters remind her that the choice is hers, Brynn ultimately envisions a different life and takes proactive steps to pursue it. This character arc is both realistic and inspiring.",
            "This book is a thoughtful, funny, and endearing blend of romance and meaningful explorations of family and friendship. The relationships evolve throughout the story, adding depth to the narrative. The romance is seamlessly integrated, and Brynn’s connections significantly shape her journey."
        ],
        "conclusion": "This novel is a heartfelt and engaging read, offering a mix of humor, romance, and emotional depth. Brynn’s journey of self-discovery and the exploration of her relationships make for a compelling story. Fans of *Every Time You Go Away* by Abigail Johnson are likely to enjoy this book.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "19018847-kasey-giard",
        "reviewer_followers": "65 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**  \n- **Narrative Structure:**  \n  The book begins in the middle of the story, with Brynn and Oliver already broken up. This approach immediately immerses the reader into Brynn’s carefully constructed life, which is built on hiding her disability. The narrative effectively sets the stage for the eventual collapse of her \"house-of-cards\" existence, allowing just enough time to understand her motivations and struggles before everything unravels.  \n\n- **Character Relationships:**  \n  Brynn’s relationship with her dad is particularly compelling. Since he shares the same condition as her, he provides a unique level of understanding and empathy that her mom and sister, despite their good intentions, cannot offer. This dynamic adds depth to the story and highlights the importance of shared experiences in fostering connection.  \n\n- **Character Development:**  \n  Brynn undergoes significant growth throughout the novel. Initially, she believes that concealing her medical diagnosis will simplify her relationships and make them more stable. However, as the story progresses, she begins to realize how much she limits herself by keeping her disability a secret. Several characters emphasize that this choice is hers to make, but Brynn eventually envisions a different life and takes active steps to pursue it. This arc is both realistic and inspiring.  \n\n- **Themes and Tone:**  \n  The book is thoughtful, funny, and endearing, blending romance with meaningful explorations of family and friendship. The relationships in the story are not static; they evolve and grow, adding layers to the narrative. The romance elements are well-integrated, and the impact of Brynn’s relationships on her journey is deeply felt.  \n\n**Conclusion:**  \nThis novel is a heartfelt and engaging read, offering a mix of humor, romance, and emotional depth. Brynn’s journey of self-discovery and the exploration of her relationships make for a compelling story. Fans of *Every Time You Go Away* by Abigail Johnson are likely to enjoy this book.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes"
        ],
        "review": [
            "The story surrounding her illness feels underdeveloped. While her relationship with her father is well-explored, other characters appear one-dimensional. The central theme of her coming to terms with her illness and embracing her true self feels rushed, especially in the final 50 pages. Key elements like friendships, romance, and world-building lack depth, making the narrative feel generic and uninspired. Additionally, the pacing is uneven, with crucial developments crammed into the conclusion, which diminishes the overall impact of the story.",
            "The protagonist is both relatable and flawed, grappling with a debilitating illness that is often invisible. Her struggles are authentically depicted, reminding us that not all disabilities are apparent. This representation is both necessary and impactful, evoking empathy and frustration as we accompany her on her journey.",
            "The inclusion of the Covid pandemic and its societal impact feels jarring and repetitive. Although the analysis of people's behavior during this time is valid, it often seems forced and disrupts the narrative flow."
        ],
        "conclusion": "The novel has potential, particularly in its representation of a protagonist with a debilitating illness, which is both authentic and impactful. However, the underdeveloped plot, one-dimensional supporting characters, and repetitive social commentary detract from its overall quality. While it was an enjoyable and quick read, it ultimately falls short of being a standout YA novel.",
        "rating": "2",
        "review_likes": "False",
        "reviewer_id": "39218303-nickie",
        "reviewer_followers": "41 reviews",
        "reviewer_review_nums": "41 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development and Representation:**  \n   - The protagonist is relatable and imperfect, dealing with a debilitating illness. Her struggles are portrayed authentically, and her journey serves as a reminder that not all disabilities are visible.  \n   - The representation of her illness is much needed and impactful, evoking empathy and frustration alongside her.  \n\n- **Plot and Story Development:**  \n   - The story outside of her illness feels underdeveloped. While her relationship with her father is well-portrayed, other characters come across as one-dimensional.  \n   - The central theme of her coming to terms with her illness and no longer hiding feels rushed, particularly in the last 50 pages.  \n   - The plot lacks depth in areas like friendships, romance, and overall world-building, leaving the story feeling generic and lackluster.  \n\n- **Themes and Social Commentary:**  \n   - The inclusion of the Covid pandemic and its societal impact is jarring and repetitive. While the analysis of people’s behavior during the pandemic is valid, it feels forced and out of place at times, disrupting the flow of the narrative.  \n\n- **Pacing and Structure:**  \n   - The pacing is uneven, with significant developments crammed into the final section of the book. This rushed conclusion detracts from the overall impact of the story.  \n\n**Conclusion:**  \nThe novel has potential, particularly in its representation of a protagonist with a debilitating illness, which is both authentic and impactful. However, the underdeveloped plot, one-dimensional supporting characters, and repetitive social commentary detract from its overall quality. While it was an enjoyable and quick read, it ultimately falls short of being a standout YA novel.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Emotional Impact"
        ],
        "review": [
            "The story centers on Brynn's health struggles and her battle against a school board that favors a wealthy boy whose parents excuse his misbehavior. The romance subplot is organic and well-crafted, showcasing a charming second chance romance that enhances Brynn's character development.",
            "Brynn is a multi-dimensional and relatable protagonist, and her journey of self-discovery resonates even with readers who do not have a chronic illness. The supporting characters, especially her father, mother, and sister, are well-developed, adding depth to the narrative. The nuanced portrayal of Brynn's father, who shares her condition, along with her mother's and sister's support for loved ones with EDS, enhances the story's emotional impact.",
            "This story masterfully explores themes of self-identity and personal growth, making it relatable to a broad audience, even those without chronic illness. It weaves a tapestry of beauty, heartbreak, and humor, highlighting the challenges of living with a chronic condition, the journey of self-acceptance, and the strength of family love. The author’s personal experience with disability lends authenticity and depth to the narrative, effectively capturing the struggles, heartaches, and triumphs faced by both the protagonist and her family."
        ],
        "conclusion": "*Conditions of the Heart* is a deeply emotional and authentic novel that masterfully explores themes of chronic illness, self-acceptance, and family dynamics. With well-developed characters, a compelling plot, and a touching romance, the story resonates on multiple levels. While the resolution of the school board conflict could have been more explicit, the overall narrative is impactful and relatable.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "39914664-cherokee---books-with-a-chance",
        "reviewer_followers": "39 followers",
        "reviewer_review_nums": "385 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Emotional Impact and Themes:**  \n   - The story is described as \"beautiful, heartbreaking, and humorous,\" blending themes of living with a chronic illness, self-acceptance, and family love.  \n   - The author’s personal experience with a disability adds authenticity and depth to the narrative.  \n   - The book effectively portrays the struggles, heartbreaks, and triumphs of both the protagonist and her family.  \n\n- **Character Development:**  \n   - Brynn is a multi-faceted and relatable protagonist, with her journey of self-identity resonating even for readers without a chronic illness.  \n   - The side characters, particularly Brynn’s father, mother, and sister, are well-developed and add richness to the story.  \n   - The portrayal of Brynn’s father, who shares her condition, and her mother and sister, who support loved ones with EDS, is nuanced and impactful.  \n\n- **Plot and Subplots:**  \n   - The main plot revolves around Brynn’s health and her fight against the school board, which sided with a boy whose parents used their wealth to excuse his bad behavior.  \n   - While the resolution of the school board conflict is implied, the reviewer expresses a desire for a more explicit conclusion.  \n   - The romance subplot is organic and well-executed, featuring a \"cute second chance romance\" that feels natural and adds depth to Brynn’s character development.  \n\n- **Relatability and Universality:**  \n   - The story’s focus on self-identity and personal growth makes it relatable to a wide audience, even for those without a chronic illness.  \n\n**Conclusion:**  \n*Conditions of the Heart* is a deeply emotional and authentic novel that masterfully explores themes of chronic illness, self-acceptance, and family dynamics. With well-developed characters, a compelling plot, and a touching romance, the story resonates on multiple levels. While the resolution of the school board conflict could have been more explicit, the overall narrative is impactful and relatable.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language"
        ],
        "review": [
            "The conclusion is both satisfying and well-crafted, effectively wrapping up the story. It follows a teenage girl with a chronic illness who yearns for a normal life while concealing her condition. The book skillfully highlights the challenges of invisible illnesses, broadening the reader's understanding of this important aspect of life. The pacing is well-executed, and the high school setting enhances the story's relatability. Although the numerous conflicts can sometimes feel overwhelming, they ultimately serve to foster the protagonist's growth.",
            "Brynn, the main character, is well-developed and relatable, making her journey of self-discovery and her willingness to open up to others compelling. The supporting characters, including her caring family and Oliver, enrich the narrative. Oliver exemplifies the importance of trust and care in relationships. The minor antagonist is also well-crafted, contributing to a balanced dynamic among the characters. Although a romantic subplot exists, the book primarily emphasizes Brynn’s personal growth rather than centering on romance.",
            "This book is expertly crafted, highlighting themes of self-development and emotional depth. The author presents a distinctive narrative that sets it apart from their earlier works."
        ],
        "conclusion": "This is a compelling and well-crafted novel that explores themes of invisible illness, self-discovery, and personal growth. The relatable characters, engaging plot, and thoughtful writing make it a standout read. While the conflicts can feel overwhelming at times, they contribute meaningfully to the protagonist’s development. Overall, it’s a book I thoroughly enjoyed and would recommend, especially for those seeking a story with depth and heart.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "91557016-thindbooks",
        "reviewer_followers": "41 followers",
        "reviewer_review_nums": "1,076 reviews",
        "reformatted_ori_review": "**Aspects:**\n\n- **Plot and Themes:**\n   - The story follows a teen girl with a chronic illness who desires a normal life while keeping her condition hidden.\n   - The book effectively showcases invisible illnesses and opens the reader’s mind to this aspect of the world.\n   - The pacing is well-done, and the high school setting adds to the story’s relatability.\n   - There are numerous conflicts in the story, which, while occasionally overwhelming, contribute to the protagonist’s growth.\n\n- **Character Development:**\n   - Brynn, the main character, is well-developed and relatable. Her journey of self-discovery and opening up to others is compelling.\n   - The side characters, including Brynn’s supportive family and Oliver, add depth to the story. Oliver’s character highlights the importance of trust and care in relationships.\n   - The minor antagonist is well-written, creating a balanced dynamic among the characters.\n\n- **Romance:**\n   - While there is a romantic subplot, the book primarily focuses on Brynn’s personal journey rather than being a romance-centric story.\n\n- **Writing Style:**\n   - The book is well-written, with a strong emphasis on self-development and emotional depth.\n   - The author successfully delivers a unique story that stands out from their previous works.\n\n- **Ending:**\n   - The conclusion is satisfying and well-executed, tying up the story effectively.\n\n**Conclusion:**\nThis is a compelling and well-crafted novel that explores themes of invisible illness, self-discovery, and personal growth. The relatable characters, engaging plot, and thoughtful writing make it a standout read. While the conflicts can feel overwhelming at times, they contribute meaningfully to the protagonist’s development. Overall, it’s a book I thoroughly enjoyed and would recommend, especially for those seeking a story with depth and heart.\n\n**Rating Scores:**\n- No specific numerical rating is mentioned in the review, but the overall sentiment is highly positive."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The story opens with a conflict at a pep rally that results in Brynn's suspension, compelling her to confront her fears and insecurities. This pivotal moment sparks her journey of self-discovery.",
            "In this story, Brynn, the protagonist, is a well-developed character whose compelling inner monologue drives the narrative. Her struggle to conceal her chronic pain and her journey toward self-acceptance form the heart of the tale. The supporting characters, including Brynn's family and friends, are equally well-crafted and play crucial roles in her growth. They genuinely wish to support her, while the narrative emphasizes Brynn's journey toward vulnerability with them.",
            "This book thoughtfully examines themes of identity, vulnerability, and self-acceptance. Though it centers on chronic illness, Brynn's journey is universally relatable, offering insights that any teen can connect with. While romantic elements are present, they take a backseat to Brynn's personal growth and her challenges with opening up to others.",
            "The author skillfully weaves humor into the narrative, especially through Brynn’s inner monologue. This infusion of lightness enhances the story, making it both engaging and relatable despite its serious themes."
        ],
        "conclusion": "*Conditions of a Heart* by the author is a heartfelt and humorous YA novel that offers authentic representation of chronic illness while exploring universal themes of identity and vulnerability. Brynn’s journey is both relatable and inspiring, and the well-developed characters add depth to the story. It’s a must-read for anyone looking for a meaningful and engaging narrative.",
        "rating": "4",
        "review_likes": "2",
        "reviewer_id": "5513367-amanda-shepard-between-the-shelves",
        "reviewer_followers": "44 followers",
        "reviewer_review_nums": "2,097 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation of Chronic Illness:**  \n   - The book provides meaningful representation of chronic illness, particularly Ehlers-Danlos syndrome, which is based on the author’s own experiences.  \n   - It’s a great addition to the growing number of YA books featuring chronic illness, offering a perspective that feels authentic and relatable.  \n\n- **Character Development:**  \n   - Brynn, the protagonist, is a well-developed character with a compelling inner monologue. Her struggle to hide her chronic pain and her journey toward self-acceptance are central to the story.  \n   - The side characters, including Brynn’s family and friends, are also well-crafted and play a significant role in her growth. They want to support her, and the story focuses on Brynn learning to be vulnerable with them.  \n\n- **Tone and Humor:**  \n   - Despite the serious subject matter, the author injects humor into the narrative, particularly through Brynn’s inner monologue. This adds a layer of lightness to the story, making it more engaging and relatable.  \n\n- **Themes and Relatability:**  \n   - The book explores themes of identity, vulnerability, and self-acceptance. While the focus is on chronic illness, Brynn’s journey is universal, and any teen could find something to relate to in her story.  \n   - The romance elements are present but take a backseat to Brynn’s personal growth and her struggle to let people in.  \n\n- **Plot and Conflict:**  \n   - The story begins with a conflict at a pep rally, which leads to Brynn’s suspension and forces her to confront her fears and insecurities. This serves as a catalyst for her journey toward self-discovery.  \n\n**Conclusion:**  \n*Conditions of a Heart* by Bethany Mangle is a heartfelt and humorous YA novel that offers authentic representation of chronic illness while exploring universal themes of identity and vulnerability. Brynn’s journey is both relatable and inspiring, and the well-developed characters add depth to the story. It’s a must-read for anyone looking for a meaningful and engaging narrative.  \n\n**Rating Scores:**  \n(No specific rating scores were mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "World-Building and Setting",
            "Themes",
            "Emotional Impact"
        ],
        "review": [
            "Brynn's character is skillfully developed, enabling readers to vividly experience her pain, heartache, exhaustion, and fear. Her deliberate effort to conceal her illness from family, friends, an ex-boyfriend, and her school reveals a deep internal conflict and the extreme measures she takes to maintain the façade of being okay.",
            "The writing is meticulously crafted, immersing me in Brynn's world and emotions with intentionality.",
            "The portrayal of invisible illnesses is both realistic and heart-wrenching, offering a raw and honest glimpse into the struggles faced by the protagonist, Brynn. The story delves deeply into the fear and reality of living with an invisible illness, particularly the anxiety surrounding others' reactions.",
            "This book poignantly captures the challenges of living with an invisible illness, providing readers with a profound understanding of this experience. It delves into themes of self-reinvention and courage, as Brynn seizes the chance to embrace her true self when her meticulously crafted world unravels.",
            "This book is achingly beautiful and deeply honest, offering a raw and thought-provoking experience that takes readers on an emotional roller coaster. It evokes a wide range of feelings—laughter, tears, and profound reflection—making it a truly moving read."
        ],
        "conclusion": "*Conditions of a Heart* is a beautifully written, emotionally charged novel that offers a raw and honest portrayal of living with an invisible illness. Through Brynn's journey, the book provides deep insight into the struggles, fears, and emotional toll of such an experience, while also exploring themes of self-reinvention and bravery. It is a thought-provoking and deeply moving read that will resonate with readers on multiple levels.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "147028986-bailey-young",
        "reviewer_followers": "22 followers",
        "reviewer_review_nums": "751 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Emotional Impact:**  \n  - The book is described as \"achingly beautiful, tear-jerking, honest, raw, thought-provoking, and an emotional roller coaster.\"  \n  - It evokes a range of emotions, including laughter, tears, and deep feelings, making it a profoundly moving read.  \n\n- **Realism and Authenticity:**  \n  - The portrayal of invisible illnesses is \"realistic and heart-wrenching,\" offering a raw and honest depiction of the struggles faced by the protagonist, Brynn.  \n  - The story provides deep insight into the fear and reality of living with an invisible illness, particularly the fear of others' reactions.  \n\n- **Character Development:**  \n  - Brynn's character is meticulously crafted, allowing readers to see her pain, heartache, exhaustion, and fear.  \n  - Her struggle to hide her illness from her family, friends, ex-boyfriend, and school is portrayed with great intentionality, highlighting her internal conflict and the lengths she goes to appear \"fine.\"  \n\n- **Themes and Messages:**  \n  - The book delicately and truthfully highlights the challenges of living with an invisible illness, offering readers a deeper understanding of this experience.  \n  - It explores themes of self-reinvention and bravery, as Brynn faces the opportunity to embrace her true self when her carefully planned world falls apart.  \n\n- **Writing Style:**  \n  - The writing is described as \"carefully crafted,\" with intentionality that immerses the reader in Brynn's world and emotions.  \n\n**Conclusion:**  \n*Conditions of a Heart* is a beautifully written, emotionally charged novel that offers a raw and honest portrayal of living with an invisible illness. Through Brynn's journey, the book provides deep insight into the struggles, fears, and emotional toll of such an experience, while also exploring themes of self-reinvention and bravery. It is a thought-provoking and deeply moving read that will resonate with readers on multiple levels.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language"
        ],
        "review": [
            "The romance fell flat, largely due to Oliver's underdeveloped character. However, this didn't significantly diminish my overall enjoyment, as the focus on the female main character's journey was engaging. Unfortunately, the ending was disappointing and left me feeling unsatisfied. While the intended message was clear, its execution was lacking.",
            "The protagonist experiences significant growth throughout the book, which is satisfying to witness. Brynn and her family are well-developed and engaging, while other characters, particularly Oliver, feel underdeveloped and unrealistic; his perfection as an 18-year-old male is hard to believe. The strongest aspect of the book is its Own Voices disability representation. The author’s intimate understanding of living with a disability shines through, making the portrayal both emotional and relatable. The protagonist’s perspective on daily frustrations in a world designed for able-bodied individuals is deeply moving and eye-opening.",
            "This book is engaging, blending emotion with moments of comic relief effectively. However, the angst and cheesy dialogue occasionally come across as over-the-top and unrealistic for its young adult audience, given that the main characters are just 18 years old."
        ],
        "conclusion": "Overall, this book is an emotional and eye-opening read with strong disability representation and a compelling FMC. While the romance and some characterizations fell flat, the FMC’s growth and the authentic portrayal of her struggles made the story engaging. The ending, however, was a letdown.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "115561755-kiley",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "96 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation and Authenticity:**  \n   - The Own Voices disability representation is the best part of the book. The author’s intimate knowledge of living with the disability shines through, making the portrayal emotional and relatable.  \n   - The FMC’s perspective on daily frustrations and struggles in a world designed for able-bodied people was deeply moving and eye-opening.  \n\n- **Character Development:**  \n   - The FMC undergoes significant growth throughout the book, which was satisfying to witness.  \n   - Brynn and her family were well-developed and engaging, but other characters, especially Oliver, felt underdeveloped and unrealistic. Oliver’s perfection as an 18-year-old male was hard to believe.  \n\n- **Romance Subplot:**  \n   - The romance felt flat, primarily due to the lack of depth in Oliver’s character. However, this didn’t detract too much from the overall enjoyment, as the focus on the FMC’s journey was compelling enough.  \n\n- **Writing Style and Tone:**  \n   - The book is engaging, with a good mix of emotion and comic relief.  \n   - The angst and cheesy dialogue sometimes felt over-the-top and unrealistic for the YA age group (18-year-old MCs).  \n\n- **Ending:**  \n   - The ending was disappointing and felt unsatisfying. While the intended message might have been clear, its execution left much to be desired.  \n\n**Conclusion:**  \nOverall, this book is an emotional and eye-opening read with strong disability representation and a compelling FMC. While the romance and some characterizations fell flat, the FMC’s growth and the authentic portrayal of her struggles made the story engaging. The ending, however, was a letdown.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Emotional Impact",
            "Enjoyment and Engagement"
        ],
        "review": [
            "Brynn is a well-crafted teenage protagonist with clear aspirations: finding her place in the world, fitting in at school, gaining familial understanding, and moving on from her first love. Her journey is further complicated by chronic pain and the lingering effects of the Covid pandemic, which add depth to her character and narrative. Drawing from personal experiences with Ehlers-Danlos Syndrome, the author creates a richly developed character. As someone who shares this illness, I found Brynn’s struggles deeply relatable. The portrayal of chronic pain and the challenges of navigating family, school, and romance feels authentic and resonates deeply.",
            "Both disabled and able-bodied readers will find Brynn's journey relatable. Her universal struggles and aspirations, coupled with the added context of her disability and the pandemic, create a uniquely compelling narrative. I highly recommend this book to those with chronic illness, chronic pain, or disabilities, as well as able-bodied readers looking to gain insight into the disability experience.",
            "This book is both meaningful and thoroughly enjoyable. The engaging story seamlessly weaves the disability experience into a narrative that is insightful and entertaining. I've already recommended it to friends and family for pre-order."
        ],
        "conclusion": "This book is a timely and impactful read, offering authentic representation of disability while delivering a compelling and enjoyable story. It resonates deeply with disabled readers and provides valuable insight for able-bodied readers.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "2550862-jennifer-dupuis",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "19 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation and Authenticity:**  \n  The author, Bethany Mangle, draws from her own experiences with Ehlers Danlos Syndrome to create a fully fleshed-out main character, Brynn. As a disabled reader who shares the same illness, I deeply appreciated seeing my struggles reflected in Brynn’s story. The portrayal of chronic pain and the challenges of navigating family, school, and romance felt authentic and relatable.  \n\n- **Character Development:**  \n  Brynn is a well-developed teenage girl with clear goals: finding her place in the world, fitting in at school, gaining understanding from her family, and moving on from her first love. Her journey is layered with the added complexity of dealing with chronic pain and the lingering effects of the Covid pandemic, which adds depth to her character and story.  \n\n- **Relatability and Appeal:**  \n  Both disabled and able-bodied readers will find Brynn’s story relatable. Her struggles and aspirations are universal, but the added layer of her disability and the pandemic context makes her journey uniquely compelling. I would highly recommend this book to readers with chronic illness, chronic pain, or disability, as well as to able-bodied readers seeking insight into the disability experience.  \n\n- **Narrative and Enjoyment:**  \n  The book is not only meaningful but also thoroughly enjoyable to read. The story is engaging, and the disability experience is woven seamlessly into a narrative that is both insightful and entertaining. I have already encouraged friends and family to pre-order it.  \n\n**Conclusion:**  \nThis book is a timely and impactful read, offering authentic representation of disability while delivering a compelling and enjoyable story. It resonates deeply with disabled readers and provides valuable insight for able-bodied readers.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters"
        ],
        "review": [
            "The pacing in the final third of the book felt rushed, disrupting the overall flow. Additionally, the middle section dragged at times, leaving some moments feeling flat. Nevertheless, despite Brynn’s understandable pessimism, the satisfying happy ending brought a smile to my face.",
            "I thoroughly enjoyed Brynn’s perspective and the way the book depicted her navigation of a post-pandemic world as a person with a disability. Her conversations with her body parts were a highlight for me! However, the relationships between Brynn and Eliza, as well as Brynn and her mom, felt underdeveloped and lacked depth; something about these family dynamics seemed off. In contrast, I appreciated the warmth and connection in Brynn’s relationships with Oliver and Francesca, which enriched the story."
        ],
        "conclusion": "Overall, I enjoyed this book a lot! While the pacing and some relationships could have been more fleshed out, Brynn’s unique perspective and her journey in a post-pandemic world kept me engaged. The ending was heartwarming, and the relationships with Oliver and Francesca added depth to the story.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "66664011-jade-x1fab7",
        "reviewer_followers": "2 followers",
        "reviewer_review_nums": "110 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development (Brynn):**  \n  I really enjoyed Brynn’s perspective and how the book explored her navigation of a post-pandemic world as someone with a disability. Her conversations with her different body parts were my favorite part of the book!  \n\n- **Character Relationships:**  \n  The relationships between Brynn and Eliza, as well as Brynn and her mom, felt underdeveloped and lacked depth. I couldn’t quite pinpoint why, but something about these family dynamics felt off. On the other hand, I liked the relationships between Brynn and Oliver, and Brynn and Francesca—they added warmth and connection to the story.  \n\n- **Pacing:**  \n  The pacing of the last third of the book felt rushed, which detracted from the overall flow. The middle section also dragged a bit, making some parts feel flat.  \n\n- **Ending:**  \n  Despite Brynn’s understandable pessimism, the happy ending was satisfying and made me smile.  \n\n**Conclusion:**  \nOverall, I enjoyed this book a lot! While the pacing and some relationships could have been more fleshed out, Brynn’s unique perspective and her journey in a post-pandemic world kept me engaged. The ending was heartwarming, and the relationships with Oliver and Francesca added depth to the story.  \n\n**Rating Scores:**  \n3.75 ⭐️"
    },
    {
        "aspects": [
            "Characters",
            "Expectation Fulfillment"
        ],
        "review": [
            "Brynn is a relatable, humorous, and charming character. Her authentic personality and struggles resonated with me, allowing me to connect deeply with her journey.",
            "This book skillfully blends heavy themes with humor and charm, resulting in a contemporary romance that balances emotional depth with lighthearted moments."
        ],
        "conclusion": "This book is a heartfelt, relatable, and well-crafted contemporary romance that excels in its representation of chronic illness and disability. Brynn's character and her experiences resonated deeply with me, and the balance of humor and emotional depth made it an unforgettable read.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "98324110-natalie",
        "reviewer_followers": "48 followers",
        "reviewer_review_nums": "234 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation of Chronic Illness and Disability:**  \n  - The representation of chronic illnesses like POTS and EDS was done exceptionally well. As someone with POTS and other chronic illnesses, I found Brynn's experiences to be incredibly relatable, especially for young people.  \n  - The portrayal of Brynn's father, who uses a wheelchair and has EDS, was also well-executed, and I loved the depiction of their relationship.  \n  - The book includes meaningful conversations about being disabled/chronically ill and using mobility aids, which added depth and authenticity to the story.  \n\n- **Character Development:**  \n  - Brynn is a realistic, funny, and endearing character. Her personality and struggles felt genuine, and I found myself deeply connected to her journey.  \n\n- **Genre and Tone:**  \n  - Despite its heavy themes, the book manages to be a funny and cute contemporary romance, balancing emotional depth with lighthearted moments.  \n\n- **Overall Enjoyment:**  \n  - I absolutely loved this book and am grateful to have received an ARC. It has become a new favorite in disability representation for me.  \n\n**Conclusion:**  \nThis book is a heartfelt, relatable, and well-crafted contemporary romance that excels in its representation of chronic illness and disability. Brynn's character and her experiences resonated deeply with me, and the balance of humor and emotional depth made it an unforgettable read.  \n\n**Rating Scores:**  \n4.5⭐️"
    },
    {
        "aspects": [
            "Characters",
            "World-Building and Setting",
            "Themes",
            "Emotional Impact"
        ],
        "review": [
            "In this story, Brynn Kwan, the protagonist, grapples with hypermobile Ehlers-Danlos syndrome (EDS), a genetic condition that brings pain, fatigue, and the need for constant medical attention. Her internal conflict over concealing her disability from her boyfriend, Oliver, makes her a relatable character for readers facing similar health challenges. Brynn's journey underscores the emotional burden of pretending to be \"normal\" and emphasizes the significance of authentic representation.",
            "The slower pace of high school during Covid allowed Brynn to connect with Oliver online, a dynamic she found easier than face-to-face interactions. This context adds depth to the story, illustrating how external circumstances can shape personal relationships and self-perception.",
            "The novel skillfully examines themes of ableism, highlighting how casual words and actions affect individuals with disabilities. Brynn’s experiences prompt readers without health challenges to reflect on their own behaviors and attitudes. Additionally, the story illuminates the emotional and physical burdens of living with a chronic illness, providing a valuable perspective for all readers.",
            "Brynn's internal battle to uphold a facade of normalcy culminates in a poignant emotional arc. Readers will likely resonate with her journey, rendering the story both engaging and thought-provoking. Its capacity to evoke empathy and understanding makes it an ideal selection for book clubs."
        ],
        "conclusion": "This novel offers a heartfelt and insightful portrayal of living with a chronic illness, with Brynn Kwan serving as a compelling and relatable protagonist. It not only provides meaningful representation for readers with health challenges but also encourages others to reflect on ableism and their own actions. The emotional depth and social commentary make it a standout read, particularly for book club discussions.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "16320240-chris-g",
        "reviewer_followers": "5 followers",
        "reviewer_review_nums": "668 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Representation and Relatability:**  \n  Brynn Kwan, the protagonist, has hypermobile Ehlers-Danlos syndrome (EDS), a genetic condition that causes pain, fatigue, and requires frequent medical care. Her struggles with EDS and her decision to hide her disability from her boyfriend, Oliver, make her a deeply relatable character for readers with similar health challenges. Her journey highlights the emotional toll of pretending to be \"normal\" and the importance of authentic representation.  \n\n- **Themes and Social Commentary:**  \n  The novel effectively explores themes of ableism and the impact of casual words and actions on individuals with disabilities. Brynn’s experiences encourage readers without health challenges to reflect on their own behaviors and attitudes. The story also sheds light on the emotional and physical burdens of living with a chronic illness, offering a valuable perspective for all readers.  \n\n- **Pacing and Setting:**  \n  The slower pace of high school during Covid provided Brynn with a unique opportunity to connect with Oliver online, which she found easier than in-person interactions. This setting adds depth to the story, showing how external circumstances can influence personal relationships and self-perception.  \n\n- **Emotional Impact and Reader Engagement:**  \n  Brynn’s internal struggle to maintain a facade of normalcy and her eventual breaking point create a powerful emotional arc. Readers are likely to empathize with her journey, making the story both engaging and thought-provoking. The novel’s ability to foster empathy and understanding makes it an excellent choice for book clubs.  \n\n**Conclusion:**  \nThis novel offers a heartfelt and insightful portrayal of living with a chronic illness, with Brynn Kwan serving as a compelling and relatable protagonist. It not only provides meaningful representation for readers with health challenges but also encourages others to reflect on ableism and their own actions. The emotional depth and social commentary make it a standout read, particularly for book club discussions.  \n\n**Rating Scores:**  \nNo specific rating scores were mentioned in the review."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes",
            "Emotional Impact"
        ],
        "review": [
            "I wish we had a conclusion about the school board's decision, but I hope it favored the truth.",
            "I appreciated getting to know Brynn and her struggles with her chronic condition, which she has kept hidden from everyone. Her desire to conceal her condition is understandable, especially after her friend took advantage of her and failed to provide support. Initially, I found it challenging to connect with her mother and sister Eliza, who do not share Brynn's condition, unlike her father.",
            "The portrayal of privilege and bullying at the private school, especially through the characters of Pat and his parents, infuriated me. It's shocking to see the advantages that wealth can provide in such an environment.",
            "I appreciated the raw honesty of this book, which offers a profound insight into the life of someone with a chronic illness. The depiction of how society often treats individuals in this situation—facing accusations of seeking attention or receiving dismissive advice like \"just try yoga\"—is both striking and enlightening."
        ],
        "conclusion": "This novel is a powerful and honest exploration of living with chronic illness, privilege, and relationships. While some characters took time to connect with, Brynn’s journey and the social commentary on bullying and privilege were compelling. The lack of a clear resolution for the school board decision left me wanting more, but overall, it was an impactful read.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "13620118-sarah-bowe",
        "reviewer_followers": "1,739 reviews",
        "reviewer_review_nums": "1,739 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Emotional Impact and Honesty:**  \n   - I loved how raw and honest this book is. It really opens your eyes to the life of a person with chronic illness.  \n   - The portrayal of how people treat those with chronic illness, such as being accused of \"complaining for attention\" or receiving dismissive advice like \"just try yoga,\" felt incredibly real and eye-opening.  \n\n- **Character Development and Relationships:**  \n   - I really liked getting to know Brynn and her struggles with her chronic condition, which she's been hiding from everyone.  \n   - I understood why Brynn wanted to hide her condition after her \"friend\" took advantage of her and was unsupportive.  \n   - It took a while for me to warm up to her mom and sister Eliza, who don’t share the same condition as Brynn and her father.  \n\n- **Social Commentary and Themes:**  \n   - The depiction of privilege and bullying at the private school, particularly Pat and his parents, made me so mad. I cannot believe the things that being rich can get you in such a setting.  \n\n- **Plot and Resolution:**  \n   - I wish we had a conclusion regarding the school board decision, but I hope it went in favor of the truth.  \n\n**Conclusion:**  \nThis novel is a powerful and honest exploration of living with chronic illness, privilege, and relationships. While some characters took time to connect with, Brynn’s journey and the social commentary on bullying and privilege were compelling. The lack of a clear resolution for the school board decision left me wanting more, but overall, it was an impactful read.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Writing and Language",
            "Themes",
            "Emotional Impact"
        ],
        "review": [
            "This book had me laughing and was engagingly written. It skillfully balances the charm of a classic romcom with the unique perspective of a disabled teen protagonist, adding depth and relatability to the story.",
            "The book's exploration of privilege and its absence was remarkable. I found it refreshing to witness characters push back against bullies and achieve varied outcomes, which felt empowering and healing in ways I can't fully articulate.",
            "Reading this book unexpectedly facilitated my healing. It offered me comfort in ways I never anticipated, and I'm truly grateful that it exists and that I had the opportunity to read it."
        ],
        "conclusion": "This book was a pleasant surprise, blending humor, social commentary, and heartfelt representation of disability. It resonated deeply with me, offering both emotional healing and a sense of validation. While it’s a standard romcom at its core, the unique perspective of a disabled protagonist elevates it into something truly special.",
        "rating": "3",
        "review_likes": "False",
        "reviewer_id": "61986788-zev",
        "reviewer_followers": "4 followers",
        "reviewer_review_nums": "743 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation of Disability:**  \n  I really liked seeing a disabled parent helping out their disabled teen. It felt validating and important to me, as I’m the only disabled person in my family. While I don’t have the same condition as the protagonist, I understood her decisions and felt a deep connection to her experiences.  \n\n- **Themes and Social Commentary:**  \n  The way privilege and the lack of it were addressed in the book was wonderful. It was refreshing to see others push back on bullies and achieve different outcomes, which felt empowering and healing in ways I can’t fully explain.  \n\n- **Writing Style and Tone:**  \n  The book made me laugh and was written in an interesting way. It balanced being a standard romcom with the unique perspective of having a disabled teen as the protagonist, which added depth and relatability.  \n\n- **Emotional Impact:**  \n  Somehow, parts of me healed while reading this book. It made me feel better in ways I didn’t expect, and I’m so glad it was written and that I got to read it.  \n\n- **Hopes for the Book’s Reception:**  \n  I hope this book is widely read and respected because it offers such an important and validating perspective.  \n\n**Conclusion:**  \nThis book was a pleasant surprise, blending humor, social commentary, and heartfelt representation of disability. It resonated deeply with me, offering both emotional healing and a sense of validation. While it’s a standard romcom at its core, the unique perspective of a disabled protagonist elevates it into something truly special.  \n\n**Rating Scores:**  \n2.5 stars (with the acknowledgment that the emotional impact and representation outweighed the star rating)."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters"
        ],
        "review": [
            "I found it hard to believe that no one at Brynn's school was aware of her condition, especially given that schools usually maintain records of students' medical issues. It was baffling that the principal viewed Brynn as a troublemaker, particularly since she was simply trying to help someone and ended up facing unjust punishment.",
            "Brynn's portrayal was at times inconsistent. Although her self-esteem issues were clear, her absence of personal goals made her seem helpless, which became tiresome. Additionally, I found it frustrating that Brynn was often treated as if she were incompetent, with more telling than showing of her intelligence and capabilities."
        ],
        "conclusion": "This was a good book with an intriguing premise, but it fell short in terms of believability, character development, and depth of representation. While it introduced me to Ehlers-Danlos Syndrome, the story left me wanting more complexity and resolution.",
        "rating": "3",
        "review_likes": "False",
        "reviewer_id": "13439094-caitie",
        "reviewer_followers": "64 followers",
        "reviewer_review_nums": "1,993 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Plot Believability:**  \n   - I found it hard to believe that no one at Brynn's school knew about her condition, especially since schools typically have records of students' medical conditions.  \n   - The principal's perception of Brynn as a \"bad kid\" didn't make sense to me, as she was trying to help someone and ended up being punished unfairly.  \n\n- **Character Development:**  \n   - Brynn's portrayal felt inconsistent at times. While her self-esteem issues were evident, her lack of personal goals and plans made her come off as helpless, which became tiring.  \n   - I didn't appreciate how Brynn was treated like an idiot; there was a lot of \"telling\" rather than \"showing\" her intelligence or capabilities.  \n\n- **Representation of Ehlers-Danlos Syndrome:**  \n   - Learning about Ehlers-Danlos Syndrome was interesting, as I hadn't heard of it before. However, I felt the portrayal was overly simplistic and didn't delve deeply into the complexities of living with the condition.  \n\n- **Overall Potential:**  \n   - The book had potential and was a good read, but I finished it feeling like it could have offered more depth and resolution.  \n\n**Conclusion:**  \nThis was a good book with an intriguing premise, but it fell short in terms of believability, character development, and depth of representation. While it introduced me to Ehlers-Danlos Syndrome, the story left me wanting more complexity and resolution.  \n\n**Rating Scores:**  \n3.5/5 stars."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Enjoyment and Engagement"
        ],
        "review": [
            "While this book is not a romance, I wished Oliver had played a more active role, especially since romance is a significant concern for Brynn.",
            "I thoroughly enjoyed Brynn as a narrator and appreciated her character development throughout the story. However, I felt indifferent towards Oliver; he came across as a wish fulfillment character. I believe my perception would have changed if he had more agency, depth, or simply appeared more frequently. I loved the quirky and offbeat nature of the characters, especially Cousin Tori with her legendary cat café.",
            "I couldn't put this book down and finished it in a single day."
        ],
        "conclusion": "Overall, I found the book quite good, with a compelling narrator, unique characters, and an engaging pace. While I enjoyed Brynn’s journey and the quirky cast, I felt Oliver’s character could have been more developed and active, especially given the importance of romance to Brynn.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "24626174-k-c-norton",
        "reviewer_followers": "24 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**  \n- **Narrator and Character Development:**  \n   - I really enjoyed Brynn as a narrator and her journey as a character.  \n\n- **Representation of hEDS (Hypermobile Ehlers-Danlos Syndrome):**  \n   - I don’t know Mangle’s relationship with hEDS and couldn’t find much information about it in a quick Google search. Since I don’t have personal experience with it, I’ll refrain from commenting on this aspect and leave it to other reviewers.  \n\n- **Character Quirks and Uniqueness:**  \n   - I liked how weird and offbeat most, if not all, of the characters were. Cousin Tori, with her cat cafe, is a legend.  \n\n- **Character Neutrality and Development (Oliver):**  \n   - The one character I was extremely neutral on was Oliver. He feels like wish fulfillment, and I think I would have felt differently if he’d had more agency, been more interesting, or even just been on-page more.  \n\n- **Romance Subplot:**  \n   - This book is definitely not a romance, but since romance is a significant source of personal concern for Brynn, I would have liked Oliver to be more active.  \n\n- **Engagement and Pacing:**  \n   - I read this in a day and had trouble putting it down.  \n\n**Conclusion:**  \nOverall, I found the book quite good, with a compelling narrator, unique characters, and an engaging pace. While I enjoyed Brynn’s journey and the quirky cast, I felt Oliver’s character could have been more developed and active, especially given the importance of romance to Brynn.  \n\n**Rating Scores:**  \nSomewhere between 4 and 5 stars for me."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters"
        ],
        "review": [
            "The incident where Brynn attempts to intervene in a school fight and is subsequently labeled a troublemaker by her principal feels underdeveloped, lacking sufficient evidence to justify this accusation. Additionally, the book's ending comes across as abrupt and offers little resolution. While some readers may appreciate the open-ended conclusion, others might find it frustrating.",
            "Brynn's battle with Ehlers-Danlos Syndrome (EDS) is a central theme, and it's compelling to see how her condition affects every facet of her life. However, the depiction of her secrecy surrounding her illness feels somewhat unrealistic; it's hard to believe that no one at her school would be aware of it."
        ],
        "conclusion": "The novel provides an engaging exploration of Brynn's life with EDS and the challenges she faces, particularly in balancing her condition with her school life. However, certain aspects, such as the lack of realism in her secrecy and the underdeveloped conflict with her principal, detract from the story. The abrupt ending may also leave some readers wanting more closure.",
        "rating": "3",
        "review_likes": "False",
        "reviewer_id": "9897195-tara",
        "reviewer_followers": "12 followers",
        "reviewer_review_nums": "2,160 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development and Representation:**  \n  - Brynn's struggle with EDS (Ehlers-Danlos Syndrome) is a central theme, and it was interesting to read about how her condition impacts every aspect of her life.  \n  - The portrayal of Brynn's secrecy about her condition felt somewhat unrealistic, as it seems unlikely that no one at her school would know about it.  \n\n- **Plot and Conflict:**  \n  - The incident where Brynn tries to stop a fight at school and gets labeled as a \"troublemaker\" by her principal felt underdeveloped. There wasn't enough evidence to convincingly justify this accusation.  \n\n- **Ending and Resolution:**  \n  - The book's ending felt abrupt and lacked sufficient resolution. While some readers might be okay with this open-ended conclusion, others may find it frustrating.  \n\n**Conclusion:**  \nThe novel provides an engaging exploration of Brynn's life with EDS and the challenges she faces, particularly in balancing her condition with her school life. However, certain aspects, such as the lack of realism in her secrecy and the underdeveloped conflict with her principal, detract from the story. The abrupt ending may also leave some readers wanting more closure.  \n\n**Rating Scores:**  \n- No specific rating scores were mentioned in the review."
    },
    {
        "aspects": [
            "Characters",
            "Emotional Impact",
            "Enjoyment and Engagement",
            "Expectation Fulfillment"
        ],
        "review": [
            "Brynn's relationships with her friends, sister, ex-boyfriend, and parents are central to the story. Each connection is complex and thoughtfully explored, but her relationship with her dad stands out as particularly impactful, elevating the book to new heights.",
            "In her novel, Bethany Mangle skillfully conveys the complex emotions surrounding life with a disability, both for those who live with it and for their loved ones. Brynn's anguish is vividly portrayed, and her struggle with uncertainty renders future planning nearly impossible. While the book is challenging, it is also heartfelt and profoundly moving.",
            "While *Conditions of a Heart* may take some time to fully engage with due to its initially vague elements, the effort is ultimately rewarding. I found myself reading late into the night, often moved to tears by the story.",
            "*Conditions of a Heart* is a compelling YA novel that beautifully explores themes of love and friendship, offering a deeply emotional experience."
        ],
        "conclusion": "*Conditions of a Heart* is a deeply emotional and rewarding read that explores complex relationships and the challenges of living with a disability. While it may take some time to fully engage with the story, the emotional payoff is well worth it. The novel’s heartfelt portrayal of love, friendship, and family dynamics, particularly Brynn’s relationship with her dad, makes it a standout in the YA genre.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "6779301-jessica-harrison",
        "reviewer_followers": "49 followers",
        "reviewer_review_nums": "797 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Engagement and Pacing:**  \n  - It takes a while to get into *Conditions of a Heart* because some key elements aren’t immediately explained. However, sticking with it is greatly rewarding.  \n  - The book kept me reading late into the night, even bringing me to tears at times.  \n\n- **Emotional Depth and Themes:**  \n  - Author Bethany Mangle artfully captures the emotions involved with living with a disability and living with someone who has a disability.  \n  - Brynn’s anguish is palpable, and the uncertainty she faces makes planning for the future nearly impossible.  \n  - The novel is not an easy read, but it’s heartfelt and deeply moving.  \n\n- **Character Relationships:**  \n  - Brynn’s relationships — with her friends, sister, ex-boyfriend, mom, and dad — are central to the story.  \n  - All relationships are complex and well-explored, but the one with her dad stands out as particularly impactful, making the book truly shine.  \n\n- **Genre and Overall Quality:**  \n  - *Conditions of a Heart* is a strong YA novel, full of love and friendship, and it delivers a powerful emotional experience.  \n\n**Conclusion:**  \n*Conditions of a Heart* is a deeply emotional and rewarding read that explores complex relationships and the challenges of living with a disability. While it may take some time to fully engage with the story, the emotional payoff is well worth it. The novel’s heartfelt portrayal of love, friendship, and family dynamics, particularly Brynn’s relationship with her dad, makes it a standout in the YA genre.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Emotional Impact",
            "Expectation Fulfillment"
        ],
        "review": [
            "I loved this book for its insight into my daughter's struggles with chronic illness. It deepened my understanding of her feelings of invisibility, a perspective I had not fully grasped before.",
            "This book is a must-read, particularly for healthy individuals. It educates and fosters empathy for those struggling with invisible illnesses."
        ],
        "conclusion": "This book is a powerful and eye-opening read that deepened my understanding of chronic illness and the challenges faced by those living with it. It encouraged me to reflect on my own assumptions and behaviors, and I hope it does the same for others.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "4161867-wendy",
        "reviewer_followers": "11 reviews",
        "reviewer_review_nums": "11 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Personal Connection and Empathy:**  \n  I loved this book because it helped me better understand my daughter's struggles with chronic illness. It gave me insight into how she feels when she feels invisible, which is something I hadn’t fully grasped before.  \n- **Relevance to Current Issues:**  \n  The book made me reflect on how Covid is still a significant concern for people with compromised immune systems. It highlighted how they might feel criticized or ridiculed for wearing masks, which is something I hadn’t considered deeply.  \n- **Author’s Contribution:**  \n  I want to thank Bethany for sharing her experiences in such a vulnerable and impactful way. Her storytelling has the potential to foster greater compassion and understanding among readers.  \n- **Target Audience and Impact:**  \n  I believe this book is a must-read, especially for healthy individuals like myself. It has the power to educate and inspire more empathy toward those battling \"invisible\" illnesses.  \n\n**Conclusion:**  \nThis book is a powerful and eye-opening read that deepened my understanding of chronic illness and the challenges faced by those living with it. It encouraged me to reflect on my own assumptions and behaviors, and I hope it does the same for others.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters"
        ],
        "review": [
            "I found the main character's behavior frustrating at times. Although I understood her struggles, she rarely communicated her thoughts and feelings to her family (aside from her dad), who genuinely wanted to support her but often came off as overbearing. It was disheartening to see her not open up more to them."
        ],
        "conclusion": "Overall, I found the book just okay. While it effectively portrayed the struggles of living with a chronic illness, the main character’s lack of communication and the unfair treatment by authority figures detracted from my enjoyment.",
        "rating": "2",
        "review_likes": "False",
        "reviewer_id": "145265744-apekshya-dc",
        "reviewer_followers": "94 reviews",
        "reviewer_review_nums": "94 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Understanding of Chronic Illness:**  \n   - I understood the challenges of living with a chronic illness, especially as a teenager whose dreams and plans are disrupted by health conditions.  \n\n- **Character Behavior (Main Character):**  \n   - I didn’t like the main character’s behavior in some ways. While I understood her struggles, she rarely communicated her thoughts and feelings to her family (except her dad), even though they were trying to support her.  \n\n- **Family Dynamics:**  \n   - Her family was overbearing and didn’t fully understand her feelings, but they genuinely wanted to be there for her. It frustrated me that she didn’t open up to them more.  \n\n- **School and Authority Figures:**  \n   - The way the principal treated her was infuriating. Despite her responsibilities in multiple senior year events, he unfairly labeled her as the “bad kid.” I wanted to beat him up (in my mind, obviously) when he appeared.  \n\n**Conclusion:**  \nOverall, I found the book just okay. While it effectively portrayed the struggles of living with a chronic illness, the main character’s lack of communication and the unfair treatment by authority figures detracted from my enjoyment.  \n\n**Rating Scores:**  \n2.5/5"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes"
        ],
        "review": [
            "The open-ended conclusion involving the school board was, in my opinion, the most effective choice.",
            "Brynn is a compelling and relatable character, making her journey engaging. However, I would have appreciated more development of Oliver, as their relationship felt somewhat rushed towards the end.",
            "This book adeptly delves into the complexities of living with chronic illness, capturing the profound grief of never experiencing a \"normal\" life. It underscores the importance of amplifying stories from chronically ill individuals and advocating for more own-voices literature. The narrative features a mixed-race (Asian/white) protagonist with hEDS and POTS, alongside supporting characters who also have hEDS, and includes on-page sapphic representation through a pansexual character in a sapphic relationship."
        ],
        "conclusion": "Overall, I had a great time reading this book. Brynn’s character was compelling, and the exploration of chronic illness and its emotional toll was deeply impactful. While I wished for more development in Oliver’s character and their relationship, the open-ended conclusion with the school board was a strong narrative choice. The representation and themes make this a standout read.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "83060642-bee",
        "reviewer_followers": "13 followers",
        "reviewer_review_nums": "632 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n  - Brynn was an interesting and relatable character to follow.  \n  - I would have liked a little more expansion on Oliver; their relationship felt a bit rushed at the end.  \n\n- **Themes and Representation:**  \n  - The book effectively explores the complexities of living with chronic illness, including the grief of never having a \"normal\" life.  \n  - It highlights the need for more stories about chronically ill individuals and more own voices books.  \n  - Representation includes a mixed-race (Asian/white) main character with hEDS and POTS, supporting characters with hEDS, and on-page sapphic representation (a pansexual character in a sapphic relationship).  \n\n- **Plot and Pacing:**  \n  - The ending with the school board was left open, which I found to be the best decision.  \n\n**Conclusion:**  \nOverall, I had a great time reading this book. Brynn’s character was compelling, and the exploration of chronic illness and its emotional toll was deeply impactful. While I wished for more development in Oliver’s character and their relationship, the open-ended conclusion with the school board was a strong narrative choice. The representation and themes make this a standout read.  \n\n**Rating Scores:**  \n4.25/5 stars"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Emotional Impact",
            "Expectation Fulfillment"
        ],
        "review": [
            "I breezed through this book; it was a brief yet somewhat sweet read.",
            "This book felt essential for me. I instinctively knew I needed to read it. Although I don’t have hEDS (Hypermobile Ehlers-Danlos Syndrome) or POTS (Postural Orthostatic Tachycardia Syndrome), I could relate to the frustration of not being taken seriously about my health. The story resonated deeply, especially since I know someone with POTS and am currently facing unresolved medical issues myself. Brynn’s narration was both humorous and realistic, effectively capturing the ups and downs of living with chronic illness. While the book often felt heavy, it ultimately offered a sense of hope and light at the end of the tunnel.",
            "I usually avoid romance and realistic fiction unless they incorporate elements of history or fantasy. However, this book resonated with me due to its relevance to my personal experiences."
        ],
        "conclusion": "This was an amazing book, and no one can tell me otherwise. It was deeply relatable, emotionally impactful, and offered a realistic yet hopeful portrayal of living with chronic illness.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "177010197-molly-bates",
        "reviewer_followers": "82 reviews",
        "reviewer_review_nums": "82 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Genre and Personal Preference:**  \n  I don’t typically read romance or realistic fiction without elements of history or fantasy. However, this book felt different to me because of its relevance to my personal experiences.  \n\n- **Relatability and Representation:**  \n  The story resonated deeply with me. I know someone with POTS (Postural Orthostatic Tachycardia Syndrome), and I’m currently dealing with unresolved medical issues myself. Brynn’s narration was both funny and realistic, capturing the ups and downs of living with chronic illness. While the book often felt heavy, it also offered a sense of hope and light at the end of the tunnel.  \n\n- **Emotional Impact:**  \n  This book felt necessary for me to read. Something inside me knew I needed it. Even though I don’t have hEDS (Hypermobile Ehlers-Danlos Syndrome) or POTS, I could relate to the frustration of not being taken seriously about my health.  \n\n- **Pacing and Length:**  \n  I read this book way too fast—it was a short and (kind of) sweet read.  \n\n**Conclusion:**  \nThis was an amazing book, and no one can tell me otherwise. It was deeply relatable, emotionally impactful, and offered a realistic yet hopeful portrayal of living with chronic illness.  \n\n**Rating Scores:**  \n4.5 stars!"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The central conflict unfolds when Brynn is mistakenly accused of violence during a school event, resulting in her suspension from senior activities. This incident triggers a journey of self-discovery, prompting her to reevaluate her identity and aspirations.",
            "Brynn is a multifaceted character grappling with her identity, shaped by her genetic disease and fear of rejection. Her compelling journey of self-discovery resonates deeply. The supporting cast, including her parents, best friend Francesca, and ex-boyfriend Oliver, are well-developed and diverse, providing love and support that enrich the narrative.",
            "The book thoughtfully examines the perception and treatment of people with disabilities, even by well-meaning individuals. This nuanced representation adds significant depth to the narrative.",
            "I thoroughly enjoyed the book. The characters, themes, and Brynn's personal journey kept me fully engaged."
        ],
        "conclusion": "This novel is a heartfelt exploration of identity, disability, and relationships. Brynn’s journey of self-discovery, supported by a cast of well-developed and diverse characters, makes for a compelling and thought-provoking read. The representation of disability and the themes of perception and acceptance are handled with care and add depth to the story.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "15662289-nicole-miller",
        "reviewer_followers": "4 followers",
        "reviewer_review_nums": "663 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n  - Brynn is portrayed as a complex character who struggles with her identity due to her genetic disease and the fear of rejection. Her journey of self-discovery is compelling and relatable.  \n  - Brynn’s parents, her best friend Francesca, and her ex-boyfriend Oliver are all well-rounded, diverse, and interesting characters. Their love and support for Brynn add depth to the story.  \n\n- **Representation and Themes:**  \n  - The book effectively explores how people with disabilities are perceived and treated, even by those with good intentions. This representation is handled thoughtfully and adds significant value to the narrative.  \n\n- **Plot and Conflict:**  \n  - The central conflict arises when Brynn is wrongly accused of violence at a school event, leading to her suspension from senior activities. This incident serves as a catalyst for her to question her identity and what she truly wants.  \n\n- **Enjoyment and Engagement:**  \n  - I thoroughly enjoyed the book. The characters, themes, and Brynn’s personal journey kept me engaged throughout.  \n\n**Conclusion:**  \nThis novel is a heartfelt exploration of identity, disability, and relationships. Brynn’s journey of self-discovery, supported by a cast of well-developed and diverse characters, makes for a compelling and thought-provoking read. The representation of disability and the themes of perception and acceptance are handled with care and add depth to the story.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Themes",
            "Enjoyment and Engagement"
        ],
        "review": [
            "I appreciated the #ownvoices representation of Ehlers-Danlos Syndrome in this book and felt a deep connection with the main character. However, I didn't find myself particularly invested in the other characters.",
            "The writing style failed to leave a lasting impression on me.",
            "The book delves into profound themes, enriched by impactful quotes that resonate throughout the narrative.",
            "While the book offers strong representation and relatability, it ultimately reads like a standard YA novel."
        ],
        "conclusion": "While I deeply appreciated the #ownvoices EDS representation and found the main character highly relatable, the book overall felt like a standard YA novel. The characters and writing style didn’t fully engage me, though the themes and quotes were thought-provoking and impactful.",
        "rating": "3",
        "review_likes": "1",
        "reviewer_id": "62298083-hailey-hudson",
        "reviewer_followers": "34 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation and Relatability:**  \n   - I loved the #ownvoices EDS (Ehlers-Danlos Syndrome) representation in this book.  \n   - I related to the main character (mc) so much.  \n\n- **Character Development and Engagement:**  \n   - I wasn’t super invested in any of the characters.  \n\n- **Writing Style:**  \n   - The writing style didn’t particularly stand out to me.  \n\n- **Themes and Quotes:**  \n   - The book explored profound themes through impactful quotes, such as:  \n     - “If my body is a temple, then this illness has made it a ruin.”  \n     - “Your life is always going to keep changing. It’s hard to lose things, but you’ll find a new baseline and new things that make you happy. You will find good people. I promise.”  \n     - “‘Don’t you want to be extraordinary?’ ‘I think I could settle just fine for ordinary.’”  \n     - “It doesn’t make my life shorter, but it does make it smaller. How much of a world is a bed?”  \n     - “I wanted what everyone else got to have.”  \n     - “I’m tired of trying to squeeze into the tiniest space that’s left for me.”  \n\n- **Overall Impression:**  \n   - Besides the representation and relatability, the book felt like a pretty basic YA novel.  \n\n**Conclusion:**  \nWhile I deeply appreciated the #ownvoices EDS representation and found the main character highly relatable, the book overall felt like a standard YA novel. The characters and writing style didn’t fully engage me, though the themes and quotes were thought-provoking and impactful.  \n\n**Rating Scores:**  \n(No specific rating scores were mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Emotional Impact",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The novel offers a poignant portrayal of Brynn, a teenager grappling with a genetic disorder. Her struggles are conveyed with compassion and honesty, making her a relatable and fully realized character. Another well-developed character, Oliver, adds depth to the narrative. One of the most compelling aspects of the book is Brynn's relationship with her family. Sharing the Ehlers-Danlos gene with her father allows him to understand her in ways her mother and sister cannot, creating a unique and complex tension within the household. This authentic depiction of living with a genetic disorder will likely resonate with readers who have similar experiences.",
            "The novel sensitively portrays Brynn's condition, offering a validating and supportive narrative for young readers facing similar challenges.",
            "This book is definitely worth reading, as it presents realistic relationships and thoughtfully addresses challenging themes."
        ],
        "conclusion": "This novel is a heartfelt and honest portrayal of a teen navigating life with a genetic disorder. It excels in character development, family dynamics, and representation, making it a relatable and supportive read for young people with similar experiences.",
        "rating": "3",
        "review_likes": "False",
        "reviewer_id": "79405120-katrina",
        "reviewer_followers": "591 reviews",
        "reviewer_review_nums": "591 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n  - The novel provides a well-done portrait of Brynn, a teen with a genetic disorder. Her grief over her condition is discussed with compassion and honesty, making her character relatable and deeply human.  \n  - Oliver, another character, is portrayed as a great and realistic individual, adding depth to the story.  \n\n- **Family Dynamics:**  \n  - The relationship between Brynn and her family is one of the most interesting aspects of the book. Brynn shares the Ehlers-Danlos gene with her father, which allows him to understand her in a way her mother and sister cannot.  \n  - This shared condition creates a particular and complicated tension within the household, adding layers to the family dynamics.  \n\n- **Representation and Relatability:**  \n  - The novel handles Brynn's condition with sensitivity, making it a story that young people with similar conditions would likely find validating and supportive.  \n  - The portrayal of living with a genetic disorder feels authentic and is likely to resonate with readers who share similar experiences.  \n\n- **Overall Appeal:**  \n  - The book is worth a read, as it offers a lot to appreciate, from its realistic relationships to its compassionate handling of difficult themes.  \n\n**Conclusion:**  \nThis novel is a heartfelt and honest portrayal of a teen navigating life with a genetic disorder. It excels in character development, family dynamics, and representation, making it a relatable and supportive read for young people with similar experiences.  \n\n**Rating Scores:**  \n- Not explicitly mentioned in the review."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters"
        ],
        "review": [
            "The only reason I can't give this a 5-star rating is that it feels incomplete. The plot leaves key elements unresolved, particularly the school board's decision and Brynn's senior year. I was hoping for a definitive conclusion to tie everything together.",
            "I thoroughly enjoyed Brynn's journey of navigating her grief and embracing her disability and access needs. The Own Voices representation for EDS is commendable, and the author effectively conveys the complexities of living with a disability, including both the symptoms and the emotional struggles. I highly recommend this charming second-chance romance, which features a delightful queer romance in the background."
        ],
        "conclusion": "This is a heartfelt and authentic novel with strong representation of living with a disability, particularly EDS. While Brynn's journey of grief and acceptance is beautifully portrayed, the plot feels incomplete, leaving some key storylines unresolved. Despite this, it’s a highly recommended read for its touching romance and meaningful themes.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "136016840-vic-young",
        "reviewer_followers": "264 reviews",
        "reviewer_review_nums": "264 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation and Authenticity:**  \n  I love that this is Own Voices for EDS representation. The author really captured how living with a disability feels like, both the symptoms and the grief.  \n\n- **Character Development:**  \n  I absolutely loved seeing Brynn's journey through her own grief and acceptance of her disability and access needs.  \n\n- **Plot and Resolution:**  \n  The only reason it's not a 5-star read is because I feel like it left off in a random place. The plot feels unfinished, with the school board decision and Brynn's senior year not being resolved. I really wanted to see the end of everything and see the resolution.  \n\n- **Romance and Themes:**  \n  Highly recommend reading this cute second chance romance book, with a cute queer romance in the background.  \n\n**Conclusion:**  \nThis is a heartfelt and authentic novel with strong representation of living with a disability, particularly EDS. While Brynn's journey of grief and acceptance is beautifully portrayed, the plot feels incomplete, leaving some key storylines unresolved. Despite this, it’s a highly recommended read for its touching romance and meaningful themes.  \n\n**Rating Scores:**  \n4.5/5"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes",
            "Emotional Impact"
        ],
        "review": [
            "The story forgoes excessive action and drama, centering instead on Brynn’s daily life and her longing for simplicity. This understated approach allows the emotional depth of her experiences to resonate powerfully. The ending remains open, which seems intentional and mirrors the unpredictable nature of real life, where not every situation resolves neatly.",
            "Brynn's character is beautifully crafted; she is weary of her illness and exhausted by her circumstances, yearning for a normal life on her own terms. Her struggles and desires resonate with authenticity and depth.",
            "The novel beautifully balances the heaviness of Brynn's condition with a sense of hope and resilience. The heartfelt narrative addresses its weighty themes with remarkable sensitivity.",
            "The novel moved me to tears at least four times. Although I don’t have a chronic condition, I found the story incredibly poignant and relatable."
        ],
        "conclusion": "This novel is a masterpiece that beautifully captures the struggles and desires of its protagonist, Brynn. Its emotional depth, unique narrative style, and authentic portrayal of life with a chronic condition make it a profoundly moving read.",
        "rating": "5",
        "review_likes": "2",
        "reviewer_id": "25620627-alicia",
        "reviewer_followers": "74 followers",
        "reviewer_review_nums": "2,163 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Emotional Impact:**  \n  The novel made me cry on no less than four occasions. Despite not having a chronic condition myself, I found the story deeply moving and relatable.  \n\n- **Narrative Style:**  \n  The brevity of the writing, combined with the unique commentary from Brynn’s body parts, added a distinctive and engaging layer to the storytelling.  \n\n- **Character Development:**  \n  Brynn’s character is beautifully portrayed. She’s someone who is sick of being sick and tired of being tired, longing for a normal life on her own terms. Her struggles and desires felt authentic and heartfelt.  \n\n- **Plot Structure:**  \n  The story doesn’t rely on a lot of action or dramatic events. Instead, it focuses on Brynn’s daily life and her wish for things to be easier. This simplicity allows the emotional weight of her experiences to shine through.  \n\n- **Themes and Balance:**  \n  The novel balances the heaviness of Brynn’s condition with a sense of hope and resilience. The story carries so much heart, and the weight of everything is handled with care.  \n\n- **Ending:**  \n  The ending isn’t completely resolved, but this feels intentional and reflective of real life, where not everything is neatly tied up.  \n\n**Conclusion:**  \nThis novel is a masterpiece that beautifully captures the struggles and desires of its protagonist, Brynn. Its emotional depth, unique narrative style, and authentic portrayal of life with a chronic condition make it a profoundly moving read.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Emotional Impact"
        ],
        "review": [
            "The book powerfully illustrates the profound impact of an EDS diagnosis on young people's lives, stripping them of their sense of control and agency. It poignantly conveys the grief associated with the life they can no longer live, capturing the isolation and loneliness that often accompany this journey."
        ],
        "conclusion": "This book is a powerful and accurate representation of living with Ehlers-Danlos Syndrome, particularly for teens. It captures the emotional and practical challenges of the condition while offering a sense of understanding and relatability. I highly recommend it to both those affected by EDS and those seeking to learn more about it.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "161355172-jenna-deveau",
        "reviewer_followers": "5 reviews",
        "reviewer_review_nums": "5 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation of Chronic Illness:**  \n  - This book is incredibly important for teens living with chronic illness.  \n  - I’ve never seen my illness represented anywhere other than social media, and this book was spot on.  \n  - It accurately portrays the experience of being diagnosed with Ehlers-Danlos Syndrome (EDS) and how it changes every aspect of life.  \n\n- **Emotional Impact and Relatability:**  \n  - The book shows how crushing it can be for young people to be diagnosed with EDS and how it takes away their sense of control over their own choices.  \n  - It perfectly captures the feeling of grieving the life you can’t have due to EDS, which can often feel isolating and lonely.  \n\n- **Recommendation and Future Hopes:**  \n  - I hope more media about all types of EDS will come out in the near future.  \n  - I will absolutely recommend this book to friends with EDS and to anyone wishing to learn more about the illness.  \n\n**Conclusion:**  \nThis book is a powerful and accurate representation of living with Ehlers-Danlos Syndrome, particularly for teens. It captures the emotional and practical challenges of the condition while offering a sense of understanding and relatability. I highly recommend it to both those affected by EDS and those seeking to learn more about it.  \n\n**Rating Scores:**  \n{No specific rating scores mentioned in the review.}"
    },
    {
        "aspects": [
            "Characters",
            "Enjoyment and Engagement",
            "Expectation Fulfillment"
        ],
        "review": [
            "I found the main character's journey of self-discovery and personal growth both inspiring and emotionally resonant.",
            "The book skillfully balances poignant moments with sharp humor and occasional hilarious inner dialogue, adding levity and enhancing the overall engagement of the story.",
            "I highly recommend this book to anyone interested in EDS, disabilities, and their associated challenges, as well as to fans of YA contemporary novels."
        ],
        "conclusion": "*Conditions of a Heart* is a powerful and relatable novel that skillfully balances pain with humor, offering an inspiring journey of self-discovery. It’s a must-read for those interested in disability representation and YA contemporary stories.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "103605137-joy",
        "reviewer_followers": "13 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**  \n- **Portrayal of Disabilities:**  \n  The novel is at times painful to read because of how well it portrays the disabilities of the main character. As someone who shares some of the same conditions, I found the depiction of anger, frustration, and moments of hopelessness deeply relatable.  \n\n- **Tone and Humor:**  \n  The book balances the necessary pain with sharp quips and sporadic hilarious inner dialogue, which adds levity and makes the story more engaging.  \n\n- **Character Development:**  \n  I loved watching the main character go through a journey of self-discovery and personal growth, which was both inspiring and emotionally resonant.  \n\n- **Target Audience:**  \n  I highly recommend this book not only to those interested in learning more about EDS or disabilities and the struggles they entail but also to fans of YA contemporary novels.  \n\n**Conclusion:**  \n*Conditions of a Heart* is a powerful and relatable novel that skillfully balances pain with humor, offering an inspiring journey of self-discovery. It’s a must-read for those interested in disability representation and YA contemporary stories.  \n\n**Rating Scores:**  \n5 of 5 stars"
    },
    {
        "aspects": [
            "Writing and Language",
            "Emotional Impact"
        ],
        "review": [
            "The writing is both engaging and humorously crafted. A standout quote captures this perfectly: *I don't fuss with setting an alarm, hoping that maybe I'll just sleep until I feel as well rested as it's possible to feel when your autonomic nervous system is made of three drunk carrier pigeons in a trench coat.*",
            "This is the kind of book I wish I had during my upbringing. It captures emotions and experiences that resonated with me, making it a truly meaningful read."
        ],
        "conclusion": "This book is a heartfelt, authentic, and humorous exploration of life with an invisible disability. It’s a story I deeply connected with and one I highly recommend, especially for those seeking relatable and well-crafted narratives.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "28508644-erin-cunningham",
        "reviewer_followers": "167 reviews",
        "reviewer_review_nums": "167 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation of Disability:**  \n  The book effectively captures the experience of navigating high school and relationships with an \"invisible\" disability. As an ownvoices novel, it provides an authentic and relatable portrayal that resonated deeply with me.  \n\n- **Relatability and Personal Connection:**  \n  This is the type of book I wished I had while growing up. It articulates feelings and experiences that I could strongly connect with, making it a meaningful read.  \n\n- **Writing Style and Humor:**  \n  The writing is engaging and infused with humor. One of my favorite quotes perfectly illustrates this: *\"I don't fuss with setting an alarm, hoping that maybe I'll just sleep until I feel as well rested as it's possible to feel when your autonomic nervous system is made of three drunk carrier pigeons in a trench coat.\"*  \n\n**Conclusion:**  \nThis book is a heartfelt, authentic, and humorous exploration of life with an invisible disability. It’s a story I deeply connected with and one I highly recommend, especially for those seeking relatable and well-crafted narratives.  \n\n**Rating Scores:**  \nNot explicitly mentioned in the review."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters"
        ],
        "review": [
            "The love story in this book is a subtle yet well-crafted element of the narrative. It doesn’t overshadow the plot, offering a refreshing change in YA fiction, where romance often takes center stage.",
            "In this story, the protagonist Brynn is a nuanced character who faces suspension from school through no fault of her own, prompting her to reevaluate her reasons for continuing her education. The narrative delves into her internal battles with illness, her coping strategies, and her inclination to overanalyze even the smallest remarks from others. While Brynn is not without flaws—struggling to maintain relationships and occasionally misinterpreting situations—she experiences significant growth by learning to accept certain realities, which enriches her character."
        ],
        "conclusion": "*Condition of a Heart* is a challenging yet necessary read that explores the internal and external struggles of an 18-year-old girl with EDS/hEDS. Brynn’s imperfect but relatable journey, combined with a well-balanced romance subplot and strong disability representation, makes this book a standout in YA fiction.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "67308614-akansha",
        "reviewer_followers": "5 followers",
        "reviewer_review_nums": "538 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Narrative Difficulty and Necessity:**  \n  *Condition of a Heart* is a tough book to get through, but it feels necessary. The story delves into the struggles of an 18-year-old girl with EDS/hEDS, making it a challenging yet important read.  \n\n- **Character Development (Brynn):**  \n  The protagonist, Brynn, is a complex character who gets suspended from school through no fault of her own. This incident leads her to question her reasons for continuing school entirely. The book explores her internal struggles with her illness, her coping mechanisms, and her tendency to overanalyze even the smallest comments from others. Brynn isn’t perfect—she struggles to maintain relationships and often fails to understand certain things. However, she grows by learning to accept certain realities, which adds depth to her character.  \n\n- **Romance Subplot:**  \n  The love story in the book is a small but well-executed part of the narrative. It doesn’t dominate the plot, which is refreshing, especially in YA fiction where romance often consumes most of the story.  \n\n- **Representation of Disability:**  \n  The book provides meaningful representation of disability, particularly through Brynn’s experiences with EDS/hEDS. It’s a great addition to anyone’s reading list if they’re looking for more disability representation in literature.  \n\n**Conclusion:**  \n*Condition of a Heart* is a challenging yet necessary read that explores the internal and external struggles of an 18-year-old girl with EDS/hEDS. Brynn’s imperfect but relatable journey, combined with a well-balanced romance subplot and strong disability representation, makes this book a standout in YA fiction.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Themes"
        ],
        "review": [
            "In her journey, Brynn embodies the struggle for normalcy as she battles her health issues. Her efforts to conceal her challenges while striving to meet societal expectations resonate deeply, making her experience both authentic and relatable.",
            "This novel illuminates the societal misconceptions surrounding hidden disabilities, providing a poignant critique of how these conditions are frequently overlooked or misunderstood. It explores the challenges faced by a teenager with an invisible illness, capturing the difficulties of navigating high school while managing a hidden health condition. I appreciated the unique perspective it offers, as hidden disabilities are often misrepresented or absent in fiction."
        ],
        "conclusion": "This novel provides a heartfelt and insightful look into the life of a teenager grappling with an invisible illness. It not only offers a fresh perspective on a rarely explored topic but also challenges societal misconceptions about hidden disabilities.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "151269761-noelle-n",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "115 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Theme and Representation:**  \n  The story delves into the struggles of being a teenager with an invisible illness, highlighting the challenges of navigating high school while dealing with a hidden health condition. I appreciated the unique perspective it offered, as hidden disabilities are often misunderstood and rarely represented in fiction.  \n\n- **Character Development:**  \n  Brynn, the protagonist, is portrayed as someone constantly battling her body to achieve a sense of normalcy. Her journey to hide her health struggles while trying to meet societal expectations felt authentic and relatable.  \n\n- **Social Commentary:**  \n  The novel sheds light on the societal misjudgments surrounding hidden disabilities, offering a poignant critique of how these conditions are often overlooked or misunderstood.  \n\n**Conclusion:**  \nThis novel provides a heartfelt and insightful look into the life of a teenager grappling with an invisible illness. It not only offers a fresh perspective on a rarely explored topic but also challenges societal misconceptions about hidden disabilities.  \n\n**Rating Scores:**  \n(No specific rating scores were mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Emotional Impact",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The main character, a high school student, exhibited over-dramatic behavior that felt appropriate for her age, yet ultimately rendered her uninteresting. Her personality and actions failed to resonate with me, leaving the story lacking in depth and engagement.",
            "I particularly valued the representation of disability, as I am navigating my own new normal. This aspect of the book resonated with me deeply.",
            "The book was quite dull, failing to engage me at any point. The pacing felt sluggish, and the story lacked compelling elements to sustain my interest."
        ],
        "conclusion": "While the book had a meaningful representation of disability that I connected with, the overall story lacked engagement and failed to hold my interest. The main character’s development felt flat, and the pacing made the reading experience feel tedious.",
        "rating": "2",
        "review_likes": "False",
        "reviewer_id": "145200914-melissa",
        "reviewer_followers": "112 reviews",
        "reviewer_review_nums": "112 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Engagement and Pacing:**  \n  The book was pretty boring, and nothing really drew or kept me engaged. The pacing felt slow, and the story lacked elements that could hold my interest.  \n\n- **Character Development:**  \n  The main character was in high school, so her over-dramatic behavior made sense, but it still felt uninteresting. Her personality and actions didn’t resonate with me or make the story more compelling.  \n\n- **Representation of Disability:**  \n  The only saving grace was the portrayal of a disabled character where the main focus of the book wasn’t solely on her disability. It was refreshing to see her disability acknowledged as part of her life without it being the central theme. Her main issue in the book was grappling with the existence of her disability, but it didn’t feel like the story was entirely about her being disabled.  \n\n- **Personal Connection:**  \n  I especially appreciated the representation of disability as I’m learning to live with a new normal. This aspect of the book resonated with me on a personal level.  \n\n**Conclusion:**  \nWhile the book had a meaningful representation of disability that I connected with, the overall story lacked engagement and failed to hold my interest. The main character’s development felt flat, and the pacing made the reading experience feel tedious.  \n\n**Rating Scores:**  \n(No explicit rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes"
        ],
        "review": [
            "Although I hoped to enjoy the romance and other aspects of the book, I found the plot lacking momentum, which made it hard to stay engaged.",
            "The characters and their relationships stand out in this book. The dynamics, particularly Brynn's inner monologue and her moments of self-reflection, are both poignant and heartfelt.",
            "The exploration of illness in a post-COVID world adds depth and intrigue to the story."
        ],
        "conclusion": "The book had strong elements, such as well-developed characters and an interesting setting, but the lack of plot momentum hindered my overall enjoyment.",
        "rating": "3",
        "review_likes": "False",
        "reviewer_id": "42713264-sabrina-blandon",
        "reviewer_followers": "163 reviews",
        "reviewer_review_nums": "163 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Characters and Relationships:**  \n  The characters and their relationships with each other were highlights of the book. The dynamics between them, especially Brynn's inner monologue and moments of checking in with her body, were sweet and striking.  \n\n- **Concept and Setting:**  \n  The concept of illness set in a post-COVID world was intriguing and added depth to the story.  \n\n- **Romance and Plot Development:**  \n  While I wanted to love the romance and other elements of the book, I found the plot lacking movement, which made it difficult for me to stay engaged.  \n\n**Conclusion:**  \nThe book had strong elements, such as well-developed characters and an interesting setting, but the lack of plot momentum hindered my overall enjoyment.  \n\n**Rating Scores:**  \n{No specific rating scores mentioned in the review.}"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters"
        ],
        "review": [
            "The story's lack of fluidity hindered my overall enjoyment.",
            "The main relationship had a few moments that I didn't enjoy, which detracted from the overall story."
        ],
        "conclusion": "While the book excels in its representation of disability and chronic illness, it falls short in other areas, such as narrative flow and the development of the main relationship. Despite these shortcomings, it’s still worth a read, though it didn’t become a favorite of mine.",
        "rating": "3",
        "review_likes": "False",
        "reviewer_id": "140405013-read-with-lo",
        "reviewer_followers": "4 followers",
        "reviewer_review_nums": "76 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation of Disability and Chronic Illness:**  \n   - The book is adorable and has great disability representation.  \n   - As someone who lives with chronic illness, I really appreciated the idea of this book.  \n   - The chronic illness representation was on point.  \n\n- **Narrative Flow and Pacing:**  \n   - The story didn’t flow super well, which affected my overall enjoyment.  \n\n- **Character Relationships:**  \n   - The main relationship had some moments I didn’t love, which detracted from the story.  \n\n**Conclusion:**  \nWhile the book excels in its representation of disability and chronic illness, it falls short in other areas, such as narrative flow and the development of the main relationship. Despite these shortcomings, it’s still worth a read, though it didn’t become a favorite of mine.  \n\n**Rating Scores:**  \n- No specific rating scores mentioned in the review."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Emotional Impact",
            "Expectation Fulfillment"
        ],
        "review": [
            "This YA novel follows a girl with Ehlers-Danlos Syndrome (EDS) and Postural Orthostatic Tachycardia Syndrome (POTS) as she navigates the challenges of graduating high school. Faced with an unjust suspension and her own efforts to conceal her disabilities, she grapples with the difficulties of seeking acceptance while managing her health.",
            "As a femme-presenting disabled person, I found this book deeply comforting. It resonated with my experiences and reassured me that I'm not alone in my journey.",
            "This book is an excellent choice for teens grappling with school challenges or navigating invisible disabilities."
        ],
        "conclusion": "This novel resonated deeply with me due to its authentic representation of disability and the challenges of navigating high school while managing invisible conditions. It offers comfort and relatability, making it a valuable read for teens facing similar struggles.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "162942783-arrow",
        "reviewer_followers": "3 followers",
        "reviewer_review_nums": "168 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation and Relatability:**  \n  As a femme-presenting disabled person, I loved this book so much. It brought me so much comfort to know that others have gone through similar experiences that I have.  \n\n- **Plot and Themes:**  \n  This is a YA book about a girl with EDS and POTS who is struggling to graduate high school due to an unreasonable suspension and because she feels the need to hide her disability from everyone around her.  \n\n- **Target Audience and Relevance:**  \n  This book is a great read for any teens struggling with school or managing their invisible disabilities.  \n\n**Conclusion:**  \nThis novel resonated deeply with me due to its authentic representation of disability and the challenges of navigating high school while managing invisible conditions. It offers comfort and relatability, making it a valuable read for teens facing similar struggles.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Enjoyment and Engagement"
        ],
        "review": [
            "I've observed a growing trend in literature featuring protagonists with chronic or mental illnesses, and it's refreshing to see this diversification. \"Conditions of a Heart\" offers a poignant and authentic exploration of these significant themes. Brynn's story resonated with me deeply, and I felt a strong connection to the author, who shares similar health challenges.",
            "While the story had its moments, there were times when it felt a bit dull."
        ],
        "conclusion": "“Conditions of a Heart” is a heartfelt and authentic novel that shines in its representation of chronic and mental illnesses. While the story occasionally struggles with pacing, it remains a meaningful and impactful read.",
        "rating": "2",
        "review_likes": "False",
        "reviewer_id": "26738907-nacia-jackson",
        "reviewer_followers": "31 followers",
        "reviewer_review_nums": "146 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Representation and Diversity:**  \n  I’ve noticed an increasing number of books featuring protagonists with chronic or mental illnesses, and it’s wonderful to see this diversification in the literary world. “Conditions of a Heart” is a touching and realistic portrayal of these important issues.  \n- **Character Connection and Authenticity:**  \n  I was deeply moved by Brynn’s story and felt a strong connection to Mangle, the author, who also faces chronic illnesses.  \n- **Pacing and Engagement:**  \n  However, the story at times bored me.  \n\n**Conclusion:**  \n“Conditions of a Heart” is a heartfelt and authentic novel that shines in its representation of chronic and mental illnesses. While the story occasionally struggles with pacing, it remains a meaningful and impactful read.  \n\n**Rating Scores:**  \n{No specific rating scores mentioned in the review.}"
    },
    {
        "aspects": [
            "Emotional Impact",
            "Enjoyment and Engagement"
        ],
        "review": [
            "This novel resonated with me on a profound level. While I don’t have EDS or POTS, its exploration of how able-bodied individuals perceive those with disabilities and chronic illnesses was both essential and strikingly poignant.",
            "I often lost myself in Brynn's story, fully immersed in her journey and deeply connected to her experiences."
        ],
        "conclusion": "This novel is a powerful and raw exploration of disability, identity, and societal perceptions. It offers a deeply relatable and immersive narrative that made me feel seen and understood, even though my experiences differ from the protagonist’s.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "109447248-sammy-milfort",
        "reviewer_followers": "16 followers",
        "reviewer_review_nums": "148 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Relatability and Representation:**  \n  The novel made me feel deeply understood and seen. Even though I don’t have EDS or POTS, the way it explored how able-bodied people perceive disabled and chronically ill individuals felt incredibly necessary and raw.  \n\n- **Themes of Disability and Identity:**  \n  The discussion about hiding one’s disability to conform to societal expectations was profoundly relatable. The fear of friendships changing once others learn about your disability resonated strongly with me.  \n\n- **Engagement and Immersion:**  \n  At times, I forgot I was reading because I became so immersed in Brynn’s story. I fell completely in love with her journey and felt deeply connected to her experiences.  \n\n**Conclusion:**  \nThis novel is a powerful and raw exploration of disability, identity, and societal perceptions. It offers a deeply relatable and immersive narrative that made me feel seen and understood, even though my experiences differ from the protagonist’s.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The story is captivating and vividly portrays the chaos in the protagonist's life. However, the ending may leave some readers seeking more closure, though I recognize the choice to keep it open-ended was intentional.",
            "This novel centers on a disabled teen protagonist grappling with her chronic illnesses while attempting to conceal them. Her journey toward self-acceptance and acceptance from her peers is at the heart of the story. The main character's internal monologue is both hilariously accurate and relatable, especially for readers who understand the challenges of living with disabilities.",
            "The novel skillfully balances its heavier themes with humor, especially through the protagonist's internal monologue. Lines such as \"The autonomic nervous system is three carrier pigeons in a trench coat\" are both amusing and insightful."
        ],
        "conclusion": "This is a heartfelt and humorous coming-of-age story that excels in its authentic representation of disability and its exploration of self-acceptance. While the open-ended conclusion may not satisfy everyone, the novel's strengths in character development and humor make it a standout read.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "143207761-across-the-stars",
        "reviewer_followers": "95 reviews",
        "reviewer_review_nums": "95 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n  The novel features a disabled teen protagonist who is navigating her chronic illnesses while trying to hide them. Her journey toward self-acceptance and peer acceptance is central to the story. The internal monologue of the main character is hilariously accurate and relatable, particularly for readers familiar with the experiences of living with disabilities.  \n\n- **Representation of Disability:**  \n  The depiction of EDS (Ehlers-Danlos Syndrome) and POTS (Postural Orthostatic Tachycardia Syndrome) is some of the best I've ever encountered in fiction. The portrayal feels authentic and insightful, capturing the nuances of living with these conditions.  \n\n- **Plot and Pacing:**  \n  The story is engaging and effectively captures the chaos in the protagonist's life. However, the ending leaves some readers wanting more closure, though I understand it was a deliberate creative choice to leave things open-ended.  \n\n- **Humor and Tone:**  \n  The novel balances its heavier themes with humor, particularly through the protagonist's internal thoughts. Lines like \"The autonomic nervous system is three carrier pigeons in a trench coat\" are both funny and spot-on.  \n\n**Conclusion:**  \nThis is a heartfelt and humorous coming-of-age story that excels in its authentic representation of disability and its exploration of self-acceptance. While the open-ended conclusion may not satisfy everyone, the novel's strengths in character development and humor make it a standout read.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Enjoyment and Engagement"
        ],
        "review": [
            "I appreciate the second-chance romance theme and how Brynn and Oliver's relationship develops, showcasing their emotional depth and growth throughout the story.",
            "This book masterfully balances humor and depth, making it both hilarious and brilliant."
        ],
        "conclusion": "This novel is a brilliant and humorous exploration of living with a chronic illness, specifically EDS syndrome, while also delivering a heartfelt second-chance romance. I appreciated the educational aspect of the story and the emotional evolution of the characters' relationship.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "64953144",
        "reviewer_followers": "7 followers",
        "reviewer_review_nums": "137 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Humor and Tone:** The book is described as \"hilarious but brilliant,\" indicating a balance of humor and depth in its storytelling.  \n- **Representation of Chronic Illness:** The novel \"perfectly captures the struggles of living with a chronic illness, specifically EDS syndrome,\" and the reader mentions learning a great deal about the condition through the protagonist, Brynn.  \n- **Character Development and Relationships:** The reader highlights their love for the \"second chance romance\" and how \"Brynn and Oliver's relationship evolved,\" emphasizing the emotional depth and growth in their dynamic.  \n\n**Conclusion:**  \nThis novel is a brilliant and humorous exploration of living with a chronic illness, specifically EDS syndrome, while also delivering a heartfelt second-chance romance. The reader appreciated the educational aspect of the story and the emotional evolution of the characters' relationship.  \n\n**Rating Scores:**  \n{No specific rating scores mentioned in the review.}"
    },
    {
        "aspects": [
            "Plot and Storyline"
        ],
        "review": [
            "The book felt like a calm, low-stakes contemporary, which left me somewhat unprepared after finishing a more thrilling read. As a result, I found it challenging to stay engaged with the story."
        ],
        "conclusion": "While I appreciated the medical content and the insights into the protagonist's experiences, the book's calm and low-stakes tone didn’t fully resonate with me at the time of reading. However, I see potential in revisiting it in the future.",
        "rating": "2",
        "review_likes": "False",
        "reviewer_id": "103872712-izzys-internet-bookshelf",
        "reviewer_followers": "68 followers",
        "reviewer_review_nums": "1,927 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Engagement with Medical Content:** I really enjoyed the medical parts of the book, such as learning about her experiences and seeing how she dealt with certain situations. This aspect was particularly engaging and informative.\n- **Pacing and Tone:** I felt that the book was a calm, no-high-stakes contemporary, which I wasn’t fully prepared for after finishing a more exciting read. This made it harder for me to stay engaged with the story.\n- **Re-read Potential:** Despite my mixed feelings, I do hope to reread the book in the future, as I believe there is value in revisiting the medical aspects and her experiences.\n\n**Conclusion:**\nWhile I appreciated the medical content and the insights into the protagonist's experiences, the book's calm and low-stakes tone didn’t fully resonate with me at the time of reading. However, I see potential in revisiting it in the future.\n\n**Rating Scores:**\n2.5/5"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Themes"
        ],
        "review": [
            "The story centers on a young girl with a disability who conceals her condition from friends and others, fearing that being open about it will lead to her being treated differently by able-bodied individuals.",
            "The writing in this novel is skillfully executed.",
            "This coming-of-age story follows the main character as she learns to embrace authenticity and open up to her friends and boyfriend."
        ],
        "conclusion": "This novel is well-written and explores the journey of a young girl with a disability as she navigates self-acceptance and relationships. It’s a heartfelt coming-of-age story that emphasizes growth and vulnerability.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "7349419-tara",
        "reviewer_followers": "34 followers",
        "reviewer_review_nums": "884 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Writing Quality:** The writing in this novel is done well.  \n- **Character Development:** We follow a young girl with a disability who initially hides it from her friends and others because she doesn’t want to be treated differently by able-bodied people.  \n- **Themes:** It’s a coming-of-age story where the main character learns to live authentically and opens up to her friends and boyfriend.  \n\n**Conclusion:**  \nThis novel is well-written and explores the journey of a young girl with a disability as she navigates self-acceptance and relationships. It’s a heartfelt coming-of-age story that emphasizes growth and vulnerability.  \n\n**Rating Scores:**  \n{No specific rating scores mentioned in the review.}"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Enjoyment and Engagement"
        ],
        "review": [
            "While the plot may not have been particularly thrilling, it offered a cozy and comforting reading experience.",
            "I appreciated the representation in this book and found the character highly relatable. As someone with a chronic condition, I resonated deeply with many lines, highlighting several that truly spoke to my experience.",
            "I enjoyed the book so much that I plan to read it again, and I've even purchased it in multiple formats."
        ],
        "conclusion": "This was a sweet and heartwarming read with strong representation and relatable characters. While the plot wasn’t action-packed, it was cozy and comforting, making it a book I’ll revisit. The stunning cover and meaningful themes make it a must-read, especially for those who value disability representation in literature.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "164263214-lexi",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "34 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation and Relatability:**  \n  I loved the representation in this book and found the character incredibly relatable. As someone with a chronic condition, I highlighted so many lines that resonated deeply with me.  \n\n- **Plot and Pacing:**  \n  The plot wasn’t hugely exciting, but it was a cozy and comforting read.  \n\n- **Re-readability and Formats:**  \n  I enjoyed the book so much that I absolutely plan to read it again. I even bought it in more than one format.  \n\n- **Cover Design:**  \n  The cover is absolutely gorgeous and adds to the overall appeal of the book.  \n\n- **Support for Disability Representation:**  \n  I highly recommend buying this book to support stories that include disability representation.  \n\n**Conclusion:**  \nThis was a sweet and heartwarming read with strong representation and relatable characters. While the plot wasn’t action-packed, it was cozy and comforting, making it a book I’ll revisit. The stunning cover and meaningful themes make it a must-read, especially for those who value disability representation in literature.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The characters are likable and easy to root for. As someone with hypermobility, I found a deep connection with them, making the story even more relatable and thought-provoking.",
            "Mangle's writing is marked by beautiful turns of phrase that compelled me to highlight numerous passages for future enjoyment.",
            "The story is both compelling and engaging, resulting in a truly captivating read."
        ],
        "conclusion": "This novel is a highly recommended read due to its engaging plot, relatable characters, and exquisite writing style.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "103903329-bethany-perry",
        "reviewer_followers": "22 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**  \n- **Plot and Engagement:**  \n  The story is compelling and engaging, making it a captivating read.  \n\n- **Character Development:**  \n  The characters are likable and easy to root for. As a hypermobile person, I saw a lot of myself in the characters, which made the story even more relatable and thought-provoking.  \n\n- **Writing Style:**  \n  The author, Mangle, writes with beautiful turns of phrase. I found myself highlighting multiple passages so I could revisit and reread them later.  \n\n**Conclusion:**  \nThis novel is a highly recommended read due to its engaging plot, relatable characters, and exquisite writing style.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Themes"
        ],
        "review": [
            "Kwan’s self-doubt, anger, and frustration are vividly portrayed, making her a relatable and compelling character. Her authentic emotional journey resonates deeply, particularly in its depiction of life as a teenager with hEDS. As a former disabled teen, I greatly admire the author's ability to authentically capture the realities of this experience.",
            "The novel skillfully delves into themes of first love, friendship, and family dynamics within an ableist society. These elements are intricately woven into the narrative, enhancing both its depth and relevance."
        ],
        "conclusion": "This novel is a gift of a story, offering an authentic and heartfelt portrayal of the challenges faced by a teenager with hEDS. The writing shines in its ability to capture the emotional complexities of navigating life, love, and relationships in an ableist society.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "99806349-marissa-spear",
        "reviewer_followers": "6 followers",
        "reviewer_review_nums": "84 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Authenticity and Representation:**  \n  Mangle’s portrayal of living as a teenager with hEDS is searingly authentic. As someone who was once a disabled teen, I deeply admire how accurately the author captures the realities of this experience.  \n\n- **Character Development (Kwan):**  \n  Kwan’s self-doubt, anger, and frustration are vividly depicted, making her a relatable and compelling character. Her emotional journey feels genuine and resonates strongly.  \n\n- **Themes and Social Commentary:**  \n  The novel effectively explores themes of first love, friendship, and family relationships within the context of an ableist world. These elements are woven seamlessly into the narrative, adding depth and relevance to the story.  \n\n**Conclusion:**  \nThis novel is a gift of a story, offering an authentic and heartfelt portrayal of the challenges faced by a teenager with hEDS. Mangle’s writing shines in its ability to capture the emotional complexities of navigating life, love, and relationships in an ableist society.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Themes"
        ],
        "review": [
            "The characters Oliver and Brynn are profoundly introspective and emotionally complex. Oliver's remark, \"I could have loved you in sickness or in health, but I can't love a stranger,\" reveals his internal struggle and emotional depth. Meanwhile, Brynn's reflections—\"Everyone says they want the world for their loved ones, but what kind of world? Is a city not a world to someone who never leaves it? How much of a world is a bed? A mind in a broken body?\"—underscore her philosophical nature and her deep contemplation of love, life, and the human condition.",
            "The writing is both poetic and thought-provoking, with each character's dialogue revealing their inner world. The incorporation of rhetorical questions and philosophical musings enriches the narrative, prompting readers to reflect on their own views of love and life.",
            "The novel delves into profound themes of love, identity, and the nature of existence. Oliver grapples with his feelings for a stranger, highlighting how identity shapes relationships. Meanwhile, Brynn reflects on the concepts of the world, confronting the limitations of physical and mental boundaries, which brings forth themes of perception, confinement, and the intricacies of the human experience."
        ],
        "conclusion": "The novel is a deeply moving exploration of love, identity, and the human condition, brought to life through its introspective characters and poetic writing style. It challenges readers to think about the nature of relationships and the world we inhabit, making it a thought-provoking and emotionally resonant read.",
        "rating": "3",
        "review_likes": "5",
        "reviewer_id": "137844555-eve-lyn-reads",
        "reviewer_followers": "17 followers",
        "reviewer_review_nums": "980 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Character Development:**  \n  The characters, Oliver and Brynn, are deeply introspective and emotionally complex. Oliver's statement, \"I could have loved you in sickness or in health, but I can't love a stranger,\" reflects his internal conflict and emotional depth. Brynn's musings, \"Everyone says they want the world for their loved ones, but what kind of world? Is a city not a world to someone who never leaves it? How much of a world is a bed? A mind in a broken body?\" highlight her philosophical nature and the depth of her thoughts about love, life, and the human condition.\n\n- **Themes:**  \n  The novel explores profound themes such as love, identity, and the nature of existence. Oliver's struggle with loving a \"stranger\" delves into the theme of identity and how it affects relationships. Brynn's reflections on the concept of \"world\" and the limitations imposed by physical and mental constraints explore themes of perception, confinement, and the human experience.\n\n- **Writing Style:**  \n  The writing is poetic and thought-provoking, with each character's dialogue offering a window into their inner world. The use of rhetorical questions and philosophical musings adds depth and invites readers to reflect on their own understanding of love and life.\n\n**Conclusion:**  \nThe novel is a deeply moving exploration of love, identity, and the human condition, brought to life through its introspective characters and poetic writing style. It challenges readers to think about the nature of relationships and the world we inhabit, making it a thought-provoking and emotionally resonant read.\n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Themes",
            "Emotional Impact"
        ],
        "review": [
            "The protagonist's internal struggle and growth are poignantly captured in her dialogue with her father: \"It's your choice. At best, they'll love you for only half of who you are; at worst, they'll love you entirely for everything you're not.\"",
            "The story delves into themes of identity, acceptance, and the repercussions of concealing one's true self. The protagonist grapples with a reckoning her father predicted, recalling her plea to avoid the 504 plan for accommodations, hoping to fit in as an ordinary girl at a new school.",
            "The novel elicited strong emotions, as demonstrated by my tears—this one truly moved me."
        ],
        "conclusion": "The novel deeply resonated with the reader, particularly through its emotional depth and exploration of identity and acceptance. The protagonist's journey and the poignant dialogue with her father left a lasting impression.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "3446872-maria",
        "reviewer_followers": "10 followers",
        "reviewer_review_nums": "712 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Emotional Impact:** The novel evoked strong emotions, as evidenced by the reader's reaction: \"I cried my eyes out with this one.\"\n- **Character Development:** The protagonist's internal struggle and growth are highlighted through the dialogue with her father: \"It's your choice. But at most they'll only love you for half of who you are, and at worst they'll love you completely for everything you're not.\"\n- **Themes:** The story explores themes of identity, acceptance, and the consequences of hiding one's true self: \"I can't run away any longer from a reckoning that Dad foresaw when I first begged him not to send in my 504 plan for accommodations, to let me start in a new school as an ordinary girl.\"\n\n**Conclusion:**\nThe novel deeply resonated with the reader, particularly through its emotional depth and exploration of identity and acceptance. The protagonist's journey and the poignant dialogue with her father left a lasting impression.\n\n**Rating Scores:**\n- Emotional Impact: 10/10\n- Character Development: 9/10\n- Themes: 9/10\n\nOverall Rating: 9.5/10"
    },
    {
        "aspects": [
            "Emotional Impact",
            "Enjoyment and Engagement"
        ],
        "review": [
            "This is a book I desperately needed as a chronically ill teen, and I believe it is just as essential for today’s chronically ill teen readers.",
            "This book was phenomenal; I couldn't put it down and stayed up all night to finish it in one sitting."
        ],
        "conclusion": "This novel is an exceptional read that deeply resonated with me, particularly as someone who experienced chronic illness during my teenage years. Its compelling narrative kept me engaged throughout the night, and I believe it holds significant value for readers facing similar challenges. The book’s quality and impact make it a strong contender for prestigious awards like the Schneider Award.",
        "rating": "5",
        "review_likes": "3",
        "reviewer_id": "60334430-lillie-lainoff",
        "reviewer_followers": "261 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**  \n- **Engagement and Enjoyment:**  \n  - The book was absolutely phenomenal. I stayed up all night to finish it in one sitting.  \n- **Relatability and Representation:**  \n  - This is a book I needed as a chronically ill teen, and I believe chronically ill teen readers certainly need it now.  \n- **Award Potential:**  \n  - I could definitely see this as a Schneider Award winner or honoree!  \n\n**Conclusion:**  \nThis novel is an exceptional read that deeply resonated with me, particularly as someone who experienced chronic illness during my teenage years. Its compelling narrative kept me engaged throughout the night, and I believe it holds significant value for readers facing similar challenges. The book’s quality and impact make it a strong contender for prestigious awards like the Schneider Award.  \n\n**Rating Scores:**  \n- Not explicitly mentioned in the review."
    },
    {
        "aspects": [
            "Characters",
            "Emotional Impact",
            "Expectation Fulfillment"
        ],
        "review": [
            "The main character's chronic illness is portrayed with authenticity and depth, revealing not only the physical pain but also the constant obstacles and challenges she endures. This depiction offers a valuable perspective for those of us who are healthy and may struggle to fully understand the complexities of living with a chronic condition.",
            "This story elicits profound empathy for the main character, making her struggles deeply relatable.",
            "This coming-of-age romance novel masterfully blends its genres to create a compelling narrative. It effectively captures the essence of growing up while weaving in the complexities of love, making for a captivating read."
        ],
        "conclusion": "This novel is a heartfelt and insightful coming-of-age romance that skillfully portrays the struggles of living with a chronic illness. It succeeds in evoking empathy and shedding light on the often-overlooked difficulties faced by individuals with such conditions.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "67529471-natalia-hw",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "506 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Emotional Engagement:**  \n  - \"Oh how you feel for her!\"  \n  - The story evokes strong empathy for the main character, making her struggles deeply relatable.  \n\n- **Genre and Theme:**  \n  - \"This was a great coming-of-age romance novel.\"  \n  - The novel effectively combines the coming-of-age and romance genres, creating a compelling narrative.  \n\n- **Characterization and Representation:**  \n  - \"The MC has a chronic disease and it is so hard for us oblivious healthy people to grasp the extent of not the pain (that too) but the constant obstacles and difficulty that this entails.\"  \n  - The portrayal of the main character's chronic illness is both authentic and eye-opening, highlighting not just the physical pain but also the ongoing challenges and barriers she faces.  \n\n**Conclusion:**  \nThis novel is a heartfelt and insightful coming-of-age romance that skillfully portrays the struggles of living with a chronic illness. It succeeds in evoking empathy and shedding light on the often-overlooked difficulties faced by individuals with such conditions.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Writing and Language",
            "Themes",
            "Emotional Impact"
        ],
        "review": [
            "The prose is absolutely stunning.",
            "The exploration of ableism and the fleeting accessibility experienced at the onset of the COVID-19 pandemic is strikingly relatable.",
            "*Conditions of a Heart* has captured my heart unconditionally."
        ],
        "conclusion": "This novel is a must-read, offering a beautifully written and deeply relatable exploration of important themes.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "162989734-chatham-greenfield",
        "reviewer_followers": "70 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**  \n- **Writing Style (Prose):**  \n  The prose is STUNNING.  \n\n- **Themes and Relevance:**  \n  The exploration of ableism and the accessibility that was found—then quickly lost—at the start of the COVID-19 pandemic is painfully relatable.  \n\n- **Emotional Impact:**  \n  The novel owns my heart unconditionally, as reflected in the title *Conditions of a Heart*.  \n\n**Conclusion:**  \nThis novel is a must-read, offering a beautifully written and deeply relatable exploration of important themes.  \n\n**Rating Scores:**  \nNot explicitly mentioned in the review."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes"
        ],
        "review": [
            "Regrettably, I found the book poorly executed, and the ending left me feeling deeply unsatisfied.",
            "I found it hard to connect with Brynn; her character simply didn't resonate with me.",
            "I was captivated by the concept of this book and found the topic highly intriguing."
        ],
        "conclusion": "While the concept and topic of the book were appealing, the execution fell short. The main character, Brynn, didn't connect with me, and the ending was a letdown.",
        "rating": "3",
        "review_likes": "False",
        "reviewer_id": "143702309-m1lener",
        "reviewer_followers": "2 followers",
        "reviewer_review_nums": "77 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Concept and Topic:**  \n  I loved the idea of this book and found the topic intriguing.  \n- **Execution:**  \n  Unfortunately, I think the book was poorly executed.  \n- **Character Development (Brynn):**  \n  I didn't like Brynn too much; her character didn't resonate with me.  \n- **Ending:**  \n  I was deeply disappointed by the ending, which left me unsatisfied.  \n\n**Conclusion:**  \nWhile the concept and topic of the book were appealing, the execution fell short. The main character, Brynn, didn't connect with me, and the ending was a letdown.  \n\n**Rating Scores:**  \nNo specific rating scores mentioned in the review."
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Themes",
            "Emotional Impact"
        ],
        "review": [
            "Brynn’s journey of self-discovery is both poignant and compelling as she navigates her identity and future while living with a chronic illness. The challenges she faces are depicted with a blend of painful realism and beauty. The presence of sapphic secondary characters enriches the narrative, adding depth to the story. This heartfelt own-voices YA novel centers on a Korean American girl grappling with hypermobile EDS, POTS, MCAS, and chronic pain.",
            "This book is witty, humorous, and brimming with sarcasm, making it a captivating read. Each page feels genuine and emotionally resonant.",
            "This story delves into themes of self-love, acceptance, and the challenges of living with chronic illness in a post-COVID world. It addresses both subtle and overt forms of ableism with remarkable depth and impact.",
            "The story is stunning, powerful, and profoundly emotional, leaving a lasting impact."
        ],
        "conclusion": "This novel is a beautifully written and emotionally charged coming-of-age story that tackles chronic illness, ableism, and self-discovery with wit, humor, and heart. Brynn’s journey is both relatable and inspiring, and the inclusion of diverse characters adds depth to the narrative. Highly recommended for its powerful themes and authentic portrayal of life with chronic illness.",
        "rating": "5",
        "review_likes": "2",
        "reviewer_id": "154879595-christinac-reads",
        "reviewer_followers": "69 followers",
        "reviewer_review_nums": "494 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation and Themes:**  \n  - The novel is a heartfelt own voices YA story about a Korean American girl with hypermobile EDS, POTS, MCAS, and chronic pain.  \n  - It explores themes of self-love, acceptance, and navigating life with chronic illness in a post-COVID world.  \n  - The story tackles subtle, overt, and unconscious ableism in a powerful and impactful way.  \n\n- **Character Development:**  \n  - Brynn’s journey of self-discovery is deeply moving as she grapples with her identity and future while living with a chronic illness.  \n  - The challenges she faces and overcomes are portrayed with painful realism and beauty.  \n  - The inclusion of sapphic secondary characters adds depth and richness to the narrative.  \n\n- **Writing Style and Tone:**  \n  - The book is witty, funny, and full of sarcasm, making it an engaging read.  \n  - Every page feels authentic and emotionally resonant.  \n\n- **Emotional Impact:**  \n  - The story is stunning, powerful, and deeply emotional, leaving a lasting impression.  \n\n**Conclusion:**  \nThis novel is a beautifully written and emotionally charged coming-of-age story that tackles chronic illness, ableism, and self-discovery with wit, humor, and heart. Brynn’s journey is both relatable and inspiring, and the inclusion of diverse characters adds depth to the narrative. Highly recommended for its powerful themes and authentic portrayal of life with chronic illness.  \n\n**Rating Scores:**  \n- (+) Highly recommend."
    },
    {
        "aspects": [
            "Characters",
            "Emotional Impact",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The portrayal of chronic illness was both authentic and meaningful, offering a profound sense of validation and connection that I found deeply moving.",
            "This novel had a profound emotional impact on me, making me feel seen and understood in ways I never anticipated. Its representation of chronic illness deeply resonated with my own experiences.",
            "This book single-handedly cured my reading slump. It was engaging and enjoyable, captivating me from start to finish."
        ],
        "conclusion": "This novel was a deeply emotional and engaging read that not only pulled me out of a reading slump but also made me feel seen and understood. The authentic representation of chronic illness was particularly impactful.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "363461-veronica",
        "reviewer_followers": "46 followers",
        "reviewer_review_nums": "614 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Emotional Impact:**  \n  The novel had a profound emotional impact on me. It made me feel seen and understood in ways I didn’t realize I needed. The representation of chronic illness resonated deeply with my personal experiences.  \n\n- **Engagement and Enjoyment:**  \n  The book single-handedly cured my reading slump. It was engaging and enjoyable, pulling me in and keeping me hooked from start to finish.  \n\n- **Representation:**  \n  The portrayal of chronic illness was authentic and meaningful. It provided a sense of validation and connection that I found incredibly moving.  \n\n- **Gratitude and Disclosure:**  \n  I received a gifted copy from the publisher in exchange for an honest review, which I have provided here.  \n\n**Conclusion:**  \nThis novel was a deeply emotional and engaging read that not only pulled me out of a reading slump but also made me feel seen and understood. The authentic representation of chronic illness was particularly impactful.  \n\n**Rating Scores:**  \n4.75 stars"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Themes",
            "Emotional Impact",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The romance is sweet, but as a not-so-fan of second-chance tropes, it didn't fully resonate with me. Much of the relationship's development occurs off-page before the story begins, making it difficult to connect with the characters. However, fans of this trope will likely appreciate it. While the story is emotionally gripping, I found the ending lacking and wished for more time with the characters. The pacing felt rushed, especially regarding Brynn's development.",
            "Brynn’s character development is compelling, though her growth towards the end feels somewhat rushed. I would have preferred more time to fully explore her revelations. Her family is depicted with nuance, showcasing their complexities and adding depth to the story.",
            "The novel is set in a post-COVID world where, although the virus is no longer a threat, the lingering impacts of trauma, loss, and denial persist. The author skillfully navigates this sensitive landscape, crafting a story that profoundly resonates with the emotional weight of the pandemic and its aftermath.",
            "The novel confronts racism and ableism directly, showcasing the intersectionality of Brynn’s experiences as a disabled person of color. The author explores these themes with thoughtfulness and impact.",
            "This book is a powerful exploration of raw emotion, capturing the grief, anger, and exhaustion of the disability community. As a chronically ill and disabled reader, I resonated deeply with Brynn’s experiences of being dismissed, pitied, and accused of faking her illness. Her journey is cathartic, culminating in a tipping point that is both intense and deeply satisfying.",
            "Despite its darker themes, the book is both extremely funny and ultimately hopeful in a gentle, delicate manner. This balance of humor and hope adds depth to the story, giving it the essence of a raw, beating heart disguised as a book."
        ],
        "conclusion": "*Conditions of a Heart* is a powerful, emotionally resonant novel that tackles heavy themes like ableism, racism, and pandemic trauma with grace and authenticity. Brynn’s journey is deeply cathartic, and the book’s raw emotion, humor, and hope make it a memorable read. While I wished for a more developed ending and a stronger connection to the romance subplot, the novel’s strengths far outweigh its minor flaws. It’s a story that will stay with me for a long time.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "74607855-library-of-dreaming-bookstagram",
        "reviewer_followers": "48 followers",
        "reviewer_review_nums": "551 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Setting and Theme:**  \n   - The novel is set in a post-COVID world where COVID is no longer a threat, but the lingering effects of trauma, death, and denial remain.  \n   - The author handles this sensitive setting beautifully, creating a story that resonates deeply with the emotional weight of the pandemic and its aftermath.  \n\n- **Emotional Depth and Representation:**  \n   - The book is filled with raw emotion, particularly reflecting the grief, fury, and exhaustion of the disability community.  \n   - As a chronically ill and disabled reader, I felt Brynn’s emotions intensely, as they mirrored my own experiences of being dismissed, pitied, and accused of faking illness.  \n   - Brynn’s journey is cathartic, and her tipping point is intense, emotional, and deeply satisfying.  \n\n- **Character Development:**  \n   - Brynn’s character development is compelling, though I felt her growth was slightly rushed at the end. I would have appreciated more time to sit with her revelations.  \n   - Brynn’s family is portrayed with nuance, feeling like real people with all their complexities and shades of gray.  \n\n- **Intersectionality and Social Commentary:**  \n   - The novel addresses racism and ableism head-on, highlighting the intersectionality of Brynn’s experiences as a disabled person of color.  \n   - The author’s handling of these themes is thoughtful and impactful.  \n\n- **Romance Subplot:**  \n   - The romance is sweet but didn’t fully resonate with me, as second-chance romance isn’t my favorite trope.  \n   - Much of the romance’s development occurs off-page before the story begins, which made it harder for me to connect with. However, readers who enjoy this trope will likely appreciate it.  \n\n- **Tone and Humor:**  \n   - Despite its darker themes, the book is also extremely funny and ultimately hopeful in a gentle, delicate way.  \n   - The balance of humor and hope adds depth to the story, making it feel like a raw, beating heart disguised as a book.  \n\n- **Pacing and Ending:**  \n   - While the story is emotionally gripping, I wanted a bit more from the ending and more time with the characters.  \n   - The pacing felt slightly rushed toward the conclusion, particularly in Brynn’s development.  \n\n**Conclusion:**  \n*Conditions of a Heart* is a powerful, emotionally resonant novel that tackles heavy themes like ableism, racism, and pandemic trauma with grace and authenticity. Brynn’s journey is deeply cathartic, and the book’s raw emotion, humor, and hope make it a memorable read. While I wished for a more developed ending and a stronger connection to the romance subplot, the novel’s strengths far outweigh its minor flaws. It’s a story that will stay with me for a long time.  \n\n**Rating Scores:**  \n(No specific numerical rating was provided in the review.)  \n\n**Trigger/Content Warnings:**  \nAbleism, racism, injuries/medical content, COVID/pandemic/associated trauma, past suicidal ideation."
    },
    {
        "aspects": [
            "Characters"
        ],
        "review": [
            "I found the relationship between Brynn and her dad, both sharing the same illness, to be particularly touching. Their journey of navigating their condition together felt both heartwarming and authentic. As someone who also shares an illness with my dad, I found this dynamic in the story to be incredibly meaningful."
        ],
        "conclusion": "This novel is a heartfelt and accurate portrayal of living with chronic illness as a teenager, with a special focus on familial relationships. It’s a highly recommended read, especially for those who can relate to or are interested in stories about chronic illness.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "87916839-soren",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "130 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Representation of Chronic Illness:**  \n  The novel provides an accurate and relatable portrayal of navigating chronic illness as a teenager. The depiction felt genuine and resonated deeply with my own experiences, especially as someone with a chronic illness.  \n- **Character Dynamics:**  \n  I particularly appreciated the relationship between Brynn and her dad, who share the same illness. Their journey of navigating their condition together was heartwarming and authentic. As someone who also shares an illness with my dad, seeing this dynamic in a story was incredibly meaningful.  \n- **Appeal to Target Audience:**  \n  This YA novel is a great fit for readers, especially those in chronic illness or disability book clubs. It offers a unique perspective that is both validating and engaging for its intended audience.  \n\n**Conclusion:**  \nThis novel is a heartfelt and accurate portrayal of living with chronic illness as a teenager, with a special focus on familial relationships. It’s a highly recommended read, especially for those who can relate to or are interested in stories about chronic illness.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Themes"
        ],
        "review": [
            "Brynn's journey unfolds at a great pace, with her personal growth and challenges propelling the narrative. The combination of personal struggles, social commentary, and teenage romance creates a dynamic and engaging story.",
            "Brynn Kwan is a spirited and multi-dimensional protagonist whose disability enriches her character. Her experiences with physical pain and the emotional impact of her condition make her both relatable and endearing. Brynn’s intolerance for injustice—be it bullying or racism—often leads her into conflict, highlighting her strong moral compass. Her stubbornness and fiery temperament further enhance her complexity, making her a compelling and well-rounded character.",
            "The story is presented through Brynn's vibrant and humorous lens, making it both engaging and enjoyable. The tone strikes a perfect balance between humor and poignant moments, effectively portraying Brynn's struggles and triumphs.",
            "This novel delves into the challenges of living with a disability, focusing on both physical limitations and societal perceptions. It illustrates how the COVID-19 pandemic momentarily fostered a more inclusive environment for disabled individuals, only to see that progress fade once non-disabled individuals no longer felt at risk. The narrative also touches on themes of family dynamics, friendship, and the complexities of navigating relationships when experiences diverge."
        ],
        "conclusion": "This novel is a vibrant and heartfelt teen romance that shines through its spirited protagonist, Brynn Kwan. Her complex personality, combined with the exploration of disability, societal attitudes, and themes of justice, makes for a deeply engaging read. Brynn’s humor and resilience carry the story beautifully, leaving a lasting impression.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "129643241-christine-benner-dixon",
        "reviewer_followers": "5 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n  - Brynn Kwan is a spirited and complex protagonist whose disability adds depth to her character. Her struggles with physical pain and the emotional toll of her condition make her relatable and endearing.  \n  - Her inability to tolerate injustice, whether it’s bullying or racism, often lands her in trouble, showcasing her strong moral compass.  \n  - Brynn’s stubbornness and temper add layers to her personality, making her a well-rounded and compelling character.  \n\n- **Themes and Social Commentary:**  \n  - The novel explores the challenges of living with a disability, both in terms of physical limitations and societal attitudes.  \n  - It highlights how the COVID-19 pandemic briefly created a more disability-friendly world, but this progress disappeared once non-disabled people no longer felt threatened.  \n  - The story addresses themes of family dynamics, friendship, and the complexities of navigating relationships when one’s experiences differ from others’.  \n\n- **Narrative Style and Tone:**  \n  - The story is delivered through Brynn’s lively and humorous perspective, making it engaging and enjoyable to read.  \n  - The tone balances humor with poignant moments, effectively capturing Brynn’s struggles and triumphs.  \n\n- **Plot and Pacing:**  \n  - Brynn’s journey is well-paced, with her personal growth and challenges driving the narrative forward.  \n  - The blend of personal struggles, social commentary, and teen romance keeps the story dynamic and compelling.  \n\n**Conclusion:**  \nThis novel is a vibrant and heartfelt teen romance that shines through its spirited protagonist, Brynn Kwan. Her complex personality, combined with the exploration of disability, societal attitudes, and themes of justice, makes for a deeply engaging read. Brynn’s humor and resilience carry the story beautifully, leaving a lasting impression.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    }
]