[
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting"
        ],
        "review": [
            "I appreciate the book's emphasis on Asian hate and inclusivity, but I believe the plot and character development could have been stronger. Riley's growth feels rushed, with most of it happening toward the end. Some aspects of the story are frustrating and cringe-worthy, especially Riley's thoughts and actions. Nonetheless, I recognize the book's significance in addressing unintentional forms of Asian hate.",
            "In this story, the protagonist, Riley, faces criticism for her inconsistent behavior. Initially, she distances herself from other Asians to evade stereotypes but eventually joins the Asian Student Association (ASA) at Carlmont. Her limited cultural knowledge and white-washed tendencies contribute to the mixed perceptions of her character. Aerie, portrayed as a loyal and protective friend, comes under scrutiny for her aggressive approach to addressing micro-aggressions. Bodhi is largely disliked due to his racial and gender biases in his treatment of Riley, compounded by his problematic relationship with his father. In contrast, Griff earns praise for his brotherly nature and emphasis on family, making him a standout character. Xander presents a more complex profile, displaying admirable qualities like standing up for Riley, yet exhibiting concerning traits such as a frat-boy attitude and a reluctance to confront Bodhi's comments. Other characters, including Mrs. Morales, Riley's parents, Elise, and Blake, receive mixed reviews regarding their roles and behaviors throughout the story.",
            "I question the author's research and suggest that more recent updates about Bentonville should have been included to enhance accuracy. The depiction of Bentonville as a small town with limited diversity feels outdated and fails to reflect its current reality."
        ],
        "conclusion": "The reader, as a native of Bentonville, Arkansas, finds the book's portrayal of the town and its Asian American community inaccurate and outdated. While the book addresses important themes like Asian hate and inclusivity, the execution of the plot and character development falls short. Riley, the protagonist, is a flawed character with inconsistent behavior, and some supporting characters are either underdeveloped or problematic. Despite these issues, the book succeeds in raising awareness about unintentional forms of Asian hate, making it a worthwhile read despite its flaws.",
        "rating": "2",
        "review_likes": "7",
        "reviewer_id": "170881291-shar",
        "reviewer_followers": "6 reviews",
        "reviewer_review_nums": "6 reviews",
        "reformatted_ori_review": "**Aspects:**\n\n- **Accuracy of Setting Representation:**\n   - Bentonville, Arkansas, is portrayed as smaller and less diverse than it actually is. The reviewer, being from Bentonville, disputes the author's depiction, noting the significant Asian American population and the presence of cultural clubs like the Asian American Pacific Islander Culture Club, Chinese Club, and Indian Student Association.\n   - The reviewer points out that Bentonville is not a rural town and is undergoing significant development, which contradicts the author's portrayal of it as a small, stagnant town.\n   - The mention of \"Bentonville U\" is inaccurate, as there is no such university in Bentonville. The reviewer suggests the author could have used the University of Arkansas instead.\n\n- **Character Development and Representation:**\n   - Riley, the protagonist, is criticized for her inconsistent behavior. She initially distances herself from other Asians to avoid stereotypes but later joins the Asian Student Association (ASA) at Carlmont. Her lack of cultural knowledge and white-washed tendencies are also noted.\n   - Aerie is seen as a loyal and protective friend but is criticized for being overly aggressive in addressing micro-aggressions.\n   - Bodhi is disliked for his treatment of Riley, particularly his racial and gender biases. His relationship with his father is also highlighted as problematic.\n   - Griff is praised for his brotherly nature and his focus on family, making him a favorite character.\n   - Xander is described as a mixed character, with some positive traits (e.g., standing up for Riley) but also red flags, such as his frat-boy demeanor and failure to address Bodhi's comments.\n   - Other characters, like Mrs. Morales, Riley's parents, Elise, and Blake, are briefly mentioned, with mixed feelings about their roles and behaviors.\n\n- **Plot Execution:**\n   - The reviewer appreciates the book's focus on Asian hate and inclusivity but feels the plot and character development could have been executed better.\n   - Riley's character development is seen as rushed, with most of it occurring towards the end of the book.\n   - The reviewer finds some parts of the book frustrating and cringe-worthy, particularly Riley's thoughts and actions, but acknowledges the book's importance in addressing unintentional forms of Asian hate.\n\n- **Research and Authenticity:**\n   - The reviewer questions the author's research, suggesting that more recent updates about Bentonville could have been included to make the setting more accurate.\n   - The author's portrayal of Bentonville as a small town with limited diversity is seen as outdated and not reflective of the current reality.\n\n**Conclusion:**\nThe reviewer, as a native of Bentonville, Arkansas, finds the book's portrayal of the town and its Asian American community inaccurate and outdated. While the book addresses important themes like Asian hate and inclusivity, the execution of the plot and character development falls short. Riley, the protagonist, is a flawed character with inconsistent behavior, and some supporting characters are either underdeveloped or problematic. Despite these issues, the book succeeds in raising awareness about unintentional forms of Asian hate, making it a worthwhile read despite its flaws.\n\n**Rating Scores:**\n- No explicit rating scores are mentioned in the review."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Themes"
        ],
        "review": [
            "The book masterfully maintains its secrets, keeping me engaged as I sought to uncover them alongside the main character, even when the revelations were subtle.",
            "The supporting characters in the story were disappointingly underdeveloped, each defined by a single trait. This lack of depth was particularly frustrating given the large cast. Additionally, the book was marked by an awkwardness that permeated character interactions. Riley often found herself in uncomfortable situations, which, while sometimes fitting for the narrative, felt excessive at times. Overall, the awkwardness detracted from the reading experience.",
            "Some elements, such as Riley's favorite musician Skylar Twist, felt underdeveloped. Skylar, essentially a stand-in for Taylor Swift, is mentioned far less frequently than Swift herself, making her inclusion seem unnecessary. Additionally, the documentary snippets scattered throughout the story were confusing and lacked believability, particularly in how the character obtained footage of people living far away. These smaller details often required a significant suspension of disbelief, which detracted from the overall narrative.",
            "While the book has its flaws, it offers an engaging read with valuable messages about self-advocacy and belonging. As an Asian woman in the music industry, I resonated with the themes of being perceived as \"unmarketable\" and the challenges we face. The author effectively captures the complexities of discrimination and the sacrifices made for opportunities like a record deal."
        ],
        "conclusion": "While the book had notable weaknesses, such as underdeveloped characters, inconsistent details, and overly awkward interactions, it succeeded in keeping me engaged with its secrets and resonated deeply with its themes of identity and perseverance. It was an enjoyable read with meaningful messages, even if it could have been stronger in execution.",
        "rating": "3",
        "review_likes": "4",
        "reviewer_id": "34771341-a-r-hellbender",
        "reviewer_followers": "96 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n   - Every character except for the main character was painfully underdeveloped and flat. Each of them could be defined by one trait, which was disappointing given the number of characters in the story.  \n\n- **World-Building and Detail Consistency:**  \n   - Certain elements, like Riley’s favorite musician Skylar Twist, felt underdeveloped. Skylar is essentially a Taylor Swift equivalent but is mentioned far less than Taylor Swift herself, making the inclusion of Skylar feel unnecessary.  \n   - The documentary snippets throughout the story were confusing in format and lacked believability, especially regarding how the character obtained footage of people who lived far away.  \n   - Smaller details throughout the story required significant suspension of disbelief, which often pulled me out of the narrative.  \n\n- **Character Interactions and Tone:**  \n   - The book was one of the most awkward I’ve ever read. Character interactions were consistently awkward, and Riley was frequently put on the spot or thrown under the bus. While some awkwardness was necessary given the subject matter, it felt excessive at times.  \n\n- **Plot and Pacing:**  \n   - The book excelled at keeping secrets from the reader, which kept me engaged. I wanted to uncover these secrets alongside the main character, even though they weren’t always major revelations.  \n\n- **Themes and Representation:**  \n   - As an Asian woman in music, I deeply related to the themes of not being “marketable” and facing obstacles in the music industry. The book did a great job of portraying the nuances of discrimination and the sacrifices one makes for opportunities like a record deal.  \n\n- **Overall Enjoyment and Message:**  \n   - Despite its flaws, the book was an enjoyable read with important messages about standing up for yourself and finding a sense of belonging.  \n\n**Conclusion:**  \nWhile the book had notable weaknesses, such as underdeveloped characters, inconsistent details, and overly awkward interactions, it succeeded in keeping me engaged with its secrets and resonated deeply with its themes of identity and perseverance. It was an enjoyable read with meaningful messages, even if it could have been stronger in execution.  \n\n**Rating Scores:**  \n3.5 stars."
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "World-Building and Setting",
            "Themes"
        ],
        "review": [
            "Riley, the main character, is the only well-developed character in the story, yet she is not particularly likable. Her maturity seems inconsistent; as a high school senior, she often behaves more like a fifteen-year-old. Her decision to throw a tantrum during a crucial school-wide performance, even though her grievances are valid, ultimately undermines her credibility.",
            "The book opens with a notable typo in the first sentence: \"When you're an Asian Americn...\" While proofreading improves thereafter, this early error casts a negative shadow over the initial impression.",
            "The depiction of Riley's upscale LA boarding school is confusing and lacks coherence. The school's practices, like assigning roommates without prior notification, come off as illogical. Its overarching goal remains unclear, as it seems focused on pushing Riley toward a record deal with a band she did not choose, while failing to provide alternative paths or support for her personal aspirations.",
            "The novel adeptly explores significant themes such as microaggressions, overt racism, and nepotism within the entertainment industry. It commendably and timely confronts anti-Asian racism."
        ],
        "conclusion": "While the book is well-intentioned and tackles important themes like anti-Asian racism and industry nepotism, it falls short in execution. The inconsistent character development, confusing world-building, and lack of narrative depth made it difficult to fully engage with the story. Despite its ambition, the novel didn't resonate with me.",
        "rating": "3",
        "review_likes": "4",
        "reviewer_id": "4089241-liralen",
        "reviewer_followers": "240 followers",
        "reviewer_review_nums": "3,136 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Writing Quality and Proofreading:**  \n   - The book starts poorly with a typo in the first sentence: \"When you're an Asian Americn...\"  \n   - The proofreading improves after the initial mistake, but the poor start left a negative impression.  \n\n- **Themes and Ambition:**  \n   - The novel ambitiously tackles important themes like microaggressions, overt racism, and nepotism in the entertainment industry.  \n   - It directly addresses anti-Asian racism, which is commendable and timely.  \n\n- **Character Development:**  \n   - Riley, the main character, is the only fully fleshed-out character, but she is not particularly likable.  \n   - Her maturity level feels inconsistent; as a high school senior, she often acts more like a fifteen-year-old.  \n   - Her decision to throw a tantrum during a critical school-wide performance, despite being right about her grievances, undermines her credibility.  \n\n- **World-Building and Setting:**  \n   - The portrayal of Riley's fancy LA boarding school is confusing and lacks coherence.  \n   - The school's practices, such as assigning rooms without informing students of their roommates, seem illogical.  \n   - The school's overarching goal is unclear, and it appears to prioritize pushing Riley toward a record deal with a band she didn't choose, without offering alternative paths or support for her personal aspirations.  \n\n- **Narrative Focus and Depth:**  \n   - The book frames Riley's struggles primarily as a result of racism, particularly her role in propping up white students' careers.  \n   - However, it fails to address broader systemic issues within the school, leaving the narrative feeling incomplete and one-dimensional.  \n\n**Conclusion:**  \nWhile the book is well-intentioned and tackles important themes like anti-Asian racism and industry nepotism, it falls short in execution. The inconsistent character development, confusing world-building, and lack of narrative depth made it difficult to fully engage with the story. Despite its ambition, the novel didn't resonate with me.  \n\n**Rating Scores:**  \n(No explicit rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "World-Building and Setting",
            "Enjoyment and Engagement",
            "Expectation Fulfillment"
        ],
        "review": [
            "I really liked Riley; she was funny, genuine, and relatable, especially as a fellow musician. I did feel some second-hand embarrassment for her during the spring concert, which affected my admiration slightly, but she remained a cool character. I also enjoyed Griff—he had a wonderfully laid-back vibe.",
            "The book takes a distinctly liberal approach, particularly addressing Asian racism. However, I found the political themes somewhat heavy-handed. Additionally, the emphasis on pronouns felt excessive and unnecessary to me.",
            "Despite its flaws, I genuinely enjoyed the book. However, I believe its appeal primarily resonates with Asians and musicians. Every time the song \"Stardust\" was mentioned, I couldn't help but think of Fall Out Boy's \"So Much (For) Stardust.\" Is that just me?",
            "I appreciated that this coming-of-age novel steers clear of being a typical romance. Although there is some romance between Riley and Xander, it’s handled well and doesn’t overshadow the story. While I didn’t find myself particularly invested in Xander, he wasn’t annoying, which made their interactions more enjoyable."
        ],
        "conclusion": "Overall, I found the book enjoyable, particularly for its relatable characters and insights into the music industry. However, the heavy-handed political themes, inaccuracies in music representation, and discrepancies between the cover/description and the actual content were drawbacks. The book’s appeal seems niche, likely resonating more with Asians or musicians.",
        "rating": "4",
        "review_likes": "2",
        "reviewer_id": "168387899-wren-chatterji",
        "reviewer_followers": "9 followers",
        "reviewer_review_nums": "44 reviews",
        "reformatted_ori_review": "**Aspects:**\n\n- **Relatability and Character Development:**\n   - I personally liked Riley a lot. She was funny, real, and low-key relatable, especially as another musician. Though I did feel some second-hand embarrassment for her during the spring concert, which made me like her a bit less, but she was still pretty cool.\n   - I also really liked Griff. He was really chill.\n\n- **Genre and Themes:**\n   - I appreciated that it’s a coming-of-age novel without being a romance novel. While there was some romance, the romance between Riley and Xander wasn’t obnoxious or badly done. I didn’t really care too much about him, but he wasn’t annoying or anything.\n\n- **Music Industry Representation:**\n   - As an aspiring musician, I found the book interesting, especially when it talked about the music industry. The band T-shirt stuff and the story behind it were cool.\n   - However, there were some inaccuracies. Riley said she played acoustic guitar, but the concert shows her playing electric. The description said she played indie rock, but the book says more indie pop. As a rock music fan, I was confused when she listed OneRepublic and Imagine Dragons as influences. Unless you consider them rock, which I don’t.\n\n- **Cultural and Political Themes:**\n   - The book was pretty liberal. I get that part of the point is about Asian racism, but I felt the politics were a bit heavy-handed. The pronoun mentions and stuff weren’t really necessary, in my opinion.\n\n- **Cover and Description Accuracy:**\n   - The cover and description weren’t very accurate. Riley’s instrument and genre were misrepresented, which was a bit disappointing.\n\n- **Creative Choices:**\n   - I found it odd that the author made up a fictional artist, Skylar Twist, when Taylor Swift is mentioned multiple times. It felt unnecessary.\n\n- **Personal Enjoyment and Target Audience:**\n   - Despite the issues, I personally really enjoyed the book. However, I think the appeal is mostly for either Asians or musicians.\n   - I kept thinking of Fall Out Boy’s song \"So much (For) Stardust\" whenever the song Stardust was mentioned. Just me? Okay...\n\n**Conclusion:**\nOverall, I found the book enjoyable, particularly for its relatable characters and insights into the music industry. However, the heavy-handed political themes, inaccuracies in music representation, and discrepancies between the cover/description and the actual content were drawbacks. The book’s appeal seems niche, likely resonating more with Asians or musicians.\n\n**Rating Scores:**\n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Themes"
        ],
        "review": [
            "Despite being white, I still saw reflections of myself in Riley.",
            "The book focuses extensively on racial microaggressions and the challenges of confronting racism."
        ],
        "conclusion": "This novel is a thought-provoking and impactful read, particularly for those open to engaging with its themes of racial microaggressions and racism. Despite differences in background, the protagonist Riley felt relatable, making the story even more compelling.",
        "rating": "5",
        "review_likes": "2",
        "reviewer_id": "29223648-steph-carr-literaryhypewoman",
        "reviewer_followers": "32 followers",
        "reviewer_review_nums": "586 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Relatability of Characters:**  \n  Even though I'm white as can be, I still found aspects of myself in Riley.  \n- **Themes and Subject Matter:**  \n  The book heavily hinges on racial microaggressions and handling racism.  \n- **Reader Suitability:**  \n  If you aren't willing to think about the topic of racism, do everyone a favor and skip it. However, if you can handle it, this is a great read.  \n\n**Conclusion:**  \nThis novel is a thought-provoking and impactful read, particularly for those open to engaging with its themes of racial microaggressions and racism. Despite differences in background, the protagonist Riley felt relatable, making the story even more compelling.  \n\n**Rating Scores:**  \n4.5 stars"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language"
        ],
        "review": [
            "The story is told from the perspective of a determined young girl seeking her voice, lending the narrative a sense of authenticity and impact. I felt truly seen and understood as a reader, making the experience both meaningful and joyful.",
            "This novel is a captivating coming-of-age story centered on an Asian-American girl exploring her cultural identity while joining a band at a performing arts school. The author skillfully captures the nuances of the Asian-American experience, moving beyond clichés like \"the lunchbox moment\" or the question, \"where are you from?\" It thoughtfully examines the damaging effects of microaggressions, the silencing impact of the model minority myth, and the challenges of white privilege in the music industry, while also celebrating the diversity within the Asian-American community. Additionally, the book highlights biases that exist within the Asian community, offering important and eye-opening insights.",
            "My primary critique is the excessive use of quirky Gen-Z slang in the first half of the novel. Phrases like \"hashtag,\" \"nom,\" and \"I’m LOL-ing\" felt forced and detracted from the reading experience. This overreliance on trending social media references can come across as cringy and inauthentic. I wish authors would recognize that they don't need to rely on such language to connect with younger audiences."
        ],
        "conclusion": "*Not Your Average Jo* is a powerful and authentic coming-of-age novel that beautifully explores the complexities of the Asian-American experience. While the excessive use of Gen-Z slang in the first half was a drawback, the book’s impactful narrative and cultural depth made it a deeply resonant and enjoyable read.",
        "rating": "4",
        "review_likes": "2",
        "reviewer_id": "136241465-loryn-taylor-s-version",
        "reviewer_followers": "178 followers",
        "reviewer_review_nums": "154 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation and Cultural Identity:**  \n   - The novel is a wonderful coming-of-age story about an Asian-American girl navigating her cultural identity while joining a band at a performing arts school.  \n   - The author does an incredible job of portraying the complexities of the Asian-American experience, going beyond surface-level stereotypes like the \"lunchbox\" moment or \"where are you from?\" comments.  \n   - It delves into the destructive nature of microaggressions, the silencing effect of the model minority myth, white privilege in the music industry, and the diversity within the Asian-American identity.  \n   - The book also addresses biases within the Asian community itself, which is both important and eye-opening.  \n\n- **Narrative Perspective and Authenticity:**  \n   - The story is narrated through the perspective of a headstrong young girl trying to find her voice, which makes the book feel impactful and authentic.  \n   - As a reader, I felt deeply seen and understood, which made the experience incredibly meaningful and joyful.  \n\n- **Writing Style and Dialogue:**  \n   - My main critique is the excessive use of \"quirky Gen-Z slang\" in the first half of the novel. Phrases like \"hashtag,\" \"Nom,\" or \"I’m LOL-ing\" felt unnatural and unnecessary.  \n   - This overuse of trending social media references and slang came off as forced and cringy, detracting from the overall reading experience.  \n   - I wish authors would realize that using such language isn’t necessary to connect with younger audiences, as it often feels inauthentic.  \n\n- **Overall Enjoyment:**  \n   - Despite the issue with the slang, the book was great and left a strong impression.  \n\n**Conclusion:**  \n*Not Your Average Jo* is a powerful and authentic coming-of-age novel that beautifully explores the complexities of the Asian-American experience. While the excessive use of Gen-Z slang in the first half was a drawback, the book’s impactful narrative and cultural depth made it a deeply resonant and enjoyable read.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting"
        ],
        "review": [
            "*Not Your Average Jo* is a compelling coming-of-age story centered on Riley Jo, a Korean American from Arkansas who relocates to Los Angeles to attend a prestigious performing arts school. The novel delves into themes of cultural identity, racism, and the challenges of the music industry, particularly the issues of nepotism and appearance. Riley Jo's journey is marked by her struggle with her cultural identity, as she grapples with feelings of inadequacy—feeling neither Korean enough, American enough, nor fully Korean-American.",
            "Riley Jo is a relatable and well-developed protagonist whose journey of self-discovery reveals the diverse experiences of being Korean American. The supporting characters, including band members and music industry figures, enrich the narrative and underscore the challenges of systemic inequality.",
            "This story effectively contrasts Riley Jo's experiences in Arkansas and LA, illuminating the various forms of racism and microaggressions she encounters. The portrayal of the music industry is particularly eye-opening, revealing its lack of diversity and the challenges faced by those without privilege or connections. The novel adeptly addresses cultural appropriation and the complexities of being a Korean American in predominantly white spaces, emphasizing that cultural identity is multifaceted and that there is no singular way to embody it."
        ],
        "conclusion": "*Not Your Average Jo* is a compelling and thought-provoking coming-of-age novel that tackles important themes of identity, racism, and the music industry. Riley Jo's journey is both relatable and inspiring, and the audiobook narration adds an extra layer of depth to the story. While the print version could benefit from some adjustments to improve the flow of documentary segments, the overall experience is highly enjoyable and impactful.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "93528607-becky-bookmarked-by-becky",
        "reviewer_followers": "26 followers",
        "reviewer_review_nums": "636 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Plot and Themes:**  \n   - *Not Your Average Jo* is a terrific coming-of-age story about Riley Jo, a Korean American from Arkansas, who moves to LA to attend a prestigious performing arts school.  \n   - The novel explores themes of cultural identity, racism, and the challenges of navigating the music industry, particularly the prevalence of nepotism and the \"right look.\"  \n   - Riley Jo's struggle with her cultural identity is a central theme, as she grapples with feeling \"not Korean enough, not American enough, not Korean-American enough.\"  \n\n- **Character Development:**  \n   - Riley Jo is a relatable and well-developed protagonist. Her journey of self-discovery and eventual realization that there are diverse ways to be Korean American is compelling.  \n   - The supporting characters, including the band members and those in the music industry, add depth to the story and highlight the challenges of systemic inequality.  \n\n- **Setting and World-Building:**  \n   - The contrast between Riley Jo's experiences in Arkansas and LA effectively highlights the different forms of racism and microaggressions she faces.  \n   - The portrayal of the music industry is eye-opening, shedding light on its lack of diversity and the barriers faced by those without privilege or connections.  \n\n- **Narration and Audiobook Experience:**  \n   - Shannon Tyo's narration is exceptional, with distinct voices for each character and emotional depth that captures Riley Jo's struggles.  \n   - The documentary segments in the audiobook are engaging, though they feel slightly disjointed in the print version. Incorporating illustrations might improve the flow in print.  \n\n- **Cultural Representation:**  \n   - The novel does an excellent job of addressing cultural appropriation and the complexities of being a Korean American in predominantly white spaces.  \n   - It emphasizes the diversity within diversity, showcasing that there is no single way to embody a cultural identity.  \n\n**Conclusion:**  \n*Not Your Average Jo* is a compelling and thought-provoking coming-of-age novel that tackles important themes of identity, racism, and the music industry. Riley Jo's journey is both relatable and inspiring, and the audiobook narration adds an extra layer of depth to the story. While the print version could benefit from some adjustments to improve the flow of documentary segments, the overall experience is highly enjoyable and impactful.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Writing and Language",
            "World-Building and Setting",
            "Expectation Fulfillment"
        ],
        "review": [
            "This novel is a poignant coming-of-age tale centered on a Korean American teenager with dreams of becoming a singer-songwriter. It delves into the struggle between following one's passions and conforming to the whitewashed expectations of the music industry. Additionally, it tackles the pressing issues of post-pandemic anti-Asian racism and microaggressions, enriching the narrative with depth and relevance.",
            "The book translates beautifully to audio format, providing an engaging experience for listeners.",
            "Set against the vibrant backdrop of Los Angeles, this book captures the protagonist's journey and the challenges faced within the music industry.",
            "This novel is ideal for fans of Axie Oh and Kelly Yang, as it echoes their themes and storytelling styles beautifully."
        ],
        "conclusion": "This is a compelling and emotionally resonant YA novel that tackles important themes of identity, ambition, and systemic challenges in the music industry. It’s a great choice for readers who enjoy stories about self-discovery and cultural representation.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "6021548-shannon",
        "reviewer_followers": "371 followers",
        "reviewer_review_nums": "6,660 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Plot and Themes:**  \n  The novel is a heartfelt coming-of-age story about a Korean American teenager aspiring to become a singer/songwriter. It explores the complex conflict between pursuing one's dreams and conforming to the white-washed music industry's expectations of what \"sells.\" The story also addresses post-pandemic anti-Asian racism and microaggressions, adding depth and relevance to the narrative.  \n\n- **Setting:**  \n  The book is set in Los Angeles, which provides a vibrant backdrop for the protagonist's journey and the challenges they face in the music industry.  \n\n- **Writing Style and Format:**  \n  The book is well-suited for audio format, making it an engaging experience for listeners.  \n\n- **Target Audience and Comparisons:**  \n  This novel is perfect for fans of authors like Axie Oh or Kelly Yang, as it resonates with similar themes and storytelling styles.  \n\n**Conclusion:**  \nThis is a compelling and emotionally resonant YA novel that tackles important themes of identity, ambition, and systemic challenges in the music industry. It’s a great choice for readers who enjoy stories about self-discovery and cultural representation.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The main character struggles with self-hatred, particularly concerning her minority identity, which can be frustrating and difficult to relate to. Her refusal to befriend the new kid simply because they share an Asian background feels contrived, as it seems more about avoiding stereotypes than genuine character development. Additionally, her enrollment in a music school despite having no knowledge of music creates a disconnect with the setting. Her arrogance in dismissing K-Pop, even when unrelated questions arise, appears illogical and unnecessary.",
            "The protagonist's actions and mindset hindered my engagement with the story. Her choices and attitudes came across as alienating rather than relatable or compelling."
        ],
        "conclusion": "The novel's main character, with her self-hating tendencies and inconsistent behavior, made it challenging to continue reading. Her actions, such as avoiding friendships based on stereotypes and her illogical arrogance about music, detracted from the story's potential. As a result, I decided to stop reading at 23%.",
        "rating": "1",
        "review_likes": "1",
        "reviewer_id": "148536420-danielle-nichole",
        "reviewer_followers": "1,033 reviews",
        "reviewer_review_nums": "1,033 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n  - The main character (MC) is portrayed as self-hating, particularly regarding her identity as a minority. This aspect is frustrating and hard to connect with.  \n  - Her behavior, such as refusing to befriend the new kid solely because they are both Asian, feels forced and rooted in avoiding stereotypes rather than genuine character motivation.  \n\n- **Character Consistency and Logic:**  \n  - The MC attends a music school but knows nothing about music, which feels inconsistent with the setting.  \n  - Her arrogance about disliking KPop, despite being asked unrelated questions, comes across as illogical and unnecessary.  \n\n- **Engagement and Relatability:**  \n  - The MC's actions and mindset made it difficult to stay engaged with the story.  \n  - Her choices and attitudes felt alienating rather than relatable or compelling.  \n\n**Conclusion:**  \nThe novel's main character, with her self-hating tendencies and inconsistent behavior, made it challenging to continue reading. Her actions, such as avoiding friendships based on stereotypes and her illogical arrogance about music, detracted from the story's potential. As a result, I decided to stop reading at 23%.  \n\n**Rating Scores:**  \nDNF (Did Not Finish) at 23%."
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Themes"
        ],
        "review": [
            "Elise stood out as the most compelling character in the story.",
            "This story feels reminiscent of something you'd find on Wattpad, and I was surprised to spot a typo on the very first page.",
            "This book was overly focused on political themes, which detracted from my enjoyment. While the premise was intriguing, the excessive political commentary ultimately overshadowed the story. A more balanced approach would have significantly improved the reading experience."
        ],
        "conclusion": "The novel had a promising concept but was overshadowed by excessive political commentary, which detracted from the story. The writing quality felt amateurish, and the presence of a typo on the first page was disappointing. While Elise stood out as a strong character, the overall execution left much to be desired, making it a frustrating read.",
        "rating": "1",
        "review_likes": "1",
        "reviewer_id": "162158581-amelie",
        "reviewer_followers": "6 followers",
        "reviewer_review_nums": "215 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Writing Quality:**  \n  - \"Read like something off of Wattpad.\"  \n  - \"Why is there a typo on the first page????\"  \n\n- **Themes and Content:**  \n  - \"This book was so woke that it ruined it for me.\"  \n  - \"The author added so much unnecessary political yap that it was just awful.\"  \n\n- **Plot and Concept:**  \n  - \"It was a good idea but needed to be less political.\"  \n\n- **Characters:**  \n  - \"Elise was the best character.\"  \n\n- **Overall Enjoyment:**  \n  - \"Can't. Almost dnf'ed it.\"  \n  - \"Soo anyways this book sucked.\"  \n\n**Conclusion:**  \nThe novel had a promising concept but was overshadowed by excessive political commentary, which detracted from the story. The writing quality felt amateurish, and the presence of a typo on the first page was disappointing. While Elise stood out as a strong character, the overall execution left much to be desired, making it a frustrating read.  \n\n**Rating Scores:**  \n1.75 stars 🌟"
    },
    {
        "aspects": [
            "Characters",
            "Themes",
            "Expectation Fulfillment"
        ],
        "review": [
            "The characters in the story are authentic and relatable, particularly the compelling protagonist, Riley Jo. The ending is satisfying, showcasing growth in some characters while leaving others unchanged, echoing the complexities of real life. Although the novel centers on the Asian American experience, its themes resonate with other minorities and women. Riley’s interactions with her Korean American roommate’s parents reveal unexpected prejudices, adding depth to the narrative.",
            "The novel offers surprising depth as it examines identity and the nuances of diversity. It thoughtfully navigates the balance between honoring cultural heritage and recognizing good intentions. Additional themes include the cost of self-respect, the influence of nepotism and class privilege on success, and the complexities of straddling both Korean and American identities.",
            "The romantic subplot was subtle and never overshadowed the main narrative. Riley's journey eschewed a fairy-tale rise to fame, enhancing the story's authenticity."
        ],
        "conclusion": "This contemporary YA novel offers a rich exploration of identity, prejudice, and the complexities of the Asian American experience. With relatable characters, thought-provoking themes, and a satisfying yet realistic ending, it’s a highly recommended read. The audiobook narration by Shannon Tyo further elevates the experience.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "1758756-bethfishreads",
        "reviewer_followers": "58 followers",
        "reviewer_review_nums": "602 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Themes and Depth:**  \n   - The novel explores surprising depth, focusing on micro- and macro-aggressions against Asian Americans.  \n   - It delves into questions about identity, diversity within diversity, and the balance between respecting culture and acknowledging good intentions.  \n   - Other themes include the cost of self-respect, the role of nepotism and class advantage in success, and the complexities of being both \"too Korean\" and \"too American.\"  \n\n- **Character Development:**  \n   - The characters felt real and relatable, with Riley Jo being a particularly compelling protagonist.  \n   - The ending was satisfying, as it showed growth in some characters but not all, reflecting real-life complexities.  \n\n- **Romantic Elements:**  \n   - The romantic subplot was low-key and didn’t overshadow the main narrative.  \n   - Riley’s journey didn’t follow a fairy-tale rise to fame, which added to the story’s authenticity.  \n\n- **Representation and Relatability:**  \n   - While the novel focuses on the Asian American experience, its themes resonate with other minorities and women.  \n   - Riley’s interactions with her Korean American roommate’s parents highlighted unexpected prejudices, adding layers to the narrative.  \n\n- **Audiobook Performance:**  \n   - Shannon Tyo’s narration was expressive and captured the characters’ personalities effectively.  \n   - Her accents were respectful and realistic, enhancing the listening experience.  \n\n- **Bookmark-Worthy Moments:**  \n   - The novel prompted the use of the bookmark feature three times due to thought-provoking questions raised by Riley.  \n\n- **Minor Critique:**  \n   - A small inconsistency was noted: Riley plays acoustic guitar, but the book cover depicts her with an electric guitar.  \n\n**Conclusion:**  \nThis contemporary YA novel offers a rich exploration of identity, prejudice, and the complexities of the Asian American experience. With relatable characters, thought-provoking themes, and a satisfying yet realistic ending, it’s a highly recommended read. The audiobook narration by Shannon Tyo further elevates the experience.  \n\n**Rating Scores:**  \n- No specific numerical rating was provided, but the reviewer expressed high praise and strong recommendation for the novel."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes"
        ],
        "review": [
            "The plot felt disjointed and lacked cohesion, leaving me wishing for a smoother and more detailed progression.",
            "The main character lacked development, and the story missed opportunities to better explore their growth.",
            "I thoroughly enjoyed Riley's journey and the exploration of the tension between being an \"activist\" and prioritizing personal well-being. As a member of a minority group in America, I found this theme particularly relatable and appreciated the author's skillful portrayal of it. This is a topic I haven't encountered in other books, and I commend the author for addressing it so effectively."
        ],
        "conclusion": "While the book had its strengths, particularly in its exploration of relatable themes and Riley’s journey, it lacked development in both character and plot flow. The choppy narrative and underdeveloped elements made it an okay read, but not a standout one.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "26074008-basma",
        "reviewer_followers": "149 followers",
        "reviewer_review_nums": "221 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n   - The main character lacked development, and I felt the story could have done more to flesh out their growth.  \n\n- **Plot Flow:**  \n   - The plot felt choppy and could have been more cohesive. I wished for a smoother and more detailed progression.  \n\n- **Themes and Representation:**  \n   - I really enjoyed Riley’s journey and the exploration of the struggle between being an “activist” versus focusing on personal well-being.  \n   - As a member of a minority group in America, I found this theme relatable and appreciated how well the author captured it.  \n   - It’s a topic I haven’t seen addressed in books before, and I commend the author for tackling it effectively.  \n\n- **Overall Enjoyment:**  \n   - The book was okay, but it fell short in some areas, leaving me wanting more depth and polish.  \n\n**Conclusion:**  \nWhile the book had its strengths, particularly in its exploration of relatable themes and Riley’s journey, it lacked development in both character and plot flow. The choppy narrative and underdeveloped elements made it an okay read, but not a standout one.  \n\n**Rating Scores:**  \n- Actual rating: 3.5"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Themes"
        ],
        "review": [
            "The story centers on Riley Jo, a 17-year-old Korean American girl eager to pursue a music career and escape her hometown of Bentonville. She strikes a deal with her mother to attend Clarmont for her senior year in exchange for committing to Bentonville University for four years. The central themes of hard work, determination, and the pursuit of dreams resonated deeply with me. Additionally, the book tackles the sensitive issue of racism, which, while significant, occasionally overshadowed the main narrative.",
            "Riley, Elise, and Aerie are distinct and well-crafted characters. Riley's dedication is truly inspiring, Elise's quirky personality brings a delightful energy, and Aerie adds depth to the narrative. The themes of self-advocacy and the quest for belonging are both vital and uplifting.",
            "The book is rich with Gen-Z references that resonate with its young adult audience; however, their abundance may come off as excessive and would benefit from a more balanced approach.",
            "This book offers valuable insights and practical tips about the music industry, making it an informative read."
        ],
        "conclusion": "Overall, *Not Your Average Jo* is an inspiring and informative read, particularly for aspiring music artists. The characters and their journeys leave a lasting impression, and the book's messages about hard work and self-belief are impactful. While the focus on racism is important, it occasionally overshadows the main theme. The Gen-Z references, though relevant, could have been more balanced. I recommend this book to young adults who enjoy stories about perseverance and self-discovery.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "137082124-paige-v",
        "reviewer_followers": "2 followers",
        "reviewer_review_nums": "283 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Plot and Themes:**\n   - The story follows Riley Jo, a 17-year-old Korean American girl, who is determined to pursue a career in music and leave her hometown of Bentonville behind. She makes a deal with her mom to attend Clarmont for her senior year in exchange for attending Bentonville University for four years.\n   - The central theme revolves around hard work, determination, and achieving one's dreams, which resonated deeply with me.\n   - The book also addresses the sensitive issue of racism, which, while important, sometimes felt like it detracted from the main storyline.\n\n- **Characters:**\n   - Riley, Elise, and Aerie are well-developed and unique characters. Riley's hardworking nature is inspiring, Elise's quirky personality adds a fun element, and Aerie's presence contributes to the story's depth.\n   - The messages of standing up for yourself and finding a sense of belonging are crucial and inspiring.\n\n- **Writing Style and References:**\n   - The book includes many Gen-Z references, which, while fitting for a young adult audience, felt excessive and could have been more balanced.\n\n- **Educational Value:**\n   - The book provides valuable insights and tips about the music industry, which I found helpful and informative.\n\n**Conclusion:**\nOverall, *Not Your Average Jo* is an inspiring and informative read, particularly for aspiring music artists. The characters and their journeys leave a lasting impression, and the book's messages about hard work and self-belief are impactful. While the focus on racism is important, it occasionally overshadows the main theme. The Gen-Z references, though relevant, could have been more balanced. I recommend this book to young adults who enjoy stories about perseverance and self-discovery.\n\n**Rating Scores:**\n- No specific rating scores were mentioned in the review. \n\nHappy Reading, Paige ❤️ 📚  \nThank you to the publisher for sending me a copy of this book. I am leaving this review voluntarily."
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "World-Building and Setting",
            "Themes",
            "Emotional Impact"
        ],
        "review": [
            "Riley's journey as a passionate underdog, learning to speak up and embrace honesty, is truly inspiring. Elise's character and the incorporation of Korean-American culture enrich the narrative. Bodhi's humorous struggle with his own insecurities is both relatable and entertaining. The dynamics between Jake and Jeremy are compelling, and their eventual rejection feels appropriate.",
            "The author demonstrates impressive skill in this novel, which beautifully blends the emotional depth and stylistic elements reminiscent of writers like Maurene Goo, Katie Cotugno, Marie Arnold, and Elise Bryant.",
            "The book seamlessly blends Korean and American cultures, creating a style that feels both authentic and meaningful.",
            "This book explores the intricate issues of racism, discrimination, and the importance of self-advocacy. It resonates deeply with the challenges of navigating systems like the music industry, mirroring my own experiences in writing. A particularly striking quote encapsulates these themes: \"It's not that we're being silent. It's that we're being silenced. There's a big difference. We want to say the things that matter, but we don't feel like we can.\"",
            "Riley's journey concludes satisfyingly, leaving me cheering for her. The book is both thought-provoking and meaningful, making a lasting impression."
        ],
        "conclusion": "The novel is a powerful exploration of racism, discrimination, and self-advocacy, told through relatable characters and rich cultural representation. Riley's journey is inspiring, and the themes resonate deeply, making this a thoughtful and impactful read.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "121296338-megan-earlene",
        "reviewer_followers": "4 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**  \n- **Author's Skill and Writing Style:**  \n   - Grace K. Shim is a talented writer.  \n   - The novel captures a great crossroads between the feels and style of authors like Maurene Goo, Katie Cotugno, Marie Arnold, and Elise Bryant.  \n\n- **Themes and Social Commentary:**  \n   - The book depicts the complexities of racism, discrimination, and standing up for oneself.  \n   - It resonates with the struggles of navigating systems, such as the music industry, which parallels the challenges in my own field of writing.  \n   - The quote, \"It's not that we're being silent. It's that we're being silenced. There's a big difference. We want to say the things that matter, but we don't feel like we can,\" stands out as a powerful reflection of the themes.  \n\n- **Character Development and Relatability:**  \n   - Riley is a passionate underdog, and her journey of speaking up and being honest is inspiring.  \n   - Elise and the inclusion of Korean-American culture add depth and richness to the story.  \n   - Bodhi's insecurity about being insecure is both funny and relatable.  \n   - The dynamics between Jake and Jeremy are intriguing, and their rejection feels fitting.  \n\n- **Cultural Representation:**  \n   - The book is 100% Korean AND American, striking a balance that feels authentic and meaningful.  \n\n- **Emotional Impact and Resolution:**  \n   - Riley's journey resolves satisfactorily, leaving me cheering for her.  \n   - The book is thoughtful, thought-provoking, and meaningful, leaving a lasting impression.  \n\n**Conclusion:**  \nGrace K. Shim's novel is a powerful exploration of racism, discrimination, and self-advocacy, told through relatable characters and rich cultural representation. Riley's journey is inspiring, and the themes resonate deeply, making this a thoughtful and impactful read.  \n\n**Rating Scores:**  \n- Overall: 5/5 (implied by the enthusiastic tone and praise throughout the review)."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The novel follows Riley Jo, a Korean American teenager aspiring to be a musician as she navigates the challenges of a prestigious arts boarding school in Los Angeles. Facing discrimination from her bandmates, who deem her “too Asian” to be the lead singer, Riley is overlooked in favor of her classmate, Bodhi. Despite the setbacks, she perseveres and takes control of her destiny by writing an original song. The story delves into themes of microaggressions, racial bias, and nepotism, highlighting the importance of authenticity. Ultimately, it culminates in Riley finding the courage to shine on her own terms at the spring concert.",
            "Riley Jo is a relatable and determined protagonist, navigating the challenges of being a Korean American teenager in both the music industry and high school. The supporting characters, including her bandmates and a student filmmaker, enrich the narrative and underscore the complexities of adolescence.",
            "The narrative is relatable and thought-provoking, revealing the challenges of adolescence. While the use of Gen Z lingo was initially overwhelming, it became less prominent as the story unfolded.",
            "This novel is a captivating read, featuring relatable characters and an engaging plot that will resonate with young teens in search of a meaningful and inspiring story."
        ],
        "conclusion": "“Not Your Average Jo” by Grace K Shim is a compelling and thought-provoking novel that explores themes of identity, perseverance, and authenticity through the eyes of a determined Korean American teenager. With its relatable characters and engaging plot, the story is both inspiring and resonant, making it a must-read for young teens.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "6773598-paige-paiges-on-pages",
        "reviewer_followers": "13 followers",
        "reviewer_review_nums": "162 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Plot and Themes:**  \n   - The novel follows Riley Jo, a Korean American teenager with dreams of becoming a musician, as she navigates the challenges of a prestigious arts boarding school in Los Angeles.  \n   - Riley faces discrimination from her bandmates, who believe she is “too Asian” to be the lead singer, and is sidelined in favor of her classmate Bodhi.  \n   - Despite setbacks, Riley refuses to give up and takes matters into her own hands by writing an original song.  \n   - The story explores themes of microaggressions, racial bias, nepotism, and the importance of staying true to oneself.  \n   - The narrative culminates in Riley finding the courage to step into the spotlight on her own terms at the spring concert.  \n\n- **Character Development:**  \n   - Riley Jo is a relatable and determined protagonist whose struggles as a Korean American teenager navigating the music industry and high school life are compelling.  \n   - The supporting characters, including her bandmates and the student filmmaker, add depth to the story and highlight the complexities of adolescence.  \n\n- **Writing Style and Tone:**  \n   - Grace K. Shim’s narrative is both relatable and thought-provoking, offering readers a glimpse into the challenges of adolescence.  \n   - The use of Gen Z lingo was initially overwhelming but became less prominent as the story progressed.  \n\n- **Overall Appeal:**  \n   - The novel is a captivating read with relatable characters and a toe-tapping plot.  \n   - It resonates with young teens seeking a meaningful and inspiring story.  \n\n**Conclusion:**  \n“Not Your Average Jo” by Grace K. Shim is a compelling and thought-provoking novel that explores themes of identity, perseverance, and authenticity through the eyes of a determined Korean American teenager. With its relatable characters and engaging plot, the story is both inspiring and resonant, making it a must-read for young teens.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes"
        ],
        "review": [
            "The storyline was engaging, exploring themes such as Riley’s home life, her passion for music, friendships, and the challenges within the music industry, including racism and nepotism. However, the ending felt rushed and failed to provide complete closure, missing an opportunity to resolve unresolved plot points.",
            "Riley’s character is well-developed, showcasing her struggles with parental expectations and her journey in the music industry. Griff shines as a funny and supportive friend, while Xander’s role as a crush feels inconsequential to the overall plot. Bodhi’s impactful backstory is undermined by a lack of closure in his character arc, leaving his actions unresolved. Riley’s new Asian friends, particularly Aerie, add depth to the narrative, although their initial insinuations about Riley not being a “real” Asian-American are problematic. This tension is effectively resolved through their supportive friendship. The bond between Riley and Aerie is a highlight, illustrating their efforts to understand and uplift each other despite their differing experiences. However, the romantic subplot with Xander feels underdeveloped and unnecessary. The exploration of microaggressions and varying responses to them—some focusing on their passions while others choose to speak out—is thought-provoking. Additionally, the relatable moment about people not recognizing Riley’s last name as Asian adds a humorous and authentic touch.",
            "Moving to a diverse, bustling city doesn’t guarantee greater understanding; bias and discrimination can thrive anywhere, even in urban environments. The story delves into post-pandemic themes such as Asian hate, microaggressions, and the intricate nuances of identity and belonging."
        ],
        "conclusion": "The novel offers a rich and relatable exploration of identity, discrimination, and the complexities of navigating life in a diverse city. While the storyline was engaging and the characters were well-developed, the rushed ending and lack of closure for certain plotlines left some potential untapped. Despite this, the book’s themes and relatable moments made it a worthwhile read.",
        "rating": "3",
        "review_likes": "False",
        "reviewer_id": "104214098-hannah",
        "reviewer_followers": "491 reviews",
        "reviewer_review_nums": "491 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Setting and Theme:**  \n   - Moving to a diverse, big city did not automatically lead to greater understanding, as bias and discrimination can occur anywhere, even in large cities.  \n   - The story explores post-pandemic themes, including Asian hate, microaggressions, and the complexities of identity and belonging.  \n\n- **Plot and Storyline:**  \n   - The storyline was engaging and covered a variety of topics, including Riley’s home life, her passion for music, friendships, and challenges in the music industry (racism and nepotism).  \n   - The ending felt rushed and lacked full closure, which was a missed opportunity to tie up loose ends.  \n\n- **Character Development:**  \n   - Riley’s character was well-developed, with her struggles against parental expectations and her journey in the music industry.  \n   - Griff stood out as a funny and supportive friend, while Xander’s role as a crush felt insignificant to the overall plot.  \n   - Bodhi’s backstory was impactful, but his character arc lacked closure, leaving his actions unresolved.  \n   - Riley’s new Asian friends, particularly Aerie, added depth to the story, though their initial insinuations about Riley not being a “real” Asian-American were damaging. This was resolved well through their supportive friendship.  \n\n- **Representation and Relatability:**  \n   - The exploration of microaggressions and differing responses to them (some wanting to focus on their passions, others wanting to speak out) was thought-provoking.  \n   - The relatable moment about people not recognizing Riley’s last name as Asian was a humorous and authentic touch.  \n\n- **Friendship and Relationships:**  \n   - The friendships, especially between Riley and Aerie, were a highlight, showcasing how they worked to understand and support each other despite their different experiences.  \n   - The romantic subplot with Xander felt underdeveloped and unnecessary to the main narrative.  \n\n**Conclusion:**  \nThe novel offers a rich and relatable exploration of identity, discrimination, and the complexities of navigating life in a diverse city. While the storyline was engaging and the characters were well-developed, the rushed ending and lack of closure for certain plotlines left some potential untapped. Despite this, the book’s themes and relatable moments made it a worthwhile read.  \n\n**Rating Scores:**  \n(No specific rating scores were mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Themes",
            "Enjoyment and Engagement",
            "Expectation Fulfillment"
        ],
        "review": [
            "The characters are engaging, emotionally resonant, and vividly portrayed. Jo, the protagonist, is a Korean American teen who discovers the power of her voice to advocate for herself.",
            "This book is exceptionally well-written, displaying a remarkable sensitivity and nuance.",
            "This story explores complex racial issues in a highly accessible manner. It effectively highlights the discrimination Jo experiences from both her adviser and a bandmate.",
            "The book is a delightful and captivating read that provokes thoughtful reflection. I was thoroughly immersed in the characters and their journey.",
            "This book is an engaging read for both teens and adults."
        ],
        "conclusion": "This novel is a beautifully written, engaging story that combines heartfelt character development with important themes of racial discrimination and self-empowerment. It’s a must-read for both teens and adults, and I’m eagerly looking forward to more works from this talented author.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "95965735-nicole-lesperance",
        "reviewer_followers": "216 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**  \n- **Engagement and Enjoyment:**  \n   - The book was a sweet, engrossing, and thought-provoking read.  \n   - I got totally swept up with the characters and their story.  \n\n- **Character Development:**  \n   - The characters are fun, emotionally resonant, and vivid.  \n   - Jo, the protagonist, is a Korean American teen who learns to use her voice to stand up for herself.  \n\n- **Writing Quality:**  \n   - The book is incredibly well-written, sensitive, and nuanced.  \n\n- **Themes and Relevance:**  \n   - It tackles complex racial issues in a super accessible way.  \n   - The story addresses discrimination faced by Jo from her adviser and a bandmate.  \n\n- **Target Audience:**  \n   - It’s a great read for both teens and adults.  \n\n- **Author’s Consistency:**  \n   - Similar to Grace Shim’s first book, *THE NOH FAMILY*, this novel delivers compelling characters and storytelling.  \n\n- **Anticipation for Future Work:**  \n   - I can’t wait to read more from Grace Shim.  \n\n**Conclusion:**  \nThis novel is a beautifully written, engaging story that combines heartfelt character development with important themes of racial discrimination and self-empowerment. It’s a must-read for both teens and adults, and I’m eagerly looking forward to more works from Grace Shim.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Themes"
        ],
        "review": [
            "While Jo's character was well-developed, the other characters felt underdeveloped and often defined by a single trait, which was disappointing. Nevertheless, they showed potential and intrigue. I was particularly drawn to this book because Jo, like me, is Korean, and we need more Asian representation in literature. Sharing a name with the main character made the connection even more personal and exciting. The story resonated with me as someone who grew up close to my culture, although I found myself relating more to Jo’s roommate than to Jo herself.",
            "The excessive use of Gen-Z references, such as hashtags and \"LOLs,\" felt unnecessary and distracting, despite the book's focus on a modern teen.",
            "The author masterfully tackles profound themes such as racism, microaggressions, and the immigrant experience. I appreciated the book's emphasis on the individuality of each immigrant and Korean American experience. Jo's journey in Los Angeles, where she anticipated acceptance but encountered unexpected racism, was both compelling and relatable. Additionally, her nuanced struggle with activism—feeling pressured to take a stand—was depicted realistically."
        ],
        "conclusion": "This book is a meaningful and relatable exploration of identity, racism, and the immigrant experience, though it could have benefited from stronger character development and fewer Gen-Z references. Overall, it’s a valuable addition to the literary landscape, and I highly recommend it for its powerful themes and representation.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "139460776-joanna",
        "reviewer_followers": "12 followers",
        "reviewer_review_nums": "43 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation and Relatability:**  \n   - I was drawn to this book because the main character, Jo, is Korean, like me, and we desperately need more Asian representation in literature.  \n   - Jo shares my name, which made the connection even more personal and exciting.  \n   - The book resonated with me as someone who grew up close to my culture, though I related more to Jo’s roommate than Jo herself.  \n\n- **Themes and Handling of Heavy Topics:**  \n   - The author did a wonderful job addressing heavy topics like racism, microaggressions, and the complexities of being an immigrant.  \n   - I appreciated how the book highlighted that there isn’t one way to be an immigrant or Korean American—everyone’s experience is unique.  \n   - Jo’s journey of navigating a new environment in LA, where she expected more acceptance but faced a different kind of racism, was compelling and relatable.  \n   - The portrayal of Jo’s struggle with activism and not being forced to take a stand immediately was nuanced and realistic.  \n\n- **Character Development:**  \n   - While Jo’s character was well-developed, the other characters felt underdeveloped and often defined by a single trait, which was disappointing.  \n   - Despite this, the characters had potential and were intriguing.  \n\n- **Writing Style and Gen-Z References:**  \n   - The inclusion of excessive Gen-Z references, like hashtags and LOLs, felt unnecessary and distracting, even though the book is about a modern teen.  \n\n- **Overall Message and Impact:**  \n   - I really liked the book’s message and its importance in the industry. We need more stories like this that explore diverse experiences.  \n   - Grace K. Shim is doing an incredible job, and I’m grateful to PenguinTeen for the review copy.  \n\n**Conclusion:**  \nThis book is a meaningful and relatable exploration of identity, racism, and the immigrant experience, though it could have benefited from stronger character development and fewer Gen-Z references. Overall, it’s a valuable addition to the literary landscape, and I highly recommend it for its powerful themes and representation.  \n\n**Rating Scores:**  \n3.5/5"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The story is engaging and entertaining, but at times, it feels overly focused on the plot. The subplot about the band securing a record deal comes across as somewhat unrealistic and strains credibility.",
            "The story centers primarily on Riley Jo, which effectively highlights her character arc but leaves the supporting cast underdeveloped. I would have appreciated a deeper exploration of these characters. Additionally, while I expected more romance, it remained minimal, which felt like a missed opportunity to enrich the narrative. However, the book excels in portraying the microaggressions and challenges faced by Asian-Americans, both in society and within their own communities. It offers an insightful glimpse into Riley Jo's journey as she navigates these obstacles and begins to discover her identity.",
            "While the book has its shortcomings, it remains a worthwhile read with an important message, particularly for young audiences. It effectively highlights relevant social issues through a meaningful narrative."
        ],
        "conclusion": "*Not Your Average Jo* is an insightful and entertaining novel that tackles important themes of identity and prejudice. While the plot can feel overwhelming at times and some elements stretch believability, the story remains impactful and relevant, particularly for its target audience.",
        "rating": "3",
        "review_likes": "1",
        "reviewer_id": "125977780-faith-schofield",
        "reviewer_followers": "3 followers",
        "reviewer_review_nums": "143 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation and Themes:**  \n  The book does a good job of depicting the microaggressions and difficulties that Asian-Americans face, both in wider society and within their own communities. It provides an insightful look into Riley Jo's journey as she navigates these challenges and begins to figure out her identity.  \n\n- **Plot and Pacing:**  \n  The story is engaging and entertaining, but it felt a bit heavy on the plot at times. The subplot involving the band securing a record deal seemed somewhat unrealistic and stretched believability.  \n\n- **Character Development:**  \n  The focus is primarily on Riley Jo, which is great for her character arc, but it leaves other characters underdeveloped. I would have liked to see more depth and exploration of the supporting cast.  \n\n- **Romance:**  \n  I expected a bit more romance in the story, but it was minimal. This might be a personal preference, but it felt like a missed opportunity to add another layer to the narrative.  \n\n- **Overall Impact:**  \n  Despite some shortcomings, the book is a good read and carries an important message, especially for young readers. It’s a meaningful story that sheds light on relevant social issues.  \n\n**Conclusion:**  \n*Not Your Average Jo* is an insightful and entertaining novel that tackles important themes of identity and prejudice. While the plot can feel overwhelming at times and some elements stretch believability, the story remains impactful and relevant, particularly for its target audience.  \n\n**Rating Scores:**  \n3/5 ⭐️"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Themes"
        ],
        "review": [
            "The depiction of the music industry is both captivating and disconcerting, revealing its intricate politics.",
            "In this story, 17-year-old Korean American Riley is driven to chase her dream of a musical life. The characters Elise and Aerie bring unique dynamics to the narrative, with Elise's fun and quirky personality standing out. Additionally, Griff, Xander, and Bodhi contribute depth and complexity, enriching the overall storyline.",
            "The excessive use of hashtags and \"LOLs\" diminishes the overall experience.",
            "The novel explores significant themes such as the pursuit of dreams, self-advocacy, and the quest for belonging. It also addresses Asian racism with a compelling sense of injustice."
        ],
        "conclusion": "This novel is a compelling and inspirational read, with well-developed characters and meaningful themes. While the writing style occasionally falters, the story’s exploration of dreams, identity, and the music industry makes it a worthwhile experience.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "104408166-kim-wilch",
        "reviewer_followers": "62 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n   - Riley, a 17-year-old Korean American girl, is determined to pursue her dream of living a life of music.  \n   - Elise and Aerie are unique additions to the cast, with Elise having a fun and unusual personality.  \n   - Griff, Xander, and Bodhi add depth and complexity to the story.  \n\n- **Themes and Life Lessons:**  \n   - The novel addresses important themes such as working hard to achieve dreams, standing up for oneself, and finding a sense of belonging.  \n   - It also tackles Asian racism in a way that evokes a strong sense of unfairness.  \n\n- **Plot and Setting:**  \n   - The portrayal of the music industry is both intriguing and unsettling, shedding light on its politics.  \n\n- **Writing Style:**  \n   - The use of hashtags and \"LOLs\" feels overdone and detracts from the overall experience.  \n\n- **Overall Enjoyment:**  \n   - Despite some stylistic flaws, the story is inspirational and enjoyable.  \n\n**Conclusion:**  \nThis novel is a compelling and inspirational read, with well-developed characters and meaningful themes. While the writing style occasionally falters, the story’s exploration of dreams, identity, and the music industry makes it a worthwhile experience.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Themes",
            "Emotional Impact"
        ],
        "review": [
            "The story opens powerfully with Riley Jo chasing her dream of attending a performing arts school in L.A. Conflict emerges as she faces tensions with her bandmates, enriching the narrative and adding depth to her journey.",
            "Riley Jo is a relatable Korean American teen with a passion for music. However, some characters come across as flat and underdeveloped, making it difficult to connect with them. Additionally, their youthful demeanor sometimes creates a disconnect for older readers like myself.",
            "As an older reader, I found the use of modern slang somewhat out of touch, which made certain parts less relatable.",
            "The story adeptly addresses themes of race and nepotism, central to its plot. As a coming-of-age tale, it skillfully depicts the journey of self-discovery and the quest for one's inner voice.",
            "I appreciated the journey of self-discovery and the emphasis on music, which enriched the story with emotional depth."
        ],
        "conclusion": "Overall, this novel is a compelling coming-of-age story that explores themes of race, nepotism, and self-discovery. While some characters felt underdeveloped and the modern slang was a bit jarring, the emotional journey and the focus on music made it an engaging read.",
        "rating": "3",
        "review_likes": "False",
        "reviewer_id": "70188688-megan-houde",
        "reviewer_followers": "5 followers",
        "reviewer_review_nums": "981 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n  - Riley Jo is portrayed as an average Korean American teen with a passion for music, which makes her relatable.  \n  - Some characters felt flat and underdeveloped, making it hard to connect with them.  \n  - The characters sometimes felt \"too young,\" which created a sense of disconnect for me as an older reader.  \n\n- **Themes and Messages:**  \n  - The story effectively tackles themes of race and nepotism, which are central to the plot.  \n  - It is a coming-of-age story that explores growing up and finding one’s inner voice.  \n\n- **Writing Style and Language:**  \n  - The use of modern slang felt a bit out of touch for me as an older reader, making some parts less relatable.  \n\n- **Plot and Pacing:**  \n  - The story starts strong, with Riley Jo pursuing her dream of attending a performing arts school in L.A.  \n  - Conflict arises when she clashes with her bandmates, adding tension and depth to the narrative.  \n\n- **Emotional Engagement:**  \n  - I enjoyed the journey of self-discovery and the emphasis on music, which added emotional depth to the story.  \n\n**Conclusion:**  \nOverall, this novel is a compelling coming-of-age story that explores themes of race, nepotism, and self-discovery. While some characters felt underdeveloped and the modern slang was a bit jarring, the emotional journey and the focus on music made it an engaging read.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Themes",
            "Expectation Fulfillment"
        ],
        "review": [
            "The protagonist is whiny and lacks depth, resembling flour in personality. This simplicity makes it challenging to connect with or root for the character.",
            "The novel strives for a contemporary American tone, but this effort often feels forced and alienates the reader. Its heavy reliance on modern references, such as TikTok and the pandemic, detracts from the narrative instead of enriching it.",
            "The novel addresses themes of virtue signaling and Asian hate, but they are treated superficially and lack depth. The political commentary comes across as contrived, akin to scenarios devised by AI or simplistic political speeches, failing to provide any meaningful insight.",
            "Having enjoyed the author's previous work, *The Noh Family*, I had high hopes for this novel. Regrettably, the shift in tone, style, and thematic execution did not meet my expectations, resulting in disappointment."
        ],
        "conclusion": "This review reflects a deep sense of disappointment from me, as I admired the author's earlier work. The novel's attempt to modernize its tone and address contemporary issues feels forced and poorly executed, resulting in a story that fails to resonate. The protagonist's lack of depth and the superficial handling of important themes further diminish the reading experience.",
        "rating": "1",
        "review_likes": "False",
        "reviewer_id": "47326617-mary-mav",
        "reviewer_followers": "36 followers",
        "reviewer_review_nums": "382 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Tone and Style:**  \n  The novel attempts to adopt a more American and contemporary tone, which feels forced and disconnected from the reader's expectations. The heavy reliance on modern references like TikTok and the pandemic detracts from the story rather than enhancing it.\n\n- **Character Development:**  \n  The protagonist is described as whiny and lacking depth, with a personality likened to \"flour.\" This lack of complexity makes it difficult to connect with or root for the character.\n\n- **Themes and Messaging:**  \n  The novel includes overt virtue signaling and references to Asian hate, but these themes are handled in a superficial and unnuanced manner. The political commentary feels artificial, resembling scenarios generated by AI or overly simplistic political speeches, rather than offering meaningful insight.\n\n- **Expectations vs. Reality:**  \n  As a fan of the author's previous work, *The Noh Family*, the reader had high expectations for this novel. Unfortunately, the shift in tone, style, and thematic execution fell far short of what was anticipated, leading to disappointment.\n\n**Conclusion:**  \nThis review reflects a deep sense of disappointment from a reader who admired the author's earlier work. The novel's attempt to modernize its tone and address contemporary issues feels forced and poorly executed, resulting in a story that fails to resonate. The protagonist's lack of depth and the superficial handling of important themes further diminish the reading experience.\n\n**Rating Scores:**  \n1.5/5"
    },
    {
        "aspects": [
            "Characters",
            "World-Building and Setting",
            "Expectation Fulfillment"
        ],
        "review": [
            "I’m grateful to be in an era where books showcase diverse characters and backgrounds—something that was scarce in my youth. It’s exciting that today’s teens can enjoy a rich variety of incredible stories like this one.",
            "I picked up this book because the hometown of the main character, Bentonville, AR, resonated with me as a fellow Arkansan from Little Rock.",
            "Although I may be a bit older than the book's target audience, I wholeheartedly recommend it to my teen nieces and younger social media followers. The story promised a fun coming-of-age experience, and it certainly delivered. I thoroughly enjoyed it."
        ],
        "conclusion": "This book was a delightful coming-of-age story with a relatable setting, diverse representation, and an adorable cover. Despite being older than the target audience, I found it enjoyable and will enthusiastically recommend it to younger readers.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "121785161-bean-house",
        "reviewer_followers": "30 followers",
        "reviewer_review_nums": "274 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Setting and Personal Connection:**  \n  I picked this book up because Bentonville, AR, the hometown of the main character, resonated with me as someone from Little Rock, AR.  \n\n- **Genre and Enjoyment:**  \n  The story sounded like a fun coming-of-age tale, and it lived up to that expectation. I thoroughly enjoyed it.  \n\n- **Cover Design:**  \n  The cover is adorable and adds to the overall appeal of the book.  \n\n- **Diversity and Representation:**  \n  I appreciate that we are now in an era where books feature diverse characters and backgrounds. This was not something readily available when I was younger, and I’m thrilled that today’s teens have access to such a wide selection of amazing stories like this one.  \n\n- **Target Audience and Recommendation:**  \n  While I’m admittedly a bit older than the book’s intended audience, I will definitely recommend it to my teen nieces and younger followers on social media.  \n\n**Conclusion:**  \nThis book was a delightful coming-of-age story with a relatable setting, diverse representation, and an adorable cover. Despite being older than the target audience, I found it enjoyable and will enthusiastically recommend it to younger readers.  \n\n**Rating Scores:**  \nNo specific rating scores were mentioned in the review."
    },
    {
        "aspects": [
            "Characters"
        ],
        "review": [
            "Riley's new friendships at the boarding school are pivotal in her journey to confront injustice. These relationships offer support and diverse perspectives, highlighting the vital role of community in tackling societal inequities."
        ],
        "conclusion": "This novel is a compelling exploration of cultural identity, systemic racism, and the power of friendship. Through Riley’s journey, it offers a nuanced portrayal of the challenges faced by Asian Americans, particularly in the entertainment industry. While it doesn’t provide simple solutions, it leaves readers with plenty to ponder and discuss.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "16320240-chris-g",
        "reviewer_followers": "5 followers",
        "reviewer_review_nums": "668 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Cultural Identity and Assimilation:**  \n  The novel explores the complexities of being Asian American, particularly through Riley’s family’s decision to change their surname from Cho to Jo to assimilate more easily in Arkansas. This highlights the pressures and compromises faced by immigrant families in predominantly non-diverse environments.  \n\n- **Systemic Racism in the Entertainment Industry:**  \n  Riley’s journey as a singer-songwriter at a music-focused boarding school in California sheds light on the systemic racism prevalent in the entertainment industry. Her experiences navigating these challenges are a central theme, offering readers insight into the barriers faced by marginalized groups in creative fields.  \n\n- **Friendship and Solidarity:**  \n  Riley’s new friendships at the boarding school play a crucial role in helping her confront injustice. These relationships provide support and alternative perspectives, emphasizing the importance of community in addressing societal inequities.  \n\n- **Thought-Provoking Themes:**  \n  The novel does not offer easy answers but instead presents complex issues that encourage readers to reflect and engage in meaningful discussions. It tackles themes of identity, racism, and resilience in a way that resonates deeply.  \n\n**Conclusion:**  \nThis novel is a compelling exploration of cultural identity, systemic racism, and the power of friendship. Through Riley’s journey, it offers a nuanced portrayal of the challenges faced by Asian Americans, particularly in the entertainment industry. While it doesn’t provide simple solutions, it leaves readers with plenty to ponder and discuss.  \n\n**Rating Scores:**  \nNo specific rating scores mentioned in the review."
    },
    {
        "aspects": [
            "Characters",
            "Themes"
        ],
        "review": [
            "Riley Jo is a thoughtfully developed character who diligently navigates her circumstances. Her compelling journey sheds light on her efforts to make the most of her situation. Representing many Asian-American kids, Riley Jo embodies the struggle to break free from societal constraints and confront the inherent inequities they face. While her experiences may not be universal, they resonate deeply with anyone familiar with similar challenges.",
            "The novel thoughtfully delves into themes of coming-of-age and resilience, particularly within the Asian-American experience. It offers a powerful perspective on overcoming adversity and discovering one's voice."
        ],
        "conclusion": "This novel is a powerful and relatable coming-of-age story that captures the struggles and triumphs of an Asian-American protagonist. It is both impactful and enjoyable, making it a must-read.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "32169828-jame-ereader",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "1,191 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation and Relatability:**  \n  Riley Jo represents many Asian-American kids who struggle to break out of their shells and face unfair advantages in the world. Her experiences, while not universal, resonate deeply with those who have lived through similar challenges.  \n\n- **Character Development:**  \n  Riley Jo is a well-crafted character who tries hard to navigate her circumstances. Her journey is compelling and offers insight into how she makes the most of her situation.  \n\n- **Themes and Impact:**  \n  The novel explores themes of coming-of-age and resilience, particularly within the context of the Asian-American experience. It provides a meaningful perspective on overcoming adversity and finding one's voice.  \n\n- **Overall Enjoyment and Recommendation:**  \n  The book is amazing and highly recommended. It offers a chance to see the world through Riley Jo's eyes and leaves a lasting impression.  \n\n**Conclusion:**  \nThis novel is a powerful and relatable coming-of-age story that captures the struggles and triumphs of an Asian-American protagonist. It is both impactful and enjoyable, making it a must-read.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Themes",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The author excels in character development throughout the book. Riley Jo’s journey of self-discovery and finding her voice through music is especially compelling. Her relationships with friends are heartfelt and authentically portrayed, adding depth to the story and making the characters relatable.",
            "This engaging coming-of-age story follows Riley Jo, a Korean American girl grappling with feelings of inadequacy—she struggles with the sense of not being “enough” in either her Korean or American identity. The book poignantly addresses the challenges of racism and discrimination, making Riley's journey relatable and impactful.",
            "This book is a breath of fresh air and truly inspirational. It resonates with artists and musicians alike, as well as with readers of all ages."
        ],
        "conclusion": "This novel is a beautifully crafted coming-of-age story that tackles themes of identity, racism, and self-discovery. With well-developed characters, meaningful relationships, and an inspiring narrative, it offers something valuable for readers of all ages.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "100189379-dana-mckenzie",
        "reviewer_followers": "15 followers",
        "reviewer_review_nums": "226 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Theme and Representation:**  \n  This was a wonderful coming-of-age story about a Korean American girl named Riley Jo. The book effectively highlights the struggles of racism and discrimination, as Riley feels she’s not “enough”—not Korean enough, not American enough.  \n\n- **Character Development:**  \n  Grace Shim does a wonderful job with the characters in this book. I loved how each one developed over time, especially Riley Jo. Her journey of self-discovery and finding her voice through music was particularly compelling.  \n\n- **Relationships:**  \n  The relationship between Riley and her friends was heartwarming and well-portrayed. It added depth to the story and made the characters feel relatable and authentic.  \n\n- **Inspiration and Appeal:**  \n  This book was a breath of fresh air and very inspirational. It resonated not only with artists and musicians but also with kids and adults of any age.  \n\n**Conclusion:**  \nThis novel is a beautifully crafted coming-of-age story that tackles themes of identity, racism, and self-discovery. With well-developed characters, meaningful relationships, and an inspiring narrative, it offers something valuable for readers of all ages.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes",
            "Expectation Fulfillment"
        ],
        "review": [
            "While some readers may find the plot predictable and the characters stereotypical, the story's exploration of meaningful themes keeps it compelling and thought-provoking.",
            "The characters are somewhat stereotypical, which may reduce their relatability and complexity for some readers.",
            "This novel delves into significant themes like identity, resilience, empowerment, and self-discovery. Its exploration of authenticity and artistic integrity enriches the narrative, making it a compelling read for fans of YA fiction.",
            "This novel is a compelling choice for readers looking for a relatable and thought-provoking experience in contemporary YA literature."
        ],
        "conclusion": "Overall, Not Your Average Jo is a compelling tale that resonates with themes of empowerment and self-discovery. While the plot may feel predictable and the characters somewhat stereotypical, the exploration of authenticity and artistic integrity adds depth, making it a worthwhile read for fans of YA fiction.",
        "rating": "3",
        "review_likes": "False",
        "reviewer_id": "96326274-k-tea",
        "reviewer_followers": "24 followers",
        "reviewer_review_nums": "304 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Themes:**  \n  The novel touches on important themes such as identity, resilience, empowerment, and self-discovery. The exploration of authenticity and artistic integrity adds depth to the story, making it a worthwhile read for fans of YA fiction.  \n\n- **Plot:**  \n  Some readers might find the plot predictable, which could detract from the overall experience.  \n\n- **Characters:**  \n  The characters are somewhat stereotypical, which may limit their relatability or complexity for certain readers.  \n\n- **Narrative and Depth:**  \n  Despite the predictability of the plot and the stereotypical characters, the narrative's exploration of meaningful themes makes the story compelling and thought-provoking.  \n\n- **Target Audience:**  \n  The novel is a recommended choice for those seeking a relatable and thought-provoking read in the realm of contemporary YA literature.  \n\n**Conclusion:**  \nOverall, \"Not Your Average Jo\" is a compelling tale that resonates with themes of empowerment and self-discovery. While the plot may feel predictable and the characters somewhat stereotypical, the exploration of authenticity and artistic integrity adds depth, making it a worthwhile read for fans of YA fiction.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "World-Building and Setting",
            "Themes"
        ],
        "review": [
            "Riley Jo is a thoughtfully developed protagonist who confronts racial issues from various perspectives, especially within the contemporary band at her arts boarding school. Her journey of self-discovery and empowerment is both authentic and inspiring.",
            "The writing was immersive and captivating from start to finish, striking a perfect balance between emotional depth and a compelling narrative. A truly great read!",
            "The story's setting in a prestigious arts boarding school during Riley Jo's senior year offers a compelling backdrop that enriches the narrative. It effectively highlights the personal and professional challenges she encounters.",
            "I found the coming-of-age story of Riley Jo, a Korean American teen, to be deeply engaging. The novel beautifully captures her journey of self-discovery as she navigates her identity and passion for music. The themes of belonging and personal growth resonated with me profoundly."
        ],
        "conclusion": "This novel is a heartfelt and thought-provoking exploration of identity, race, and self-expression through the lens of a talented young musician. Riley Jo's journey is both relatable and inspiring, making it a memorable and enjoyable read.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "132726338-cassandra-peters",
        "reviewer_followers": "3 followers",
        "reviewer_review_nums": "68 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Plot and Theme:**  \n  I found the coming-of-age story about Riley Jo, a Korean American teen, to be deeply engaging. The novel explores her journey of finding her place in the world while pursuing her passion for music. The themes of identity, belonging, and self-discovery resonated strongly with me.\n\n- **Character Development:**  \n  Riley Jo is a well-crafted protagonist who faces racial issues from multiple angles, particularly within the contemporary band she joins at her arts boarding school. Her growth throughout the story, as she learns to find her own voice, felt authentic and inspiring.\n\n- **Setting and Context:**  \n  The setting of a prestigious arts boarding school during Riley Jo's senior year of high school added a unique and compelling backdrop to the story. It provided a rich environment for exploring the challenges she faces, both personally and professionally.\n\n- **Writing Style and Enjoyment:**  \n  The writing was immersive and kept me hooked from start to finish. It was a great read that balanced emotional depth with a compelling narrative.\n\n**Conclusion:**  \nThis novel is a heartfelt and thought-provoking exploration of identity, race, and self-expression through the lens of a talented young musician. Riley Jo's journey is both relatable and inspiring, making it a memorable and enjoyable read.\n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Enjoyment and Engagement"
        ],
        "review": [
            "I absolutely love how the author develops her characters. They exude the bubbly joy of a Disney Channel Original Movie, yet she delves into their complexities, revealing what truly drives them in a world that can be unkind. This depth transforms the book into a masterpiece.",
            "The writing is consistently stunning, skillfully balancing lightheartedness with emotional depth, which keeps me fully engaged in the story.",
            "I absolutely adore this book. It’s a beautifully crafted novel that resonates deeply with me, and I highly recommend it."
        ],
        "conclusion": "The novel is a masterpiece that combines joyful, relatable characters with profound emotional depth. The writing is stunning, and the story leaves a lasting impact. It’s a book I absolutely adore.",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "24179214-chloe",
        "reviewer_followers": "75 followers",
        "reviewer_review_nums": "719 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Character Development:**  \n  I utterly adore the way Grace K. Shim crafts her characters. They embody the bubbly joy of a DCOM (Disney Channel Original Movie), yet she digs deep into what makes them tick, exploring their complexities in a world that is not always kind. This depth creates a masterpiece of a book.\n  \n- **Writing Style:**  \n  The writing is stunning all the way through. Grace K. Shim’s ability to balance lightheartedness with emotional depth is remarkable, and it keeps me completely engrossed in the story.\n\n- **Overall Impact:**  \n  My adoration for this book knows no bounds. It’s a beautifully crafted novel that resonates deeply with me, and I can’t recommend it enough.\n\n**Conclusion:**  \nGrace K. Shim’s novel is a masterpiece that combines joyful, relatable characters with profound emotional depth. The writing is stunning, and the story leaves a lasting impact. It’s a book I absolutely adore.\n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Themes",
            "Expectation Fulfillment"
        ],
        "review": [
            "The book showcases a profound appreciation for music and the storytelling it inspires, adding a unique and enjoyable dimension to the narrative.",
            "Grace K. Shim has crafted a nuanced and relatable protagonist in Riley Jo, making her a character that readers will enjoy rooting for.",
            "I've recently been enjoying a number of books set in Arkansas, and this one continues that trend. I look forward to more stories like it!",
            "The story effectively addresses complex issues through a compelling coming-of-age narrative, showcasing skillful execution.",
            "I added this book to my TBR after encountering a brief blurb, so I approached it without knowing the full synopsis. To my delight, it exceeded my expectations."
        ],
        "conclusion": "*Not Your Average Jo* is a well-crafted YA contemporary novel that tackles important themes through a relatable protagonist and a compelling coming-of-age story. Its nuanced exploration of racism, bigotry, and the power of music makes it a standout read.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "81828207-piper-monarchsandmyths",
        "reviewer_followers": "67 followers",
        "reviewer_review_nums": "548 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Setting and Theme:**  \n  - I’ve been reading a lot of books set in Arkansas lately, and I’m really enjoying it. This book continues that trend, and I hope to see more stories like this.  \n  - The story tackles difficult issues through a coming-of-age narrative, which I found compelling and well-executed.  \n\n- **Plot and Expectations:**  \n  - I added this book to my TBR after seeing a short blurb but didn’t read the full synopsis, so I wasn’t sure what to expect. However, I was pleasantly surprised by what I found.  \n\n- **Characterization:**  \n  - Grace K. Shim has created a nuanced and relatable protagonist in Riley Jo, who is fun to root for.  \n\n- **Themes of Racism and Bigotry:**  \n  - I appreciate how the story addresses the nuances of racism and bigotry without oversimplifying them or attributing them solely to location.  \n\n- **Music and Storytelling:**  \n  - The book has a deep love for music and the storytelling that comes with it, which added a unique and enjoyable layer to the narrative.  \n\n- **Overall Recommendation:**  \n  - This is a solid YA contemporary novel that is definitely worth the read. I highly recommend it!  \n\n**Conclusion:**  \n*Not Your Average Jo* is a well-crafted YA contemporary novel that tackles important themes through a relatable protagonist and a compelling coming-of-age story. Its nuanced exploration of racism, bigotry, and the power of music makes it a standout read.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The novel centers on Riley Jo, a Korean American protagonist navigating her passion for music beyond the realms of K-pop. Her journey to define her own identity and artistic path is both engaging and relatable.",
            "Riley Jo, the main character, is both well-crafted and compelling. Her struggles and aspirations resonated with me, making me feel deeply invested in her journey. I look forward to providing a thorough review once I finish the book.",
            "The use of strong language, including the F-bomb, stood out in the book. Although it didn't align with the specific criteria I had in mind, it didn't diminish my overall enjoyment of the story. However, it's something to consider for readers who prefer cleaner language.",
            "I was thoroughly enjoying the book and was halfway through when I encountered some strong language. Despite this, I plan to finish it and provide a more detailed review, as Riley Jo’s story deserves a fair and complete evaluation."
        ],
        "conclusion": "This novel offers a compelling narrative about self-discovery and artistic independence, centered around a relatable and well-developed protagonist. While the use of strong language was unexpected, it didn’t overshadow my appreciation for the story. I plan to revisit and complete the book to give Riley Jo’s journey the review it deserves.",
        "rating": "4",
        "review_likes": "False",
        "reviewer_id": "154128923-jamie-henry",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "332 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Plot and Theme:**  \n  The novel revolves around a Korean American protagonist, Riley Jo, who is exploring her passion for music outside the confines of K-pop. The story focuses on her journey to carve out her own identity and artistic path, which I found engaging and relatable.\n\n- **Character Development:**  \n  Riley Jo, the main character, is well-crafted and compelling. Her struggles and aspirations resonated with me, and I felt invested in her journey. She deserves a thorough review, which I plan to provide once I finish the book.\n\n- **Language and Content:**  \n  The use of strong language, such as the F-bomb, was a notable moment in the book. While it didn’t align with the specific list I was reading the book for, it didn’t detract from my overall enjoyment of the story. However, it’s worth noting for readers who may prefer cleaner language.\n\n- **Reading Experience:**  \n  I was thoroughly enjoying the book and was halfway through when I encountered the strong language. Despite this, I intend to finish the book and provide a more detailed review, as Riley Jo’s story deserves a fair and complete assessment.\n\n**Conclusion:**  \nThis novel offers a compelling narrative about self-discovery and artistic independence, centered around a relatable and well-developed protagonist. While the use of strong language was unexpected, it didn’t overshadow my appreciation for the story. I plan to revisit and complete the book to give Riley Jo’s journey the review it deserves.\n\n**Rating Scores:**  \nNo specific rating was provided in the review, but the reader expressed intent to adjust their star rating after completing the book."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes",
            "Emotional Impact",
            "Enjoyment and Engagement"
        ],
        "review": [
            "This story follows Riley Jo, a Korean American girl who confronts racism, discrimination, and the hurdles of chasing her music aspirations. It delves into themes of identity, perseverance, and the pain of being misunderstood. Riley's journey from her hometown to the more diverse Carlmont Academy underscores her determination to overcome obstacles and pursue her dreams.",
            "Riley Jo is a well-crafted protagonist, characterized by her determination and resilience. While Griff is a favorite character, I occasionally wished he would advocate for Riley more, though I appreciate his perspective. Xander, however, truly stood out with his heartwarming support for Riley, and I hope to see more of him in future installments.",
            "This book tackles important themes such as racism and discrimination, making it a valuable read for younger audiences. I recommended it to my daughters, confident it would offer them meaningful lessons and insights into these vital issues.",
            "This book resonated with me due to its relatable depiction of Riley's struggles. Having faced similar challenges while growing up and relocating to a new state, I found her journey both moving and authentic. The emotional depth of the story made it a compelling read.",
            "The writing is engaging and immersive, allowing for a strong connection with the characters and their experiences. The story captivated me from beginning to end, and I eagerly anticipate a continuation to follow Riley’s journey further."
        ],
        "conclusion": "*Not Your Average Jo* is a powerful and relatable novel that tackles significant themes with emotional depth and authenticity. Riley Jo’s journey is inspiring, and the characters are well-crafted, making this a must-read. I highly recommend it, especially for younger readers, and I’m crossing my fingers for more to come!",
        "rating": "5",
        "review_likes": "False",
        "reviewer_id": "163840197-alexandria-williams",
        "reviewer_followers": "45 followers",
        "reviewer_review_nums": "399 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Plot and Themes:**  \n  The story revolves around Riley Jo, a Korean American girl navigating racism, discrimination, and the challenges of pursuing her music dreams. The book explores themes of identity, perseverance, and the struggles of being misunderstood. Riley’s journey from her hometown to Carlmont Academy, a more diverse environment, highlights her determination to overcome obstacles and achieve her dreams.\n\n- **Relatability and Emotional Impact:**  \n  The book resonated deeply with me because of its relatable portrayal of the struggles Riley faces. Having experienced similar challenges growing up and after moving to a different state, I found Riley’s journey incredibly moving and authentic. The emotional depth of the story made it a compelling read.\n\n- **Character Development:**  \n  Riley Jo is a well-developed protagonist whose determination and resilience shine throughout the story. Griff, while a favorite, sometimes left me wishing he would stand up more for Riley, though I understood his perspective. Xander, on the other hand, was a standout character for me—his supportive friendship with Riley was heartwarming, and I hope to see more of him in a potential sequel.\n\n- **Representation and Educational Value:**  \n  The book addresses important topics like racism and discrimination, making it a valuable read for younger audiences. I recommended it to my daughters, believing it would provide them with meaningful lessons and insights into these issues.\n\n- **Writing Style and Engagement:**  \n  Grace K. Shim’s writing is engaging and immersive, making it easy to connect with the characters and their experiences. The story kept me hooked from start to finish, and I’m eagerly hoping for a sequel to continue following Riley’s journey.\n\n**Conclusion:**  \n*Not Your Average Jo* is a powerful and relatable novel that tackles significant themes with emotional depth and authenticity. Riley Jo’s journey is inspiring, and the characters are well-crafted, making this a must-read. I highly recommend it, especially for younger readers, and I’m crossing my fingers for a sequel!\n\n**Rating Scores:**  \n⭐️: 5 of 5"
    }
]