[
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "World-Building and Setting",
            "Expectation Fulfillment"
        ],
        "review": [
            "This book features a diverse cast of queer characters, including non-binary representation, which I truly appreciated. Knox, Charley, and Zada stood out as particularly memorable. Charley and Zada emphasized the significance of platonic and familial love alongside romantic connections, adding depth to the narrative. The found family trope resonated with me, as it often does, and I found many themes to be both important and relatable. The budding romance between the two unlikely leads was charming, especially as Knox navigated the real world. The sleepover scene was a standout moment that made me audibly gush. However, I felt the overall romance was somewhat underwhelming and could have benefited from further development.",
            "The book's light, fluffy tone is well-suited for a YA audience, making it an enjoyable read. However, I've encountered other YA fantasy novels that push the boundaries further.",
            "In *OTHERWORLDLY*, the snowy settings truly captivated me. They infused the story with a magical, immersive quality, creating a cozy and enchanting atmosphere.",
            "The magic and fantasy elements were enjoyable, but the story itself felt overly simplistic. The ending wrapped up too quickly, leaving me wishing for greater depth and complexity."
        ],
        "conclusion": "*OTHERWORLDLY* is a charming and cozy read with strong representation, relatable themes, and a delightful found family dynamic. While the romance and fantasy elements could have been more developed, the book’s light and fluffy tone make it an enjoyable experience. The stunning cover and the author's dedication to queer storytelling are definite highlights.",
        "rating": "3",
        "review_likes": "33",
        "reviewer_id": "125271582-braden-books",
        "reviewer_followers": "53 followers",
        "reviewer_review_nums": "218 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Setting and Atmosphere:**  \n  The snowy settings in *OTHERWORLDLY* were a standout element for me. They added a magical and immersive quality to the story, making it feel cozy and enchanting.  \n\n- **Representation and Characters:**  \n  The book features queer characters, including non-binary representation, which I deeply appreciated. Knox, Charley, and Zada were particularly memorable. Charley and Zada highlighted the importance of platonic and familial love alongside romantic love, which added depth to the story. The found family trope resonated with me, as it always does, and I found many of the themes to be important and relatable.  \n\n- **Romance:**  \n  The budding romance between the two unlikely leads was cute, especially Knox's attempts to navigate the real world. The sleepover scene was a highlight that made me audibly gush. However, I felt the overall romance was a bit underwhelming and could have been developed further.  \n\n- **Fantasy Elements:**  \n  While the magic and fantasy aspects were enjoyable, I found the story to be rather simple. The ending felt resolved too quickly, which left me wanting more depth and complexity.  \n\n- **Writing Style and Tone:**  \n  The book has a light, fluffy tone, which I think works well for a YA audience. It’s an enjoyable read, though I’ve read other YA fantasy novels that pushed the boundaries further.  \n\n- **Cover and Author Appreciation:**  \n  The cover is absolutely gorgeous, and I admire F.T. Lukens for consistently telling queer-focused stories. Their commitment to representation is something I truly champion.  \n\n**Conclusion:**  \n*OTHERWORLDLY* is a charming and cozy read with strong representation, relatable themes, and a delightful found family dynamic. While the romance and fantasy elements could have been more developed, the book’s light and fluffy tone make it an enjoyable experience. The stunning cover and F.T. Lukens’ dedication to queer storytelling are definite highlights.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting"
        ],
        "review": [
            "*Otherworldly* boasts a compelling plot that stands out among the author's recent works. The mystery surrounding the eternal winter in Ellery's town is captivating and maintained my interest throughout. The surprising plot twists in the second half of the book added to its entertainment value.",
            "I adored the grumpy-sunshine dynamic between Ellery and Knox. Their sweet yet mildly angsty romance was both wholesome and heartwarming. Knox's chapters were delightful, particularly his longing to experience human love and enjoy simple pleasures like watching TV shows. I found Ellery's character relatable, especially their struggles with strained family relationships and the journey toward embracing love while forming a found family with Charley, Zada, and Knox. The contrast between Ellery's internal panic over their developing crush and Knox's calm acceptance of his feelings added charm to their dynamic.",
            "The world-building in this standalone fantasy novel is truly impressive. The depiction of shades, undead, witches, and minor gods creates a whimsical and immersive atmosphere. With its magical realism vibe, the book resonates with me, reminiscent of one of my all-time favorite stories."
        ],
        "conclusion": "*Otherworldly* is a delightful blend of romance, mystery, and whimsical fantasy. The strong plot, charming character dynamics, and immersive world-building made it an incredibly entertaining read. It’s a standout in the author's works and left me thoroughly satisfied.",
        "rating": "4",
        "review_likes": "21",
        "reviewer_id": "82987361-lauren-lanz",
        "reviewer_followers": "294 followers",
        "reviewer_review_nums": "853 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Romance and Character Dynamics:**  \n  - I loved the grumpy x sunshine pairing of Ellery and Knox. Their sweet and mildly angsty romance was wholesome and heartwarming.  \n  - Knox's chapters were adorable, especially his desire to experience human love and mundane joys like watching TV shows.  \n  - Ellery's character resonated with me, particularly their strained family relationships and their journey of opening up to love and forming a found family with Charley, Zada, and Knox.  \n  - The contrast between Ellery's internal panic over their growing crush and Knox's calm acceptance of his feelings was endearing and added a lot of charm to their dynamic.  \n\n- **Plot and Mystery:**  \n  - The plot of *Otherworldly* is the strongest among Lukens' recent releases. The mystery of the eternal winter in Ellery's town was intriguing and kept me engaged.  \n  - The plot twists in the latter half of the book were genuinely surprising and made the story highly entertaining.  \n\n- **World-Building and Atmosphere:**  \n  - The world-building was impressive for a standalone fantasy novel. The portrayal of shades, undead, witches, and minor gods created a whimsical and immersive atmosphere.  \n  - The book gave off a magical realism vibe, which I adore, and it faintly reminded me of *The Raven Cycle*, one of my favorite series.  \n\n**Conclusion:**  \n*Otherworldly* is a delightful blend of romance, mystery, and whimsical fantasy. The strong plot, charming character dynamics, and immersive world-building made it an incredibly entertaining read. It’s a standout in Lukens' works and left me thoroughly satisfied.  \n\n**Rating Scores:**  \n4.5 ⭐️"
    },
    {
        "aspects": [
            "Characters",
            "World-Building and Setting"
        ],
        "review": [
            "The found family theme added a delightful warmth to the story, making the relationships feel genuine and heartwarming. The characters, portrayed as endearingly corny teenagers, offered a refreshing and authentic touch, especially for a YA novel.",
            "This story is ideal for winter, offering a cozy and immersive reading experience."
        ],
        "conclusion": "This book is a standout for me, with its heartwarming found family, authentic teenage characters, and a romantic pairing that I absolutely adored. The cozy winter atmosphere made it even more enjoyable, and it’s now one of my favorite novels.",
        "rating": "5",
        "review_likes": "9",
        "reviewer_id": "147075492-ray",
        "reviewer_followers": "30 followers",
        "reviewer_review_nums": "478 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Dynamics (Found Family):** The found family aspect was incredibly sweet and cozy, making the relationships feel warm and genuine.  \n- **Character Authenticity (Teenage Behavior):** The characters were portrayed as corny teenagers, which felt refreshing and authentic, especially in a YA novel.  \n- **Romantic Pairing:** This book features my favorite couple out of all F.T. Lukens' works. The dynamic, especially the \"himbo\" character, was particularly endearing.  \n- **Setting and Atmosphere:** The story felt perfect for wintertime, creating a cozy and immersive reading experience.  \n- **Comparison to Other Works:** While I need to reread *In Deeper Waters* to compare, this book has already become a strong contender for my favorite F.T. Lukens novel.  \n\n**Conclusion:**  \nThis book is a standout for me, with its heartwarming found family, authentic teenage characters, and a romantic pairing that I absolutely adored. The cozy winter atmosphere made it even more enjoyable, and it’s now one of my favorite F.T. Lukens novels.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Enjoyment and Engagement"
        ],
        "review": [
            "This book is charming and authentically captures the essence of teenage life. It's refreshing to find a YA novel that resonates with genuine teen experiences, especially as the genre has increasingly targeted older audiences in recent years."
        ],
        "conclusion": "*Otherworldly* by FT Lukens is a delightful and refreshing YA novel that showcases the author’s growth. It successfully captures the teenage experience in a way that feels authentic and engaging, making it a standout in the genre.",
        "rating": "4",
        "review_likes": "10",
        "reviewer_id": "45234277-emma-ann",
        "reviewer_followers": "812 followers",
        "reviewer_review_nums": "491 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Author's Growth:**  \n  FT Lukens has improved significantly since their previous work. I wasn’t a fan of *So This Is Ever After*, but *Otherworldly* was a pleasant surprise.\n\n- **Tone and Appeal:**  \n  The book is super cute and feels like a genuinely teen-oriented story. It’s refreshing to see a YA novel that captures the essence of teenage experiences, especially since the genre has been aging up in recent years.\n\n- **Acknowledgments:**  \n  Thanks to Simon & Schuster for providing the ARC (Advanced Reader Copy).\n\n**Conclusion:**  \n*Otherworldly* by FT Lukens is a delightful and refreshing YA novel that showcases the author’s growth. It successfully captures the teenage experience in a way that feels authentic and engaging, making it a standout in the genre.\n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "World-Building and Setting"
        ],
        "review": [
            "Ellery, a skeptical and grumpy black cat character, contrasts beautifully with Knox's sunny, bubbly golden retriever personality, making their dynamic a standout aspect of the story. As a non-binary protagonist, Ellery's identity is thoughtfully woven into the narrative, promoting casual representation without turning it into a plot crisis. However, the romance between Ellery and Knox feels underdeveloped and somewhat rushed, with moments that evoke the charm—and occasional cringe—of a Hallmark movie.",
            "The world-building is somewhat limited, relying heavily on urban fantasy tropes. The prologue contains info dumps that can feel overwhelming and confusing."
        ],
        "conclusion": "While the novel has charming character dynamics and casual representation, the romance feels rushed and underdeveloped, and the world-building lacks depth. Despite its flaws, it has moments of humor and warmth, though it doesn’t quite reach the level of the author’s *Spellbound*.",
        "rating": "3",
        "review_likes": "8",
        "reviewer_id": "60725431-booksblabbering-cait",
        "reviewer_followers": "395 followers",
        "reviewer_review_nums": "1,389 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Characters:**  \n  - Ellery is a skeptic, grumpy black cat type of character, while Knox is a sunshine, bubbly, golden retriever personality. Their dynamic is a highlight.  \n  - The protagonist, Ellery, is non-binary, and their identity and acceptance are seamlessly integrated into the story without being a plot crisis.  \n  - Casual representation is present and well-handled.  \n\n- **Romance:**  \n  - The romance between Ellery and Knox feels underdeveloped, instant, and somewhat unestablished.  \n  - There are moments reminiscent of a Hallmark romance movie, which can be both funny and cringey.  \n\n- **World-Building:**  \n  - The world-building is limited, leaning heavily into urban fantasy tropes.  \n  - There are info dumps, particularly in the prologue, which feel overwhelming and confusing.  \n\n- **Comparisons and Preferences:**  \n  - The story reminded me of *The Girl Who Fell Beneath the Sea*.  \n  - *Spellbound* remains my favorite book by Lukens.  \n\n**Conclusion:**  \nWhile the novel has charming character dynamics and casual representation, the romance feels rushed and underdeveloped, and the world-building lacks depth. Despite its flaws, it has moments of humor and warmth, though it doesn’t quite reach the level of Lukens’ *Spellbound*.  \n\n**Rating Scores:**  \n- No specific rating scores mentioned in the review."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Enjoyment and Engagement"
        ],
        "review": [
            "At times, the resolutions to conflicts seem rushed, resulting in an anti-climactic feel that slightly diminishes the overall impact of the story.",
            "The characters are charming, particularly Knox, whose journey toward embracing selfishness reveals significant growth and depth in his personality.",
            "I'm eager to read more from this author because I appreciate their writing style and storytelling."
        ],
        "conclusion": "Overall, this book delivers a cozy and sweet experience with adorable characters, particularly Knox, who shows notable growth. While the conflicts sometimes feel rushed and anti-climatic, the book remains enjoyable, and I am excited to read more from the author in the future.",
        "rating": "4",
        "review_likes": "8",
        "reviewer_id": "84690155-afra",
        "reviewer_followers": "12 followers",
        "reviewer_review_nums": "224 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Cozy and Sweet Atmosphere:** The book, like others by FT Lukens, is filled with cozy feelings. It is cute and sweet, creating a warm and comforting reading experience.\n- **Character Development:** The characters are adorable, especially Knox. I love how he learns to be more selfish, showing growth and depth in his personality.\n- **Pacing and Conflict Resolution:** Sometimes, I feel the conflicts are resolved too quickly and can come across as a bit anti-climatic, which slightly detracts from the overall impact of the story.\n- **Anticipation for Future Works:** I am looking forward to reading all the next books by FT Lukens, as I enjoy their writing style and storytelling.\n\n**Conclusion:**\nOverall, this book by FT Lukens delivers a cozy and sweet experience with adorable characters, particularly Knox, who shows notable growth. While the conflicts sometimes feel rushed and anti-climatic, the book remains enjoyable, and I am excited to read more from the author in the future.\n\n**Rating Scores:**\n{No specific rating scores mentioned in the review.}"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Themes"
        ],
        "review": [
            "The plot was well-constructed, but the ending raised questions for me. What will happen to Knox after Ellery's death? Will he forget Ellery and continue his immortal life alone?",
            "I adored the characters, particularly Ellery, Knox, Charley, and Zada. Ellery stands out as a realistic, brave, and fiercely loyal individual, even towards someone he had known for just a few weeks.",
            "The setting was less captivating and more predictable than in the author's previous works, like *So This is Ever After* or *Spell Bound*. The premise of the supernatural intersecting with the ordinary, along with the ensuing battles, felt underwhelming.",
            "I appreciated the thought-provoking exploration of blind faith and related themes."
        ],
        "conclusion": "While this wasn’t a bad read, it wasn’t exceptionally good either. It had its enjoyable moments and strong characters, but the predictable premise and underwhelming setting kept it from standing out among the author's other works.",
        "rating": "4",
        "review_likes": "7",
        "reviewer_id": "133024926-trice",
        "reviewer_followers": "14 followers",
        "reviewer_review_nums": "185 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Overall Enjoyment:**  \n  - The novel was good, cute, and mostly fun—everything a YA novel should be.  \n  - However, it didn’t fully meet my expectations.  \n\n- **Setting and Premise:**  \n  - The setting was less fascinating and more predictable compared to other works by F.T. Lukens, such as *So This is Ever After* or *Spell Bound*.  \n  - The premise of supernatural meets normal, with supernatural fights to fight, felt underwhelming.  \n\n- **Characters:**  \n  - I loved the characters, especially Ellery, Knox, Charley, and Zada.  \n  - Ellery was realistic, brave, and loyal (even to someone he had only known for a few weeks).  \n\n- **Plot Development:**  \n  - The plot came together pretty well.  \n  - The ending left me with questions, such as what happens to Knox after Ellery dies—will he forget Ellery and live an immortal life without him?  \n\n- **Themes and Depth:**  \n  - I appreciated the thought-provoking questions about blind faith and similar themes.  \n\n**Conclusion:**  \nWhile this wasn’t a bad read, it wasn’t exceptionally good either. It had its enjoyable moments and strong characters, but the predictable premise and underwhelming setting kept it from standing out among F.T. Lukens’ other works.  \n\n**Rating Scores:**  \n- No specific rating scores mentioned in the review."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting"
        ],
        "review": [
            "The story is a light and enjoyable read, featuring minimal angst that makes it easy to digest.",
            "The characters are endearing and easy to support, with well-crafted side characters that make you feel like part of their family. The romance is sweet and enjoyable, though I would have appreciated more time spent between Ellery and Knox to strengthen their deep connection.",
            "The world-building is impressive and enriches the narrative."
        ],
        "conclusion": "The author delivers another cute and fun YA urban fantasy with lovable characters, a sweet romance, and engaging world-building. While I wished for more development in the main romance, the overall story is an easy and enjoyable read.",
        "rating": "4",
        "review_likes": "5",
        "reviewer_id": "68444755-jane-whatjanereads",
        "reviewer_followers": "131 followers",
        "reviewer_review_nums": "682 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n  - The characters are lovable and easy to root for.  \n  - The side characters are so well-written that they make you feel like you want to be part of their family.  \n\n- **Romance:**  \n  - The romance is sweet and enjoyable.  \n  - I would have liked more time spent between Ellery and Knox to make their deep connection more believable.  \n\n- **Plot and Pacing:**  \n  - The story is an easy read with little angst, making it light and enjoyable.  \n\n- **World-Building:**  \n  - The world-building is very cool and adds depth to the story.  \n\n**Conclusion:**  \nFT Lukens delivers another cute and fun YA urban fantasy with lovable characters, a sweet romance, and engaging world-building. While I wished for more development in the main romance, the overall story is an easy and enjoyable read.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Writing and Language",
            "Enjoyment and Engagement"
        ],
        "review": [
            "This book is sweet, magical, and delightfully cozy, crafting a warm and inviting atmosphere even amidst its frozen small-town backdrop.",
            "FT Lukens has quickly become a go-to author for readers seeking a comforting and emotionally satisfying experience, akin to a warm hug in book form."
        ],
        "conclusion": "This novel is a heartwarming and magical read that leaves me feeling comforted and eager to dive into more works by FT Lukens.",
        "rating": "4",
        "review_likes": "5",
        "reviewer_id": "29599654-kate",
        "reviewer_followers": "967 followers",
        "reviewer_review_nums": "1,537 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Tone and Atmosphere:**  \n  The book is described as \"sweet, magical, and delightfully cosy,\" creating a warm and inviting atmosphere despite its \"frozen small town setting.\"  \n\n- **Author's Style and Appeal:**  \n  F.T. Lukens is praised as a \"new go-to author\" for providing a comforting and emotionally satisfying reading experience, likened to \"a hug in a book.\"  \n\n- **Reader's Anticipation:**  \n  The reviewer expresses excitement and eagerness to explore the author's backlist, indicating a strong positive impression of the novel.  \n\n**Conclusion:**  \nThis novel is a heartwarming and magical read that leaves the reviewer feeling comforted and eager to dive into more works by F.T. Lukens.  \n\n**Rating Scores:**  \nNo specific rating scores are mentioned in the review."
    },
    {
        "aspects": [
            "Characters",
            "Enjoyment and Engagement"
        ],
        "review": [
            "Ellery is my favorite character—grumpy and cynical, a perfect foil to Knox's sunny disposition and endless energy. The supporting cast is outstanding; I'd gladly back a standalone novel featuring Charley and Zaba, as they add immense fun to the story. However, the ensemble of ragtag gods is equally well-crafted.",
            "I thoroughly enjoyed this book. Despite my busy schedule, it compelled me to carve out time for reading, allowing me to prioritize it over other tasks."
        ],
        "conclusion": "Otherworldly by FT Lukens is a captivating read that continues the author's tradition of creating inclusive and engaging universes. With well-developed characters, particularly the dynamic between Ellery and Knox, and a strong supporting cast, the book is both enjoyable and hard to put down.",
        "rating": "5",
        "review_likes": "5",
        "reviewer_id": "90983142-lovely-lloyd",
        "reviewer_followers": "6 followers",
        "reviewer_review_nums": "101 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Author's Consistency and Reputation:**  \n  I might be biased because this is the third novel by F.T. Lukens that I have read, and I haven't been disappointed yet. A friend from my book club expressed their appreciation for F.T. Lukens's universes, stating that it's refreshing to have non-binary characters coexist in a world without their non-binaryness being the center of the story. Otherworldly continues to deliver on this.  \n\n- **Character Development and Dynamics:**  \n  Ellery is my favorite character, the grumpy one in contrast to Knox's sunshine, the grouchy morning person to Knox's perpetual wakefulness, and the skeptic of Knox's existence. The supporting characters in this story are exceptional. I would support any calls for a stand-alone novel about Charley and Zaba, as they are an absolute blast! But our team of ragtag gods is nicely done too.  \n\n- **Engagement and Enjoyment:**  \n  I thoroughly enjoyed reading this book. Despite being extremely busy lately, it made me set aside time to read instead of letting other tasks interfere with my reading time.  \n\n**Conclusion:**  \nOtherworldly by F.T. Lukens is a captivating read that continues the author's tradition of creating inclusive and engaging universes. With well-developed characters, particularly the dynamic between Ellery and Knox, and a strong supporting cast, the book is both enjoyable and hard to put down.  \n\n**Rating Scores:**  \n⭐⭐⭐⭐✨ (4.5 stars, rounded up)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language"
        ],
        "review": [
            "I appreciated that the nonbinary character was portrayed as a person rather than a supernatural being in the relationship. As a nonbinary individual, this detail resonated with me.",
            "The author has a consistent formula for crafting their stories, and it resonates with me each time. I really enjoyed this book."
        ],
        "conclusion": "Overall, I enjoyed the book and appreciated the thoughtful representation of a nonbinary character, even though gender played a minimal role in the story. The writing formula continues to resonate with me.",
        "rating": "5",
        "review_likes": "5",
        "reviewer_id": "141964069-aster",
        "reviewer_followers": "12 followers",
        "reviewer_review_nums": "176 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Author's Writing Style and Formula:**  \n  F.T. Lukens has a certain formula for building their books, and it works (for me) every time. I really liked this book.  \n\n- **Representation and Character Dynamics:**  \n  I thought it was nice that the nonbinary character was a person and not the supernatural being in the relationship. As a nonbinary person, I appreciated this detail a lot.  \n\n- **Relevance of Gender in the Story:**  \n  Gender is incredibly not important in this story, which makes this detail fairly unimportant in the grand scheme of things, but it still stood out to me.  \n\n**Conclusion:**  \nOverall, I enjoyed the book and appreciated the thoughtful representation of a nonbinary character, even though gender played a minimal role in the story. F.T. Lukens' writing formula continues to resonate with me.  \n\n**Rating Scores:**  \n{No specific rating scores mentioned in the review.}"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Emotional Impact",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The plot was charming, whimsical, and enjoyable, offering a refreshing change of pace.",
            "The relationships in the story are both heartwarming and endearing. The wholesome romance and themes of found family enrich the narrative, adding depth and warmth.",
            "The mystical elements whisked me back to my fairy-tale-loving days.",
            "This book resonated deeply with me, evoking a sense of comfort and belonging. It truly tugged at my heartstrings, making it one of my favorite reads of 2023.",
            "This book was a delightful read, and I eagerly anticipate others experiencing it as well."
        ],
        "conclusion": "*Otherworldly* is a heartwarming, cozy, and whimsical novel that combines mystical elements, wholesome romance, and found family dynamics to create a story that feels like home. It’s a quirky and fun read that left a lasting emotional impact, making it one of my favorite books of 2023.",
        "rating": "5",
        "review_likes": "5",
        "reviewer_id": "119338947-ahaana-bhargava",
        "reviewer_followers": "117 followers",
        "reviewer_review_nums": "163 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Emotional Impact:**  \n  - The book spoke straight to my heart and made me feel like I was at home.  \n  - It tugged at my heartstrings and was one of my favorite books of 2023.  \n\n- **Relationships:**  \n  - The relationships in the story were the cutest and most heartwarming.  \n  - The wholesome romance and found family elements added depth and warmth to the narrative.  \n\n- **Plot and Atmosphere:**  \n  - The plot was cozy, quirky, and fun, providing a breath of fresh air.  \n  - The mystical elements transported me back to my fairy-tale-loving days.  \n\n- **Overall Experience:**  \n  - The book was a delightful read that I can’t wait for others to experience.  \n\n**Conclusion:**  \n*Otherworldly* is a heartwarming, cozy, and whimsical novel that combines mystical elements, wholesome romance, and found family dynamics to create a story that feels like home. It’s a quirky and fun read that left a lasting emotional impact, making it one of my favorite books of 2023.  \n\n**Rating Scores:**  \n4.5 stars"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language"
        ],
        "review": [
            "The story's pacing near the end was a significant improvement over the author's previous works, avoiding unnecessary drag. The premise of a familiar yearning for a taste of normalcy, juxtaposed with a protagonist skeptical of the supernatural, was executed brilliantly. The ending, inspired by the Orpheus and Eurydice myth but with a clever twist, was especially enjoyable and engaging.",
            "The characters were well-developed, making them feel authentic and engaging.",
            "The book's witty banter, romance, and overall tone create a delightful charm that makes it thoroughly enjoyable."
        ],
        "conclusion": "This is the best book by the author that I have read so far. The well-developed characters, engaging plot, and satisfying ending made it a thoroughly enjoyable experience. I loved it a lot and highly recommend it.",
        "rating": "4",
        "review_likes": "4",
        "reviewer_id": "124908030-ilse",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "122 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Plot and Themes:**  \n  - The concept of \"a familiar wanting a taste of a normal life\" and \"the person not believing in anything supernatural\" was executed brilliantly.  \n  - The ending, which drew inspiration from the Orpheus and Eurydice myth but with a successful twist, was particularly enjoyable and fun to read.  \n\n- **Character Development:**  \n  - All characters were very well fleshed out, making them feel real and engaging.  \n\n- **Pacing and Structure:**  \n  - The story did not drag on too much near the end, which was a noticeable improvement compared to other works by the author.  \n\n- **Writing Style and Tone:**  \n  - The banter, love, and overall tone of the book were fun and enjoyable, adding to the charm of the story.  \n\n**Conclusion:**  \nThis is the best book by F.T. Lukens that I have read so far. The well-developed characters, engaging plot, and satisfying ending made it a thoroughly enjoyable experience. I loved it a lot and highly recommend it.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Themes"
        ],
        "review": [
            "The pacing of the story felt uneven to me, primarily because it needed more world-building. This lack of depth ultimately disrupted the flow of the romance.",
            "The pacing issues led to an inconsistent romance, making it difficult for me to fully engage with that aspect of the story.",
            "I enjoyed the world and concepts presented in the story, but I felt that additional world-building was needed, which affected my overall experience.",
            "I appreciated the found family dynamic, which was a standout element of the novel and added significant depth to the story."
        ],
        "conclusion": "While the novel had its strengths, particularly in its world-building and found family theme, the pacing issues and uneven romance made it less satisfying compared to *Spell Bound*. Despite this, I remain a fan of the author and look forward to future works.",
        "rating": "4",
        "review_likes": "4",
        "reviewer_id": "108759418-mei",
        "reviewer_followers": "68 followers",
        "reviewer_review_nums": "406 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Overall Enjoyment:**  \n  The novel started out strong, but it didn't quite live up to my expectations compared to *Spell Bound*, which remains my favorite from Lukens. I still enjoyed it overall and will continue to read everything Lukens releases.\n  \n- **World-Building:**  \n  I liked the world and the concepts introduced in the story. However, I felt there was more world-building needed, which impacted my overall experience.\n\n- **Pacing:**  \n  The pacing didn’t work well for me. It felt uneven, especially since the story required more world-building, which in turn affected the flow of the romance.\n\n- **Romance:**  \n  The pacing issues also caused the romance to feel inconsistent or \"hiccupped\" for me, making it harder to fully engage with that aspect of the story.\n\n- **Themes and Relationships:**  \n  I appreciated the found family dynamic, which was a highlight of the novel and added depth to the story.\n\n**Conclusion:**  \nWhile the novel had its strengths, particularly in its world-building and found family theme, the pacing issues and uneven romance made it less satisfying compared to *Spell Bound*. Despite this, I remain a fan of Lukens and look forward to future works.\n\n**Rating Scores:**  \n3.5 (rounded up)."
    },
    {
        "aspects": [
            "Characters",
            "World-Building and Setting",
            "Expectation Fulfillment"
        ],
        "review": [
            "The novel boasts fun, likable, and relatable characters who are the heart of the story.",
            "The world-building strikes a perfect balance, offering sufficient detail to support the narrative without overshadowing the characters.",
            "OTHERWORLDLY is a charming queer fantasy YA romcom that beautifully captures the essence of young love and its accompanying angst. This relatable and engaging read resonates with readers, making it a delightful experience."
        ],
        "conclusion": "*OTHERWORLDLY* is a charming addition to the author's body of work, offering a perfect blend of fantasy, romance, and humor. The focus on character development and the relatable portrayal of young love make it a standout read.",
        "rating": "5",
        "review_likes": "4",
        "reviewer_id": "6542371-daniel",
        "reviewer_followers": "10 followers",
        "reviewer_review_nums": "123 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Genre and Themes:**  \n  OTHERWORLDLY is a delightful, queer, fantasy YA romcom. It captures the essence of young love with all its angsty yearning, making it a relatable and engaging read.  \n- **Characters:**  \n  The novel features fun, likable, and relatable characters who truly shine as the centerpieces of the story.  \n- **World-Building:**  \n  The world-building is well-balanced, providing just enough detail to follow the story without overshadowing the characters.  \n\n**Conclusion:**  \nOTHERWORLDLY is a charming addition to F.T. Lukens' body of work, offering a perfect blend of fantasy, romance, and humor. The focus on character development and the relatable portrayal of young love make it a standout read.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Emotional Impact",
            "Expectation Fulfillment"
        ],
        "review": [
            "The story revolves around Ellery, a supernatural skeptic striving to support their family through a grueling five-year winter, and Knox, a magical familiar from the Other World escaping his literal demons. The premise is engaging, and the accidental connection between Ellery and Knox creates a captivating narrative.",
            "The found family trope is masterfully executed, showcasing deep bonds forged through choice and mutual support. While the romance between Knox and Ellery is endearingly sweet, the story's emotional heart lies in the strength of their chosen family. The supporting cast, especially Charley, injects humor and depth into the group dynamic, making their relationships both heartwarming and entertaining.",
            "The writing excels in balancing humor, romance, and emotional depth, resulting in a well-rounded and satisfying narrative.",
            "The characters leave a lasting impression, warming the reader's heart and fostering a strong connection that lingers long after the book ends. The story is deeply comforting, blending heartfelt moments with laugh-out-loud humor.",
            "This novel is a charming mix of cozy and urban fantasy, offering a joyful and heartwarming reading experience. With its elements of magic, found family, and romance, it’s an ideal choice for fans of YA fantasy."
        ],
        "conclusion": "Otherworldly is a heartwarming and magical YA novel that masterfully blends cozy and urban fantasy. With its lovable characters, perfect execution of the found family trope, and a romance that tugs at the heartstrings, it’s a highly recommended read for anyone seeking a comforting and enchanting story.",
        "rating": "5",
        "review_likes": "4",
        "reviewer_id": "30525746-heather",
        "reviewer_followers": "31 followers",
        "reviewer_review_nums": "459 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Genre and Tone:**  \n  - The novel is a delightful blend of cozy and urban fantasy, creating a joyful and heartwarming reading experience.  \n  - It combines elements of magic, found family, and romance, making it a perfect fit for fans of YA fantasy.  \n\n- **Plot and Premise:**  \n  - The story follows Ellery, a supernatural skeptic struggling to support their family during a five-year-long winter, and Knox, a magical familiar from the Other World fleeing his literal demons.  \n  - The premise is engaging, with the accidental entanglement of Ellery and Knox leading to a captivating narrative.  \n\n- **Character Development and Relationships:**  \n  - The found family trope is executed to perfection, with deep bonds formed through choosing and fighting for one another.  \n  - The romance between Knox and Ellery is described as \"achingly adorable,\" but the emotional core lies in the strength of their chosen family.  \n  - The supporting cast, particularly Charley, adds humor and depth to the group dynamic, making the relationships both comforting and hilarious.  \n\n- **Emotional Impact:**  \n  - The characters leave a lasting impression, warming the reader's heart and creating a sense of connection long after the book is finished.  \n  - The story is deeply comforting, with moments that are both heartfelt and laugh-out-loud funny.  \n\n- **Writing Style and Execution:**  \n  - F.T. Lukens' writing shines in its ability to balance humor, romance, and emotional depth, creating a well-rounded and satisfying narrative.  \n\n**Conclusion:**  \n\"Otherworldly\" is a heartwarming and magical YA novel that masterfully blends cozy and urban fantasy. With its lovable characters, perfect execution of the found family trope, and a romance that tugs at the heartstrings, it’s a highly recommended read for anyone seeking a comforting and enchanting story.  \n\n**Rating Scores:**  \n- No specific numerical rating is mentioned in the review, but the reader highly recommends the book."
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "World-Building and Setting",
            "Enjoyment and Engagement"
        ],
        "review": [
            "I was disappointed by the portrayal of the gods and goddesses. They lacked the uniqueness and grandeur I expected, coming across more like ordinary humans, which felt underwhelming.",
            "This book leaned heavily on fanfiction tropes, which made for a cringeworthy reading experience. This style did not resonate with me and ultimately detracted from my enjoyment.",
            "The worldbuilding was one of the few aspects I appreciated. While it was intriguing and held potential, it ultimately wasn't enough to sustain the story.",
            "I found the book largely unengaging. Although I enjoyed the beginning and the ending, the middle section felt drawn out and failed to capture my interest."
        ],
        "conclusion": "While the book had some redeeming qualities, such as the worldbuilding and the cover, it ultimately fell flat for me. The pacing was slow, the tropes were overused, and the portrayal of divine characters was lackluster. Overall, this wasn’t my cup of tea.",
        "rating": "2",
        "review_likes": "4",
        "reviewer_id": "138863368-eilost",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "36 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Engagement and Pacing:**  \n  I found the book to be quite boring overall. While I liked the beginning and the ending, the middle part dragged and failed to hold my interest.  \n- **Worldbuilding:**  \n  The worldbuilding was one of the few aspects I enjoyed. It had potential and was intriguing, but it wasn’t enough to carry the story.  \n- **Characterization:**  \n  I was disappointed with how the gods and goddesses were portrayed. They didn’t feel special or unique; instead, they just seemed like ordinary humans, which was underwhelming.  \n- **Tropes and Writing Style:**  \n  The book relied heavily on fanfiction tropes, many of which made me cringe while reading. This style didn’t resonate with me and detracted from my enjoyment.  \n- **Aesthetic Appeal:**  \n  I appreciated the cover design—it was visually appealing and caught my attention.  \n\n**Conclusion:**  \nWhile the book had some redeeming qualities, such as the worldbuilding and the cover, it ultimately fell flat for me. The pacing was slow, the tropes were overused, and the portrayal of divine characters was lackluster. Overall, this wasn’t my cup of tea.  \n\n**Rating Scores:**  \n2/5⭐"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The story follows Ellery and Knox as they strike a deal: Ellery will teach Knox how to be human, while Knox will assist Ellery in unraveling the mystery of the endless winter and the goddess's silence. With Knox evading the shades and Ellery searching for answers to save their town, the stakes are high.",
            "In this engaging story, 17 or 18-year-old nonbinary protagonist Ellery grapples with disillusionment, having lost faith in the goddess due to an unending winter. To support their family's farm, they work at a diner during the summer. Knox, a charming familiar with a Golden Retriever-like energy, is on the run from witchy shades after his assigned human dies. The delightful grumpy-sunshine dynamic between Ellery and Knox is a standout feature, making their evolving relationship captivating. Secondary characters, including Ellery’s cousin and her girlfriend, enrich the narrative with depth and a sapphic element. The book offers meaningful representation with its queer nonbinary main character and sapphic supporting characters. Themes of faith, survival, and self-discovery are intricately woven throughout the story.",
            "Set in a magical world, the book unfolds in a town that has been trapped in winter for five years. This unending season creates a unique and captivating atmosphere that significantly enhances the story.",
            "The writing is engaging, and the magical world is beautifully crafted. Initially, I was confused by the setting, mistaking it for a nautical theme. However, I ultimately found the story to be excellent and thoroughly enjoyable."
        ],
        "conclusion": "This is a captivating and unique novel with a magical winter setting, compelling characters, and a heartwarming grumpy-sunshine dynamic. The queer representation and themes of faith and survival add depth to the story. I highly recommend giving it a shot—it’s a delightful read!",
        "rating": "5",
        "review_likes": "3",
        "reviewer_id": "95038132-anna",
        "reviewer_followers": "336 followers",
        "reviewer_review_nums": "1,838 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Setting and Atmosphere:**  \n  The book is set in a magical world where a specific town has been trapped in winter for five years. The perpetual winter creates a unique and intriguing atmosphere, which plays a significant role in the story.  \n\n- **Characters and Dynamics:**  \n  - Ellery, the 17 or 18-year-old nonbinary protagonist, is grumpy and has lost faith in the goddess due to the endless winter. They are spending their \"summer\" working at a diner to support their family's farm.  \n  - Knox, a familiar with \"Golden retriever cinnamon roll energy,\" is on the run from witchy shades after his assigned human dies. He is endearing and adds a lot of charm to the story.  \n  - The grumpy-sunshine dynamic between Ellery and Knox is a highlight, and their evolving relationship is engaging.  \n  - The secondary characters, including Ellery’s cousin and her girlfriend, add depth and a sapphic element to the story.  \n\n- **Plot and Conflict:**  \n  The story revolves around Ellery and Knox forming a deal: Ellery helps Knox learn how to be human, while Knox helps Ellery uncover the mystery behind the perpetual winter and the goddess’s silence. The stakes are high, with Knox evading the shades and Ellery seeking answers to save their town.  \n\n- **Representation and Themes:**  \n  The book features a queer nonbinary main character and sapphic secondary characters, which adds meaningful representation. Themes of faith, survival, and self-discovery are woven throughout the narrative.  \n\n- **Writing Style and Enjoyment:**  \n  The writing is engaging, and the magical world is well-crafted. Despite my initial confusion about the setting (mistaking it for an \"oceany\" book), I found the story to be super good and thoroughly enjoyable.  \n\n**Conclusion:**  \nThis is a captivating and unique novel with a magical winter setting, compelling characters, and a heartwarming grumpy-sunshine dynamic. The queer representation and themes of faith and survival add depth to the story. I highly recommend giving it a shot—it’s a delightful read!  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "World-Building and Setting"
        ],
        "review": [
            "From the very first page, the story captivates with its expertly woven plot that fuses myth and legend, particularly echoing the tale of Orpheus and Eurydice. However, the pacing quickens during the climax, leaving me wishing for more moments between Knox and Ellery before the resolution. Nonetheless, the novel’s length is ideal for a YA audience.",
            "The pairing of Ellery, a grumpy black cat, and Knox, a cheerful golden retriever, is one of my favorite combinations. Ellery's relatable struggle for survival in a forgotten, perpetually wintery world, coupled with their journey to overcome religious trauma, adds depth to the story. Knox, a creation of the goddess of the Other World, undergoes a dramatic transformation when his master’s soul is taken by the Shades, prompting him to flee and encounter Ellery. Their evolving relationship, which begins as a bargain to end the eternal winter and deepens into a heartfelt connection, is both compelling and heartwarming.",
            "The writing is captivating, striking a perfect balance of humor, warmth, and emotional depth. The narrative draws me in, making it difficult to put the story down.",
            "The world-building is rich and immersive, featuring a unique setting that balances magic and desolation. The integration of myth and legend adds depth, while themes of religious trauma and the quest for humanity resonate powerfully. An eclectic cast of characters, both human and otherworldly, further enhances the story's charm."
        ],
        "conclusion": "This novel is a delightful and engaging read, with a perfect blend of character-driven storytelling, myth-inspired plotlines, and rich world-building. While the pacing felt slightly rushed during the climax, the overall experience was thoroughly enjoyable, and I’m eagerly anticipating the next installment.",
        "rating": "4",
        "review_likes": "3",
        "reviewer_id": "130827902-michelle-easton",
        "reviewer_followers": "30 followers",
        "reviewer_review_nums": "540 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Character Dynamics:**  \n  The pairing of Ellery (grumpy black cat) and Knox (sunshine golden retriever) is one of my favorite combinations. Ellery is relatable as they navigate survival in a forgotten, perpetually wintery world while overcoming religious trauma. Knox, a creation of the goddess of the Other World, experiences a dramatic shift when his master’s soul is collected by the Shades, leading him to flee and cross paths with Ellery. Their evolving relationship, from a bargain to stop eternal winter to a deeper connection, is compelling and heartwarming.\n\n- **Plot and Pacing:**  \n  The story is engaging from the very first page, with a well-crafted plot that blends myth and legend, particularly drawing inspiration from Orpheus and Eurydice. However, the pacing felt rushed during the climax, and I wished for more scenes of Knox and Ellery spending time together before the story’s resolution. Despite this, the novel’s length is perfect for a YA audience.\n\n- **World-Building and Themes:**  \n  The world-building is rich and immersive, with a unique setting that feels both magical and desolate. The incorporation of myth and legend adds depth, and the exploration of themes like religious trauma and the search for humanity resonates strongly. The eclectic cast of characters, both human and otherworldly, enhances the story’s charm.\n\n- **Writing Style and Tone:**  \n  The writing is captivating, with a tone that balances humor, warmth, and emotional depth. The narrative effectively pulls the reader into the story, making it hard to put down.\n\n**Conclusion:**  \nThis novel is a delightful and engaging read, with a perfect blend of character-driven storytelling, myth-inspired plotlines, and rich world-building. While the pacing felt slightly rushed during the climax, the overall experience was thoroughly enjoyable, and I’m eagerly anticipating the next installment.\n\n**Rating Scores:**  \n4.5/5 (rounded down to 4 stars due to the rushed climax)."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Expectation Fulfillment"
        ],
        "review": [
            "The pacing is slower, focusing on character development, but it remains engaging throughout.",
            "The story centers on its characters, making them the heart of the narrative.",
            "The universe is captivating, and I would love to see more books set within it, exploring different characters and the expanded possibilities of the magic system.",
            "This charming, cozy fantasy features a delightful romance with minimal spice. It beautifully explores themes of found family and acceptance, enhanced by elements of magic and other realms."
        ],
        "conclusion": "This cozy fantasy delivers a heartwarming story with a focus on characters, found family, and a touch of magic. While the pacing is slower, it remains engaging, and the world leaves room for potential expansion in future books.",
        "rating": "4",
        "review_likes": "4",
        "reviewer_id": "9556468-aly",
        "reviewer_followers": "3,014 reviews",
        "reviewer_review_nums": "3,014 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Genre and Tone:**  \n  - This is a sweet, cozy fantasy with a cute, low-spice romance.  \n  - The story includes themes of found family and acceptance, along with elements of magic and other realms.  \n\n- **Character Development:**  \n  - The main focus of the story is on the characters, which makes them the heart of the narrative.  \n\n- **Pacing:**  \n  - The pacing is slower due to the emphasis on character development, but it is not boring.  \n\n- **World-Building and Potential:**  \n  - The universe is intriguing, and I would love to see more books set in this world, possibly exploring other characters and the further possibilities of the magic system.  \n\n**Conclusion:**  \nThis cozy fantasy delivers a heartwarming story with a focus on characters, found family, and a touch of magic. While the pacing is slower, it remains engaging, and the world leaves room for potential expansion in future books.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Enjoyment and Engagement"
        ],
        "review": [
            "The story starts off slowly, but the second half is significantly more enjoyable."
        ],
        "conclusion": "Overall, I enjoyed the book, particularly the second half, though it didn’t captivate me as much as the author’s previous work.",
        "rating": "4",
        "review_likes": "3",
        "reviewer_id": "82576214-kristen",
        "reviewer_followers": "100 reviews",
        "reviewer_review_nums": "100 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Engagement and Pacing:**  \n  I found the beginning hard to get into, but the later half of the book was much more enjoyable.  \n- **Comparison to Other Works:**  \n  I liked this one, just not as much as Lukens' other book I read earlier this year.  \n\n**Conclusion:**  \nOverall, I enjoyed the book, particularly the second half, though it didn’t captivate me as much as the author’s previous work.  \n\n**Rating Scores:**  \n3.5 stars (rounded up)."
    },
    {
        "aspects": [
            "Writing and Language"
        ],
        "review": [
            "One of my favorite lines from the book is: “‘I wish my boyfriend looked at me the way he looks at you,’ she said, leaning against the hostess stand. ‘How did you convince him that you hung the moon?’” This line resonated with me for its sweetness and its perfect encapsulation of the story's tone."
        ],
        "conclusion": "Overall, this was a sweet and enjoyable read. I appreciated the refreshing approach to representation and the charming dialogue that added to the story’s warmth.",
        "rating": "3",
        "review_likes": "3",
        "reviewer_id": "46017240-peter",
        "reviewer_followers": "2 followers",
        "reviewer_review_nums": "202 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation of Gender and Sexuality:**  \n  I appreciate how in Lukens’ books, there’s never a big deal made about coming out or addressing gender and sexuality. It feels refreshing and natural, which I really enjoyed.  \n\n- **Dialogue and Writing Style:**  \n  My favorite line from the book was: “‘I wish my boyfriend looked at me the way he looks at you,’ she said, leaning against the hostess stand. ‘How did you convince him that you hung the moon?’” This line stood out to me because it was sweet and captured the tone of the story perfectly.  \n\n**Conclusion:**  \nOverall, this was a sweet and enjoyable read. I appreciated the refreshing approach to representation and the charming dialogue that added to the story’s warmth.  \n\n**Rating Scores:**  \nNo specific rating scores mentioned in the review."
    },
    {
        "aspects": [
            "Characters",
            "Themes"
        ],
        "review": [
            "The characters in Otherworldly truly shine, with their distinct personalities bringing depth to the narrative. Ellery’s charming grumpiness, Knox’s child-like wonder, Charley’s big heart, and Zada’s badass attitude are all vividly portrayed, making them memorable and engaging.",
            "The grumpXsunshine trope was beautifully executed, adding a delightful dynamic to the narrative. The cozy magical vibes and the idea of befriending moody minor gods crafted a unique and enchanting atmosphere."
        ],
        "conclusion": "*Otherworldly* is a cozy, magical, and joyfully queer novel that delivers on all fronts. The standout characters, engaging tropes, and enchanting themes make it a delightful read that feels like a warm hug.",
        "rating": "4",
        "review_likes": "4",
        "reviewer_id": "150500211-hunter-everneverbooks",
        "reviewer_followers": "24 followers",
        "reviewer_review_nums": "28 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Character Development:**  \n  The characters in \"Otherwordly\" stood out the most. Ellery’s endearingly grumpy personality, Knox’s child-like wonder, Charley’s big heart, and Zada’s badass disposition were all vividly portrayed and added depth to the story.  \n- **Tropes and Themes:**  \n  The grumpXsunshine trope was executed beautifully, adding a delightful dynamic to the narrative. The cozy magical vibes and the concept of befriending moody minor gods created a unique and enchanting atmosphere.  \n- **Queer Representation:**  \n  Like all of FT Lukens' works, this book is full of queer joy, which made the story feel inclusive and heartwarming.  \n\n**Conclusion:**  \n\"Otherwordly\" by FT Lukens is a cozy, magical, and joyfully queer novel that delivers on all fronts. The standout characters, engaging tropes, and enchanting themes make it a delightful read that feels like a warm hug.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes",
            "Expectation Fulfillment"
        ],
        "review": [
            "As a reader primarily of YA literature, I found the complexity and pacing of this book occasionally juvenile. However, I believe young adult readers will appreciate it and find comfort in its themes. Had I read it in high school, I would have absolutely loved it.",
            "The characters truly stood out to me, each possessing a distinct personality and charm, including the secondary ones. Zada and Charley were especially memorable, as they effectively highlighted the themes of self-discovery, emotional authenticity, and the acceptance of love and diverse perspectives.",
            "This story beautifully weaves together a sweet romance with themes of found family and star-crossed lovers. It adeptly explores self-discovery, emotional authenticity, and the acceptance of love across differing perspectives, resonating deeply with readers.",
            "I appreciated the concept of gods, goddesses, and supernatural beings concealed in the everyday world. However, I believe the fantasy elements could have been further developed. The stakes felt insufficiently high and complex, which diminished my investment in the story and the characters' decisions, ultimately resulting in a somewhat underwhelming climax."
        ],
        "conclusion": "This was a cute and heartwarming story with memorable characters and sweet romance. While the fantasy elements and stakes could have been more developed, it remains a comforting and enjoyable read, especially for young adult audiences.",
        "rating": "3",
        "review_likes": "3",
        "reviewer_id": "159464139-april",
        "reviewer_followers": "5 followers",
        "reviewer_review_nums": "74 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Characters:**  \n  The characters were definitely the highlight for me. Each one had their own unique personality and spark, even the secondary characters. Zada and Charley were particularly memorable because they helped emphasize and reiterate themes of self-discovery, emotional authenticity, and acceptance of love and differing perspectives.  \n\n- **Romance and Themes:**  \n  The story had a sweet romance, found family, and star-crossed lovers. Themes of self-discovery, emotional authenticity, and acceptance of love and differing perspectives were well-explored and resonated deeply.  \n\n- **Fantasy Elements:**  \n  While I enjoyed the concept of gods, goddesses, the “other world,” and supernatural beings hiding in plain sight, I felt the fantasy elements could have been further explored and developed. The stakes didn’t feel high or complex enough for me to fully invest in the story or many of the characters' decisions, which led to a slightly underwhelming climax.  \n\n- **Pacing and Complexity:**  \n  As someone who predominantly reads YA books, I found the overall complexity and pacing to be a bit juvenile at times. However, I think young adult readers will enjoy this book and find a lot of comfort in it. If I had read it in high school, I would have absolutely loved it.  \n\n- **Overall Enjoyment:**  \n  As my first F.T. Lukens book, it was a fun and cozy read. I would definitely pick up another one of their books in the future!  \n\n**Conclusion:**  \nThis was a cute and heartwarming story with memorable characters and sweet romance. While the fantasy elements and stakes could have been more developed, it remains a comforting and enjoyable read, especially for young adult audiences.  \n\n**Rating Scores:**  \nNo specific rating scores were mentioned in the review.  \n\nThank you NetGalley & publisher for providing me an advanced copy!"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes"
        ],
        "review": [
            "The storytelling is captivating, featuring intriguing elements such as crossroads bargains, eternal winter, and otherworldly settings. The plot is engaging and maintains your interest from beginning to end.",
            "The characters are endearing and well-developed, enriching the narrative. The book excels in representation, particularly in its depiction of queer joy and diverse identities.",
            "This enchanting supernatural YA fantasy exudes cozy vibes and features magical moments alongside remarkable representation. It beautifully explores themes of found family, queer joy, and the delightful contrast of grumpy/sunshine dynamics."
        ],
        "conclusion": "FT Lukens has crafted another fantastic novel that combines magical moments, cozy vibes, and amazing representation. With lovable characters, captivating storytelling, and a supernatural YA fantasy setting, this book is a joy to read.",
        "rating": "5",
        "review_likes": "2",
        "reviewer_id": "148439986-tara-kat-magnoliapigeonbookblurbs",
        "reviewer_followers": "53 followers",
        "reviewer_review_nums": "816 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Cover Design:**  \n  The cover is absolutely gorgeous and immediately drew me in.  \n\n- **Characters:**  \n  The characters are lovable and well-developed, adding depth to the story.  \n\n- **Genre and Themes:**  \n  This is a supernatural YA fantasy with cozy vibes, magical moments, and amazing representation. It includes themes like found family, queer joy, and grumpy/sunshine dynamics.  \n\n- **Plot and Storytelling:**  \n  The storytelling is captivating, with elements like crossroads bargains, eternal winter, and otherworldly settings. The plot is engaging and keeps you hooked from start to finish.  \n\n- **Representation:**  \n  The book features incredible representation, particularly in its portrayal of queer joy and diverse characters.  \n\n- **Overall Enjoyment:**  \n  The book was an absolute delight to read, and I’m eagerly anticipating F.T. Lukens’ next fantastical tale.  \n\n**Conclusion:**  \nF.T. Lukens has crafted another fantastic novel that combines magical moments, cozy vibes, and amazing representation. With lovable characters, captivating storytelling, and a supernatural YA fantasy setting, this book is a joy to read.  \n\n**Rating Scores:**  \nNot explicitly mentioned in the review, but the tone suggests a highly positive rating."
    },
    {
        "aspects": [
            "Themes",
            "Expectation Fulfillment"
        ],
        "review": [
            "The story prioritizes the human aspect over the supernatural, which ultimately feels like a missed opportunity. Embracing the supernatural elements could have made it significantly more engaging.",
            "I once regarded this author as one of my favorites, but my interest has waned since *So This is Ever After* (I believe that's the title). While *Spell Bound* didn't impress me either, I found it offered more than this latest work."
        ],
        "conclusion": "Overall, I’m being generous with my opinion because there isn’t much to highlight. The book falls short compared to the author’s previous works and feels like a less impressive take on familiar mythological themes. It lacks depth and misses opportunities to explore its supernatural potential.",
        "rating": "3",
        "review_likes": "2",
        "reviewer_id": "159123312-lex",
        "reviewer_followers": "22 followers",
        "reviewer_review_nums": "136 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Author's Previous Work and Expectations:**  \n  I used to consider Lukens one of my favorite authors, but since \"So This is Ever After\" (I think that’s the title, lol), I’ve lost some interest. \"Spell Bound\" wasn’t my favorite either, but at least I felt it had more to offer than this one.\n\n- **Comparison to Other Works:**  \n  This book feels like a cheap version of Percy Jackson, with all the mythology, absurd jokes (though lacking in quality), and the silly way they trick the gods and creatures. It doesn’t live up to the standard set by those kinds of stories.\n\n- **Focus and Themes:**  \n  The story focuses more on the human aspect rather than the supernatural, which I feel wastes a lot of potential. It could have been much more engaging if it leaned into the supernatural elements.\n\n**Conclusion:**  \nOverall, I’m being generous with my opinion because there isn’t much to highlight. The book falls short compared to the author’s previous works and feels like a less impressive take on familiar mythological themes. It lacks depth and misses opportunities to explore its supernatural potential.\n\n**Rating Scores:**  \nNo specific rating scores mentioned in the review."
    },
    {
        "aspects": [
            "Writing and Language",
            "World-Building and Setting"
        ],
        "review": [
            "I'm savoring each word like a newborn kitten, allowing myself to be enveloped by the warmth of blankets and hot cider.",
            "I adored the world-building in this book. It left me wishing for a 600-page, *American Gods*-style expansion. It’s the perfect read for the onset of winter, and I can only imagine how much more enchanting it will be during the early dusk, with snow sparkling all around."
        ],
        "conclusion": "This novel is a beautifully crafted work that showcases the author's growth and mastery of storytelling. Its immersive world-building, evocative writing style, and seasonal charm make it a perfect read for winter.",
        "rating": "4",
        "review_likes": "2",
        "reviewer_id": "61192938-mark-ta-effenbergerov",
        "reviewer_followers": "4 followers",
        "reviewer_review_nums": "143 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Author's Growth and Storytelling Skill:**  \n  I love watching the writers grow throughout their books. Third time is the charm, and now I have no doubts about the author's storytelling skill.  \n\n- **Writing Style and Emotional Connection:**  \n  I'm caressing each word like a newborn kitten and letting myself succumb to the promise of blankets and hot cider.  \n\n- **World-Building:**  \n  I loved the world-building. Can we get a 600-page *American Gods*-like version?  \n\n- **Seasonal Appeal and Atmosphere:**  \n  This book was perfect for the beginning of winter. I promise it's gonna be even better in the early dusk glittering in the snow.  \n\n**Conclusion:**  \nThis novel is a beautifully crafted work that showcases the author's growth and mastery of storytelling. Its immersive world-building, evocative writing style, and seasonal charm make it a perfect read for winter.  \n\n**Rating Scores:**  \n4.5 stars and all the hearts on top of it."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Enjoyment and Engagement"
        ],
        "review": [
            "Although the middle section was somewhat slow, it did not significantly diminish the overall experience.",
            "Overall, the book was enjoyable and entertaining. While it lagged slightly in the middle, it never felt boring. The final chapter, however, truly elevated my experience and left me with a strong 5-star impression."
        ],
        "conclusion": "This book was a fun and engaging read, despite some pacing issues in the middle. The last chapter was particularly impactful, leaving me with a strong positive impression. It’s a great choice for anyone seeking a light and enjoyable story.",
        "rating": "5",
        "review_likes": "2",
        "reviewer_id": "158180364-camryn",
        "reviewer_followers": "18 reviews",
        "reviewer_review_nums": "18 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Engagement and Enjoyment:**  \n  - The book was pretty fun overall.  \n  - It dragged a bit in the middle but was never flat-out boring.  \n  - The last chapter gave me a 5-star feeling, which elevated my overall enjoyment.  \n\n- **Recommendation:**  \n  - I would recommend this book to anyone looking for a light, enjoyable read.  \n\n- **Pacing:**  \n  - While the middle section felt a bit slow, it didn’t detract significantly from the overall experience.  \n\n**Conclusion:**  \nThis book was a fun and engaging read, despite some pacing issues in the middle. The last chapter was particularly impactful, leaving me with a strong positive impression. It’s a great choice for anyone seeking a light and enjoyable story.  \n\n**Rating Scores:**  \n4.5 stars (rounded up)."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "World-Building and Setting",
            "Expectation Fulfillment"
        ],
        "review": [
            "The story follows Ellery and Knox as their relationship deepens throughout the unfolding plot. Central mysteries, including Knox's involvement in various antics and the reason behind the city's endless winter, propel the narrative forward.",
            "The novel takes place in an alternate present, rich with goddesses, dryads, and other magical elements. The intriguing concept of a city ensnared in eternal winter enhances the setting's depth and allure.",
            "This book belongs to the fantasy genre, seamlessly blending reality with magic. While it offers a pleasant and easy reading experience, it largely adheres to conventional fantasy tropes, earning it the label of \"fantastic vanilla.\""
        ],
        "conclusion": "This novel offers a pleasant and easy-to-read fantasy experience with an intriguing alternate-present setting and a central mystery. While it doesn't break new ground in the genre, it provides a satisfying blend of reality and magic.",
        "rating": "4",
        "review_likes": "2",
        "reviewer_id": "8674327-anthony",
        "reviewer_followers": "15 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**  \n- **World-Building:**  \n  The novel is set in an alternate present featuring goddesses, dryads, and other magical elements. The concept of a city trapped in permanent winter adds an intriguing layer to the setting.  \n\n- **Plot and Mystery:**  \n  The story revolves around Ellery and Knox, whose relationship deepens as the plot unfolds. The central mysteries—Knox's involvement in certain shenanigans and the cause of the city's perpetual winter—drive the narrative forward.  \n\n- **Genre and Tone:**  \n  The book falls into the fantasy genre, blending reality with magic. It is described as a pleasant and easy read, though it doesn't deviate significantly from conventional fantasy tropes, earning it the label of \"fantastic vanilla.\"  \n\n- **Comparisons:**  \n  The reviewer compares this novel to the *Rivers of London* series, which they enjoy for its mix of reality and magic. While this book is enjoyable, it doesn't stand out as much as that series.  \n\n**Conclusion:**  \nThis novel offers a pleasant and easy-to-read fantasy experience with an intriguing alternate-present setting and a central mystery. While it doesn't break new ground in the genre, it provides a satisfying blend of reality and magic.  \n\n**Rating Scores:**  \n4/5"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting"
        ],
        "review": [
            "The pacing became awkward during the climax, as the resolution of the conflict felt rushed.",
            "Knox's character was enjoyable, evoking a desire at times to simply give him a hug.",
            "The world-building was captivating, and I enjoyed exploring how the characters adapted to their reality."
        ],
        "conclusion": "While the novel had strong elements like engaging world-building and enjoyable character development, the pacing issues during the climax detracted from the overall experience.",
        "rating": "2",
        "review_likes": "2",
        "reviewer_id": "103872712-izzys-internet-bookshelf",
        "reviewer_followers": "68 followers",
        "reviewer_review_nums": "1,923 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **World Building:**  \n  The world-building was so interesting. I loved getting to know the characters and how they have adjusted to their reality.  \n\n- **Character Development:**  \n  Knox's character was fun to read about, though there were times when I just wanted to hug him.  \n\n- **Pacing:**  \n  The pacing got really weird towards the climax. It felt way too fast when they were trying to resolve the conflict.  \n\n**Conclusion:**  \nWhile the novel had strong elements like engaging world-building and enjoyable character development, the pacing issues during the climax detracted from the overall experience.  \n\n**Rating Scores:**  \n2.75/5"
    },
    {
        "aspects": [
            "Characters"
        ],
        "review": [
            "I absolutely loved the characters; they were a standout highlight of the story for me."
        ],
        "conclusion": "This novel was an incredibly enjoyable read, with characters that deeply resonated with me. While it may not be the best book I’ve encountered, it was a thoroughly satisfying experience.",
        "rating": "5",
        "review_likes": "2",
        "reviewer_id": "92350644-sophie",
        "reviewer_followers": "8 followers",
        "reviewer_review_nums": "151 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Overall Enjoyment:**  \n  This book just scratched all the right parts in my brain. I loved it so much. While it may not be the best book I’ve ever read, I enjoyed the hell out of it.  \n- **Character Development:**  \n  I loved these characters so, so much. They were a major highlight of the story for me.  \n\n**Conclusion:**  \nThis novel was an incredibly enjoyable read, with characters that deeply resonated with me. While it may not be the best book I’ve encountered, it was a thoroughly satisfying experience.  \n\n**Rating Scores:**  \nNo specific rating scores mentioned in the review."
    },
    {
        "aspects": [
            "Themes",
            "Emotional Impact"
        ],
        "review": [
            "I appreciated the theme of found family, which truly stood out in the story.",
            "This book was incredibly comforting and sweet, culminating in a deeply emotional payoff that moved me to tears."
        ],
        "conclusion": "This novel is a heartwarming and emotionally resonant read, with a strong focus on found family and a deeply satisfying conclusion.",
        "rating": "4",
        "review_likes": "2",
        "reviewer_id": "157043359-alina-rossi",
        "reviewer_followers": "3 followers",
        "reviewer_review_nums": "237 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Comfort and Emotional Impact:**  \n  - The book was incredibly comforting and sweet.  \n  - The emotional payoff at the end was so good that it brought me to tears.  \n\n- **Themes and Character Dynamics:**  \n  - I loved the theme of found family, which was a highlight of the story.  \n\n**Conclusion:**  \nThis novel by F.T. Lukens is a heartwarming and emotionally resonant read, with a strong focus on found family and a deeply satisfying conclusion.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The story's pacing failed to engage me, leaving me feeling bored. This may stem from my personal preference, as I'm not typically drawn to young adult romance.",
            "I thoroughly enjoyed the non-binary representation and the lesbian relationship in the novel. This aspect was a significant highlight for me and the primary reason I rated the book higher.",
            "The world-building was slow and underdeveloped, leaving me confused about the story's setting, which felt like it was simply in the middle of nowhere. More specific details would have made the narrative more immersive and engaging.",
            "Despite my efforts to enjoy the book, I had to stop reading at nearly 50%. The slow world-building, coupled with my disinterest in the romance genre, made it challenging to stay engaged."
        ],
        "conclusion": "While I appreciated the representation of non-binary and lesbian characters, the slow world-building and lack of specific setting details made the story hard to connect with. Combined with my general disinterest in young adult romance, I found the book boring and couldn’t finish it.",
        "rating": "2",
        "review_likes": "2",
        "reviewer_id": "165037186-rachel-ritter",
        "reviewer_followers": "53 reviews",
        "reviewer_review_nums": "53 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation:**  \n  - I absolutely loved the non-binary representation and the lesbian relationship in the novel. This aspect was a strong positive for me and is the main reason I didn’t give the book a lower rating.  \n\n- **World-Building:**  \n  - The world-building felt slow and underdeveloped. I struggled to understand where the story was set, as it was only described as \"the middle of nowhere.\" More specific details about the setting would have made the story more immersive and engaging.  \n\n- **Plot and Pacing:**  \n  - The pacing of the story didn’t hold my interest, and I found myself bored. This might be partly due to my personal preference, as I’m not generally a fan of young adult romance.  \n\n- **Personal Enjoyment:**  \n  - Despite my efforts to like the book, I ultimately had to stop reading at nearly 50%. The combination of slow world-building and my lack of interest in the romance genre made it difficult for me to continue.  \n\n**Conclusion:**  \nWhile I appreciated the representation of non-binary and lesbian characters, the slow world-building and lack of specific setting details made the story hard to connect with. Combined with my general disinterest in young adult romance, I found the book boring and couldn’t finish it.  \n\n**Rating Scores:**  \n- No specific numerical rating was provided, but the reviewer implies a rating higher than what they might have given due to the positive representation."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Expectation Fulfillment"
        ],
        "review": [
            "The story features some wonderful moments, but its pacing is uneven, with certain sections dragging and leading to disconnection or boredom. Ultimately, it lacks that final spark of magic needed to fully captivate the audience.",
            "The non-binary lead is a standout aspect of the story, and the strong friendships among the characters are well-developed and engaging. The romance is charming, capturing the awkwardness of first love. However, it feels rushed, with the connection between the two leads developing too quickly and lacking depth.",
            "The winter fantasy setting is expertly crafted, providing a unique backdrop that enhances both the story and its characters.",
            "The fantasy elements enhance the narrative without overshadowing the plot, making for a delightful touch rather than an epic saga."
        ],
        "conclusion": "Overall, this is a nice YA romantasy with a lot of charm, particularly in its setting, representation, and cute moments. However, the rushed romance and uneven pacing prevent it from being a fully immersive experience.",
        "rating": "3",
        "review_likes": "2",
        "reviewer_id": "10100584-kassu",
        "reviewer_followers": "17 followers",
        "reviewer_review_nums": "609 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Setting and Atmosphere:**  \n  The winter fantasy setting is well-crafted and adds a lot to the story. It creates a unique backdrop for the events and characters.  \n\n- **Characters and Representation:**  \n  The non-binary lead is a standout feature, and the strong friendships between several characters are well-developed and engaging.  \n\n- **Romance:**  \n  The romance is super cute and filled with awkward first-love moments. However, it feels rushed, and the connection between the two leads seems to happen too quickly, lacking depth.  \n\n- **Fantasy Elements:**  \n  The fantasy elements are pretty good, though the story doesn’t aim to be an epic saga. They add flavor to the narrative but don’t dominate the plot.  \n\n- **Pacing and Engagement:**  \n  While there are wonderful moments, the pacing can feel uneven, with some parts dragging and causing disconnection or boredom. The story lacks that final spark of magic to fully captivate.  \n\n**Conclusion:**  \nOverall, this is a nice YA romantasy with a lot of charm, particularly in its setting, representation, and cute moments. However, the rushed romance and uneven pacing prevent it from being a fully immersive experience.  \n\n**Rating Scores:**  \n3.5⭐"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Writing and Language",
            "Expectation Fulfillment"
        ],
        "review": [
            "The novel's slow pace enhances its cozy and relaxed atmosphere. The Orpheus/Eurydice moment near the end is especially striking, providing just the right amount of angst.",
            "The story is charming and endearingly cheesy, exuding a lighthearted and romantic vibe.",
            "The characters' pining and yearning are skillfully portrayed, adding significant emotional depth to the story."
        ],
        "conclusion": "This cozy romantasy novel offers a slow-paced, heartwarming experience with a perfect balance of cuteness, cheese, and emotional moments. The pining and the Orpheus/Eurydice-inspired scene stand out as highlights, making it an enjoyable read for fans of lighthearted romance with a touch of angst.",
        "rating": "3",
        "review_likes": "2",
        "reviewer_id": "119341561-krys",
        "reviewer_followers": "15 followers",
        "reviewer_review_nums": "104 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Pacing:** The novel is slow-paced, which contributes to its cozy and relaxed atmosphere.  \n- **Tone and Style:** The story is described as cute and cheesy, with a lighthearted and romantic feel.  \n- **Romantic Elements:** The pining and yearning between characters are well-executed and add emotional depth.  \n- **Plot Highlights:** The Orpheus/Eurydice moment towards the end is particularly impactful, delivering the right amount of angst.  \n\n**Conclusion:**  \nThis cozy romantasy novel offers a slow-paced, heartwarming experience with a perfect balance of cuteness, cheese, and emotional moments. The pining and the Orpheus/Eurydice-inspired scene stand out as highlights, making it an enjoyable read for fans of lighthearted romance with a touch of angst.  \n\n**Rating Scores:**  \n3.5 🌟"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Emotional Impact"
        ],
        "review": [
            "While the plot felt somewhat predictable due to its reliance on a familiar myth, I still appreciated the charming moments throughout the story. The ending was nearly perfect, providing a satisfying resolution for Ellery and Knox. However, I wished for a bit more closure regarding Ellery's relationship with their parents.",
            "I thoroughly enjoyed the characters in this story. Knox was a delightful presence, especially with his bucket list of quintessential teenage experiences. Ellery, my favorite, underwent remarkable development, learning to prioritize themselves and trust others. Their journey was filled with love, kindness, grit, and determination, making them utterly lovable. The side characters also shone brightly, contributing to a wonderfully quirky found family that blossomed throughout the book.",
            "I’m still amazed that a story about a town trapped in winter could warm my heart so much. This book was absolutely adorable and met all my expectations for FT Lukens."
        ],
        "conclusion": "This heartwarming novel, despite its predictable plot, shines through its lovable characters, emotional depth, and the charming found-family dynamic. While the ending could have provided more closure for Ellery and their parents, it remains a delightful and highly recommended read.",
        "rating": "4",
        "review_likes": "2",
        "reviewer_id": "102424750-grace",
        "reviewer_followers": "10 followers",
        "reviewer_review_nums": "298 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Emotional Impact:**  \n  - \"I will never be over how a book about a town trapped in winter managed to warm my heart so much.\"  \n  - \"This book was absolutely adorable and everything I have come to expect from F.T. Lukens.\"  \n\n- **Characters:**  \n  - \"I loved the characters. Knox was such a fun person, and I loved his bucket list of human teenage things to do.\"  \n  - \"Ellery was my favorite. They had such amazing development, learning to put themselves first and trust those around them. They also have so much love, kindness, grit, and determination in their heart. It was impossible not to adore them.\"  \n  - \"The side characters were also fantastic, and I loved the weird little found family that was created over the course of the book.\"  \n\n- **Plot:**  \n  - \"I found the plot a bit predictable because of how it follows a well-known myth, but I still enjoyed the little moments along the way.\"  \n  - \"The ending was almost perfect, with great resolution for Ellery and Knox. However, I wanted a bit more resolution for Ellery and their parents.\"  \n\n- **Overall Recommendation:**  \n  - \"Overall, this book was absolutely adorable, and I highly recommend it.\"  \n\n**Conclusion:**  \nThis heartwarming novel, despite its predictable plot, shines through its lovable characters, emotional depth, and the charming found-family dynamic. While the ending could have provided more closure for Ellery and their parents, it remains a delightful and highly recommended read.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language"
        ],
        "review": [
            "The author excels at crafting characters with rich backstories and heartwarming relationships. I quickly fell in love with them, especially Charley, who was both hilarious and relatable. Ellery was simply adorable, and I found myself rooting for both of them. Zada brought joy every time she appeared, and her chemistry with Charley was delightful. Knox, too, was a character I deeply empathized with; he truly deserves the world.",
            "The writing in this story is exceptional. The author's captivating style consistently draws me in, and I appreciate their seamless balance of romance and plot."
        ],
        "conclusion": "This novel is a delightful, heartwarming read with well-crafted characters and a seamless blend of romance and plot. It’s a cozy and enjoyable experience that leaves a lasting impression.",
        "rating": "5",
        "review_likes": "2",
        "reviewer_id": "149098675-nay",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "77 reviews",
        "reformatted_ori_review": "**Aspects:**\n\n- **Overall Enjoyment:**  \n  Absolutely loved it. F.T. Lukens has done it again!!! Absolutely AMAZING and so wholesome. This was such a cozy, relaxing, and fun read!\n\n- **Character Development:**  \n  F.T. Lukens does a fantastic job of writing characters with complex backstories and the most wholesome relationships ever. I fell in love with these characters, but Charley may have been my favorite. She was just so funny and so much like myself that it was easy to enjoy her character! Ellery was just adorable. They were truly a gem, and I wanted nothing but the best for them. Zada was a joy whenever her name popped up! Her and Charley were so lovely together. Knox was so easy to feel for. He deserves the world.\n\n- **Writing Style:**  \n  The writing was very well done. There’s something about the author’s writing style that immediately pulls me in every time. I love how they balance the romance and plot perfectly and seamlessly.\n\n- **Acknowledgments:**  \n  Thank you NetGalley and publisher for the ARC in exchange for an honest review. All thoughts and opinions are my own!\n\n**Conclusion:**  \nThis novel by F.T. Lukens is a delightful, heartwarming read with well-crafted characters and a seamless blend of romance and plot. It’s a cozy and enjoyable experience that leaves a lasting impression.\n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "World-Building and Setting",
            "Emotional Impact",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The plot is expertly crafted, culminating in a satisfying conclusion where all elements come together beautifully. It earns a score of 4 due to minor areas for improvement. The pacing is excellent, maintaining engagement throughout and deserving of a 5. While the story is logical and cohesive overall, it receives a score of 4 for minor inconsistencies that could have been addressed.",
            "The characters are the highlight of the book. They are well-developed, endearing, and have fantastic interactions. I absolutely adore them, giving this aspect a score of 5.",
            "The writing is outstanding, deserving a perfect score of 5.",
            "The worldbuilding is solid and immersive, earning a score of 4 for its rich detail, though it could benefit from being slightly more expansive.",
            "This book brought me to tears, made me smile, and left me swooning. It was an emotional rollercoaster that I thoroughly enjoyed.",
            "The book is captivating and engaging, earning a solid 4 for its ability to hold my attention, though it could have been slightly more gripping. I thoroughly enjoyed the emotional journey it provided, which deserves a 5."
        ],
        "conclusion": "This is my third book by this author, and I continue to be impressed by their storytelling. The characters are the highlight, and the plot is well-crafted, with everything coming together beautifully by the end. The pacing, writing, and emotional impact are all top-notch, making this a highly enjoyable read. While there are minor areas for improvement in intrigue, logic, and worldbuilding, the overall experience is outstanding.",
        "rating": "5",
        "review_likes": "2",
        "reviewer_id": "4121443-jess---the-hexed-library",
        "reviewer_followers": "133 followers",
        "reviewer_review_nums": "995 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Cover:** The cover is excellent, earning a perfect score of 5.  \n- **Characters:** The characters are the best part of the book. They are well-developed, lovable, and have fantastic interactions. I absolutely adore them, earning a score of 5.  \n- **Plot:** The plot is well-constructed, with everything woven together beautifully by the end. It made sense and felt satisfying, though it scores a 4 due to minor room for improvement.  \n- **Pace:** The pacing is perfect, keeping the story engaging and well-balanced, earning a 5.  \n- **Intrigue:** The book is intriguing and holds attention, though it scores a 4 as it could have been slightly more gripping.  \n- **Logic:** The story is logical and cohesive, with all elements coming together sensibly by the end. It scores a 4 for minor inconsistencies or areas that could have been tighter.  \n- **Worldbuilding:** The worldbuilding is solid and immersive, though it scores a 4 as it could have been slightly more expansive or detailed.  \n- **Writing:** The writing is exceptional, earning a perfect score of 5.  \n- **Enjoyment:** I thoroughly enjoyed this book, earning a 5 for the emotional journey it took me on.  \n- **Emotional Impact:** The book made me weep, smile, and swoon. It was an emotional rollercoaster, and I loved every moment of it.  \n\n**Conclusion:**  \nThis is my third book by Lukens, and I continue to be impressed by their storytelling. The characters are the highlight, and the plot is well-crafted, with everything coming together beautifully by the end. The pacing, writing, and emotional impact are all top-notch, making this a highly enjoyable read. While there are minor areas for improvement in intrigue, logic, and worldbuilding, the overall experience is outstanding.  \n\n**Rating Scores:**  \nCover: 5  \nCharacters: 5  \nPlot: 4  \nPace: 5  \nIntrigue: 4  \nLogic: 4  \nWorldbuilding: 4  \nWriting: 5  \nEnjoyment: 5  \nOverall Rating: 4.75"
    },
    {
        "aspects": [
            "Themes",
            "Expectation Fulfillment"
        ],
        "review": [
            "The story weaves in elements of exploring another world, evoking the essence of the Greek myth of Orpheus and Eurydice.",
            "This is another outstanding queer fantasy romance from a talented author."
        ],
        "conclusion": "While this novel is a strong addition to the author's repertoire of queer fantasy/romance, it didn’t quite surpass my love for *Spellbound*. The parallel to the Orpheus and Eurydice myth was fascinating, but I found myself craving more familiar reads afterward.",
        "rating": "4",
        "review_likes": "2",
        "reviewer_id": "86311895-spiri-skye",
        "reviewer_followers": "22 followers",
        "reviewer_review_nums": "521 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Genre and Themes:**  \n  - This is another queer fantasy/romance masterpiece from F.T. Lukens.  \n  - The story incorporates elements of venturing to another world, which feels reminiscent of the Greek myth of Orpheus and Eurydice.  \n\n- **Comparison to Previous Work:**  \n  - I enjoyed *Spellbound* a lot more, as it had a perfect grumpy/sunshine dynamic that resonated with me.  \n\n- **Personal Reading Experience:**  \n  - The most intriguing part of this book was the exploration of the other world, which added depth and intrigue to the story.  \n  - After reading this, I feel the need to dive into more familiar books for a change of pace.  \n\n**Conclusion:**  \nWhile this novel is a strong addition to F.T. Lukens' repertoire of queer fantasy/romance, it didn’t quite surpass my love for *Spellbound*. The parallel to the Orpheus and Eurydice myth was fascinating, but I found myself craving more familiar reads afterward.  \n\n**Rating Scores:**  \n{No specific rating scores mentioned in the review.}"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Enjoyment and Engagement",
            "Expectation Fulfillment"
        ],
        "review": [
            "The story felt incomplete and poorly developed, lacking the depth and coherence needed to keep me engaged.",
            "I struggled to connect with any of the characters, despite my efforts to engage with them. They felt distant and unrelatable.",
            "I took a break from reading, explored other books, and when I returned to this one, it just didn’t resonate with me. The pacing and overall engagement failed to capture my interest.",
            "I had high hopes for this book, but unfortunately, it fell short of my expectations, leaving me disappointed with the outcome."
        ],
        "conclusion": "Overall, this novel didn’t resonate with me. The lack of character connection, incomplete plot, and poor pacing made it a challenging read. Despite my initial excitement, it ultimately fell short of what I had hoped for.",
        "rating": "2",
        "review_likes": "2",
        "reviewer_id": "9576036-ashley",
        "reviewer_followers": "25 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**\n- **Character Development:**  \n  I wasn’t able to connect with any of the characters, despite my efforts. I tried to engage with them, but they felt distant and unrelatable.  \n- **Plot Execution:**  \n  The story felt very incomplete and not entirely thought out. It lacked depth and coherence, which made it hard for me to stay invested.  \n- **Engagement and Pacing:**  \n  I stopped reading for a bit, read other things, and then tried to pick it up again, but it just fell flat for me. The pacing and overall engagement didn’t hold my interest.  \n- **Expectations vs. Reality:**  \n  I wanted to love this book so much, but it didn’t meet my expectations. I was disappointed by how it turned out.  \n\n**Conclusion:**  \nOverall, this novel didn’t resonate with me. The lack of character connection, incomplete plot, and poor pacing made it a challenging read. Despite my initial excitement, it ultimately fell short of what I had hoped for.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Enjoyment and Engagement"
        ],
        "review": [
            "I found the characters unengaging and lacking resonance, which diminished my overall interest in the story.",
            "I often found myself rereading sentences due to the writing style, which made it difficult to maintain my focus. The lack of clarity and flow disrupted my reading experience.",
            "The novel completely failed to engage me, leaving me unable to recall any specific events. The plot simply wasn't captivating, making it challenging to follow along."
        ],
        "conclusion": "Overall, the novel failed to engage me on multiple levels—plot, characters, and writing style. I struggled to stay focused and ultimately found the experience unfulfilling.",
        "rating": "1",
        "review_likes": "2",
        "reviewer_id": "165866816-rytaw",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "28 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Plot Engagement:**  \n  I could not tell you a single thing that happened in the novel. The plot failed to capture my interest, making it difficult for me to follow or remember the events.  \n- **Character Development:**  \n  I was not interested in the characters. They did not resonate with me or hold my attention, which further contributed to my lack of engagement with the story.  \n- **Writing Style and Clarity:**  \n  I found myself rereading sentences frequently because the writing style made it hard for me to commit my attention. The lack of clarity or flow disrupted my reading experience.  \n\n**Conclusion:**  \nOverall, the novel failed to engage me on multiple levels—plot, characters, and writing style. I struggled to stay focused and ultimately found the experience unfulfilling.  \n\n**Rating Scores:**  \nNo specific rating scores were mentioned in the review."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Themes"
        ],
        "review": [
            "The plot is a standout aspect of the story, starting with a fundamental difference between the two main characters that resolves beautifully. It then unfolds into a captivating retelling of a classic Greek myth. The bold, brash nature of the protagonist, unafraid to confront deities, kept me thoroughly engaged. I savored every moment of this unpredictable journey.",
            "The characters are the standout element of the story. The supporting cast is delightful and unforgettable, featuring a talented river nymph, a disgruntled minor messenger god, a morally ambiguous undead human, and the main character's loving, supportive cousins. Each character contributes significantly to the narrative, creating a dynamic and heartwarming family atmosphere when they come together.",
            "As a devoted fan of this author, I've eagerly consumed all their previous works and look forward to every new release. This novel is no exception; it delivers once again, solidifying the author’s reputation for excellence.",
            "The novel masterfully weaves themes of self-discovery, love, and acceptance into its adventurous narrative, imbuing the story with profound emotional weight that resonates deeply with readers."
        ],
        "conclusion": "*Otherworldly* is a captivating paranormal YA adventure that combines memorable characters, a thrilling plot, and heartfelt themes. The author has once again crafted a story that is impossible to put down. This book is a must-read, and I highly recommend it to anyone looking for a fun, emotional, and adventurous tale.",
        "rating": "5",
        "review_likes": "2",
        "reviewer_id": "68783004-jeremy-fowler",
        "reviewer_followers": "26 followers",
        "reviewer_review_nums": "768 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Characters:**  \n  The characters are my favorite part of the story. The supporting cast is incredibly fun and memorable, including a river nymph who is an exceptional singer, a disgruntled minor messenger god, an undead human with questionable morals, and loving, supportive cousins to the main character. Each character plays a pivotal role, and when they come together, it feels like a fun and loving family.  \n\n- **Plot:**  \n  The plot is another standout component. It begins with a fundamental difference between the two main characters, which gets resolved beautifully. The story then evolves into a grand, inspired retelling of a classic Greek myth. The bold and brash nature of the main character, who isn’t afraid to stand up to deities, kept me hooked. I loved every second of the unpredictable journey.  \n\n- **Writing Style:**  \n  As a longtime fan of FT Lukens, I’ve devoured all their previous works and eagerly anticipate their new material. Their writing consistently delivers, and this novel is no exception. It’s another hit from a fantastic author.  \n\n- **Themes:**  \n  The novel explores themes of self-discovery, love, and acceptance, all woven seamlessly into the adventure. These themes resonate deeply and add emotional weight to the story.  \n\n**Conclusion:**  \n*Otherworldly* is a captivating paranormal YA adventure that combines memorable characters, a thrilling plot, and heartfelt themes. FT Lukens has once again crafted a story that is impossible to put down. This book is a must-read, and I highly recommend it to anyone looking for a fun, emotional, and adventurous tale.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting"
        ],
        "review": [
            "In my previous review of *Spell Bound*, I noted that the author improves with each book. With *Otherworldly*, I can confidently reaffirm that sentiment. This installment showcases exceptional storytelling, and I eagerly anticipate whatever the author produces next.",
            "The romance in *Otherworldly* is truly delightful. Ellery's transformation from having a crush on Knox to falling deeply in love is swoon-worthy. Knox, with his golden retriever-like charm, adds a vibrant energy to their relationship. Their romance takes center stage in the final quarter of the book, and fans of Greek mythology will particularly enjoy how it unfolds.",
            "Set in Solis City, a place gripped by five years of relentless winter, the story follows Ellery, a nonbeliever who questions the abandonment of her people by their goddess. While many have lost faith, Ellery's skepticism is put to the test when she encounters Knox, a charming diner customer who claims to be a familiar from the Other World and a servant of the goddess. With Knox needing to strike a new bargain to avoid being pulled back to his realm, the two join forces to unravel the mystery behind the eternal winter."
        ],
        "conclusion": "*Otherworldly* is a beautifully crafted novel that showcases the author's growth as a storyteller. With its compelling world-building, heartwarming found family dynamics, and swoon-worthy romance, this book is a standout. Fans of the author's previous works and Greek mythology enthusiasts will find much to love here.",
        "rating": "5",
        "review_likes": "3",
        "reviewer_id": "96153724-christie",
        "reviewer_followers": "18 followers",
        "reviewer_review_nums": "149 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Author's Growth and Consistency:**  \n  I previously mentioned in my review of *Spell Bound* that FT Lukens gets better with every book they write. With *Otherworldly*, I am absolutely confident in standing by that statement. This book is on another level of storytelling, and I will eagerly read whatever Lukens chooses to write next.  \n\n- **World-Building and Premise:**  \n  The story is set in Solis City and its surrounding area, which has been under five years of unending winter. While most people believe they’ve been abandoned by their goddess, Ellery, the protagonist, is a nonbeliever. Ellery questions what kind of deity would leave their people to suffer. However, this skepticism is challenged when Ellery literally runs into Knox, a hot customer from the diner who claims to be a familiar from the Other World and a servant of the goddess. Knox needs to make a new bargain quickly to avoid being dragged back to the Other World, and together, they might solve the mystery of the eternal winter.  \n\n- **Found Family Theme:**  \n  One of my favorite aspects of Lukens' works is the strong sense of found family that permeates each story. *Otherworldly* takes this theme to the next level. Charley, Zada, and Ellery have created their own little family, and they’re quick to welcome Knox into their fold. Their dynamic is funny, sweet, and heartwarming, making it a highlight of this lovely book.  \n\n- **Romance Development:**  \n  The romance in *Otherworldly* is equally delightful. Watching Ellery’s journey from having a crush on Knox to falling in love with him is swoon-worthy. Knox, who is the magical equivalent of a golden retriever, brings a charming energy to their relationship. Their romance plays a significant role in the final quarter of the book, and Greek mythology fans will especially appreciate how it unfolds.  \n\n**Conclusion:**  \n*Otherworldly* is a beautifully crafted novel that showcases FT Lukens' growth as a storyteller. With its compelling world-building, heartwarming found family dynamics, and swoon-worthy romance, this book is a standout. Fans of Lukens' previous works and Greek mythology enthusiasts will find much to love here.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting"
        ],
        "review": [
            "The magical adventure was both fun and engaging. I particularly enjoyed the subtle nods to Greek mythology, especially the parallels to Hades and the Underworld, as well as Orpheus and Eurydice. These elements enriched the story and added depth.",
            "Knox was my favorite character—bright-eyed yet troubled, with many layers. His personal journey added depth and engagement to the story. I also appreciated Ellery, a non-binary character who existed authentically without their identity being a focal point. This normalization of queer identity was refreshing and skillfully portrayed.",
            "The author crafts a cozy, welcoming queer normative world, making the story's setting and tone both comforting and enjoyable."
        ],
        "conclusion": "Overall, this was a fun and entertaining read with a cozy atmosphere, engaging characters, and a magical adventure. While Ellery’s relationship with their parents could have been better developed, the story’s strengths—such as its queer normative world, found family dynamics, and Knox’s layered character—made it a great experience.",
        "rating": "4",
        "review_likes": "2",
        "reviewer_id": "163140541-teereads",
        "reviewer_followers": "14 followers",
        "reviewer_review_nums": "554 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **World-Building and Atmosphere:**  \n  The way F.T. Lukens creates queer normative worlds feels cozy and welcoming. The story’s setting and tone made it a comforting and enjoyable read.  \n\n- **Representation and Character Identity:**  \n  I loved that Ellery, a non-binary character, simply existed as themselves without their identity being a central focus or issue. This normalization of queer identity was refreshing and well-executed.  \n\n- **Found Family Dynamics:**  \n  The little found family in the story was heartwarming and added depth to the narrative. It was a highlight of the book for me.  \n\n- **Magical Adventure and Plot:**  \n  The magical adventure was fun and engaging. I appreciated the subtle nods to Greek mythology, particularly the parallels to Hades and the Underworld, as well as Orpheus and Eurydice. These elements added an interesting layer to the story.  \n\n- **Character Development (Knox):**  \n  Knox was my favorite character. He was bright-eyed yet troubled, with a lot of layers. His personal journey throughout the story made the experience more engaging and compelling.  \n\n- **Romance (Ellery and Knox):**  \n  The budding romance between Ellery and Knox was adorable and lovely to watch develop. It added a sweet and heartfelt dimension to the story.  \n\n- **Ellery’s Relationship with Their Parents:**  \n  My only critique is that Ellery’s relationship with their parents felt underdeveloped. It was mentioned frequently but not shown in depth. The phone call from their mother towards the end felt rushed and out of place, leaving this aspect of the story unresolved.  \n\n**Conclusion:**  \nOverall, this was a fun and entertaining read with a cozy atmosphere, engaging characters, and a magical adventure. While Ellery’s relationship with their parents could have been better developed, the story’s strengths—such as its queer normative world, found family dynamics, and Knox’s layered character—made it a great experience.  \n\n**Rating Scores:**  \n4.25 stars"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "World-Building and Setting",
            "Themes",
            "Expectation Fulfillment"
        ],
        "review": [
            "The pacing seamlessly blends thrilling action scenes with heartwarming moments, creating a well-balanced narrative.",
            "I adored the characters! Ellery struck a perfect balance between grumpy and determined, while Knox brought a sweet and vibrant energy to the story. The found family dynamic added a lovely touch and truly made me smile. However, I would have appreciated a deeper exploration of the side characters and the town's residents.",
            "The writing style complemented the cozy plot beautifully.",
            "The author masterfully crafts an immersive world filled with vibrant characters. From the very first page, I was drawn into a town trapped in perpetual winter. The depth of the world-building and mythology in Otherworldly is truly impressive.",
            "This story is a quintessential tale of star-crossed lovers.",
            "If you adore cozy fantasy, this book is a must-read! \"Otherworldly\" is ideal for fans of the genre, especially those who enjoy the found family and grumpy x sunshine tropes."
        ],
        "conclusion": "This novel is a delightful addition to the cozy fantasy genre, offering a captivating world, endearing characters, and a perfect blend of action and heartfelt moments. While I wished for more depth in the side characters, the immersive setting and charming dynamics between Ellery and Knox made this a truly enjoyable read.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "43341221-paige-pagebypaigebooks",
        "reviewer_followers": "11 followers",
        "reviewer_review_nums": "401 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Genre and Theme:**  \n  - \"This story… has ‘star-crossed lovers’ written all over it.\"  \n  - \"If you love cozy fantasy then you need to read this book!\"  \n  - \"Otherworldly is perfect for cozy fantasy readers everywhere who can’t get enough of the found family and grumpy x sunshine tropes!\"  \n\n- **World-Building and Setting:**  \n  - \"F.T. Lukens does an amazing job of creating an immersive world with vibrant characters.\"  \n  - \"From the first page, I was immediately transported to a town stuck in eternal winter.\"  \n  - \"The world-building and mythology of Otherworldly were also very in-depth.\"  \n\n- **Characters:**  \n  - \"I loved the characters! Ellery was the perfect mix of grumpy and determined, and Knox was such a sweet and bright light!\"  \n  - \"The found family vibes were also a great touch. They definitely made me smile!\"  \n  - \"However, I would have enjoyed getting to learn a bit more about the side characters and other people in the town.\"  \n\n- **Writing Style and Pacing:**  \n  - \"The writing style matched the cozy plot perfectly.\"  \n  - \"The pacing was evenly balanced with exciting action scenes and heartwarming sweet moments.\"  \n\n- **Content Warnings:**  \n  - \"Content Warnings: death, violence.\"  \n\n**Conclusion:**  \nThis novel is a delightful addition to the cozy fantasy genre, offering a captivating world, endearing characters, and a perfect blend of action and heartfelt moments. While I wished for more depth in the side characters, the immersive setting and charming dynamics between Ellery and Knox made this a truly enjoyable read.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "World-Building and Setting"
        ],
        "review": [
            "The pacing and chapter structure are expertly crafted, ensuring the story remains engaging and well-balanced throughout.",
            "Knox and Ellery are captivating and unexpected protagonists, strikingly real, relatable, and wonderfully feisty. The supporting characters—Zada, Charley, Lorelei, and Bram—are equally compelling. They don’t merely serve the plot; they embody unique identities that enrich the story.",
            "The author’s talent is evident in their writing, showcasing passion and heart that infuses their books with energy and joy.",
            "The world-building is exceptional and intricately detailed. It’s vivid and immersive, allowing readers to visualize the story as if it were unfolding in real life."
        ],
        "conclusion": "This novel left me emotionally invested and deeply satisfied. The characters, world-building, and pacing are exceptional, and the writing is a testament to the author’s talent and passion. It’s a story I’ll cherish and revisit, and I eagerly await more from them.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "155661963-liv",
        "reviewer_followers": "2 followers",
        "reviewer_review_nums": "46 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Characters:**  \n  - Knox and Ellery are amazing, unexpected protagonists. They feel real, relatable, lovely, and feisty.  \n  - The side characters, such as Zada, Charley, Lorelei, and Bram, are equally compelling. They don’t just serve the plot but feel like real, unique, and important individuals.  \n\n- **World-Building:**  \n  - The world-building is insane and very well fleshed out. It’s vivid and immersive, making it easy to visualize everything as if it were playing out in real life.  \n\n- **Pacing and Structure:**  \n  - The pacing and chapter structure are perfect, keeping the story engaging and well-balanced.  \n\n- **Author’s Craft:**  \n  - F. T. Lukens’ talent shines through in their writing. Their passion and heart are evident in their work, making their books a source of energy and joy.  \n\n- **Overall Enjoyment:**  \n  - The story is so enjoyable that I would love to see it adapted into a movie. My only demand is for more content from this world and more works from F. T. Lukens.  \n\n**Conclusion:**  \nThis novel left me emotionally invested and deeply satisfied. The characters, world-building, and pacing are exceptional, and F. T. Lukens’ writing is a testament to their talent and passion. It’s a story I’ll cherish and revisit, and I eagerly await more from the author.  \n\n**Rating Scores:**  \n(No specific numerical rating is mentioned in the review, but the tone suggests a highly positive evaluation, likely a 5/5 or equivalent.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "World-Building and Setting",
            "Expectation Fulfillment"
        ],
        "review": [
            "The story initially felt lacking in plot and momentum until the final act, which was significantly more engaging than the earlier sections. However, the introduction of a completely new final act seemed unearned and disconnected from the preceding narrative, especially regarding the Orpheus and Eurydice elements.",
            "The characters lacked emotional depth, displaying only a couple of superficial emotions. While the theme of choice was appreciated, it couldn't compensate for the underdeveloped characters.",
            "I appreciate the author's writing style and their knack for crafting intriguing speculative fiction premises, but this novel seemed less profound than their previous works. My experiences with their books have been varied: I loved *In Deeper Waters*, enjoyed *So This is Ever After*, was frustrated by *Spell Bound*, and found *Otherworldly* dull.",
            "The story's framing, with its blend of fantasy and pervasive queerness, creates an enjoyable backdrop for charming young meet-cutes.",
            "The idea of a permanent winter intertwined with the Underworld is both intriguing and promising."
        ],
        "conclusion": "While the premise of a permanent winter and deals with the Underworld was initially captivating, the lack of emotional depth, underdeveloped characters, and uneven pacing made the story fall flat. The final act was more engaging but felt unearned. Compared to the author's earlier works, this novel didn’t meet my expectations, and I may need to reconsider my enthusiasm for their future releases.",
        "rating": "3",
        "review_likes": "1",
        "reviewer_id": "298072-kj",
        "reviewer_followers": "33 followers",
        "reviewer_review_nums": "362 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Premise and Setting:**  \n  - The concept of a permanent winter and deals with the Underworld initially seemed intriguing and promising.  \n  - The framing of FT Lukens' writing, where fantasy and ubiquitous queerness serve as the backdrop for young meet-cutes, is enjoyable.  \n\n- **Plot Structure and Pacing:**  \n  - The story felt plot-lite and lacked momentum until the final act, which was far more engaging than the preceding sections.  \n  - The introduction of an entirely new final act felt unearned and disconnected from the earlier narrative, particularly the Orpheus and Eurydice elements.  \n\n- **Character Development and Emotional Depth:**  \n  - The characters lacked emotional depth, with no one exhibiting more than two emotions, and those emotions felt superficial.  \n  - The role of choice throughout the story was appreciated, but it wasn’t enough to compensate for the underdeveloped characters.  \n\n- **Writing Style and Author Comparison:**  \n  - While I enjoy Lukens' writing style and their ability to create sparkly speculative fiction premises, this novel felt surface-level compared to their earlier works.  \n  - My experience with Lukens' novels has been mixed: I loved \"In Deeper Waters,\" enjoyed \"So This is Ever After,\" was annoyed by \"Spell Bound,\" and found \"Otherworldly\" boring.  \n\n- **Overall Engagement and Personal Reflection:**  \n  - The lack of emotional depth and character sparks failed to hold my interest, despite the intriguing premise.  \n  - I may need to stop being drawn in by the alluring cover art and speculative fiction premises, as the diminishing returns are becoming a pattern.  \n\n**Conclusion:**  \nWhile the premise of a permanent winter and deals with the Underworld was initially captivating, the lack of emotional depth, underdeveloped characters, and uneven pacing made the story fall flat. The final act was more engaging but felt unearned. Compared to Lukens' earlier works, this novel didn’t meet my expectations, and I may need to reconsider my enthusiasm for their future releases.  \n\n**Rating Scores:**  \n- No specific rating scores were mentioned in the review."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The story began with an intriguing premise of a frozen world and a mission to save a city, but it ultimately faltered due to a lack of clear direction. Disjointed execution, particularly with irrelevant scenes like frat parties and mall outings, detracted from the main narrative. Additionally, the pacing was uneven, with excessive detail—such as four pages devoted to crossing a river—making the book feel unnecessarily long by nearly 100 pages.",
            "I enjoyed the main characters, but their development felt lacking. The goddess character didn't meet expectations as an otherworldly figure, and while the romance was present, it was underdeveloped. I wished for more meaningful moments and deeper connections between the characters.",
            "The idea of a frozen world and a dying city is intriguing, but the world-building falls short in depth and consistency.",
            "While the humor was enjoyable, it ultimately couldn’t sustain the story."
        ],
        "conclusion": "While the novel had an intriguing premise and likable main characters, it fell short in execution. The plot lacked focus, the romance and character development were underdeveloped, and the pacing was uneven. Despite some enjoyable humor and a fascinating concept, the book felt overly long and unsatisfying.",
        "rating": "2",
        "review_likes": "1",
        "reviewer_id": "168764975-corinne",
        "reviewer_followers": "134 reviews",
        "reviewer_review_nums": "134 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Plot Development:**  \n  - The story started off promising but lacked a clear end goal.  \n  - The premise of a frozen world and the need to save the city was intriguing, but the execution felt disjointed.  \n  - The inclusion of seemingly irrelevant scenes (e.g., frat parties, mall sightseeing) detracted from the main plot.  \n  - The pacing was uneven, with unnecessary details (e.g., 4 pages dedicated to crossing a river) making the book feel 100 pages too long.  \n\n- **Character Development:**  \n  - I really liked the main characters, but their development felt insufficient.  \n  - The goddess character did not live up to expectations as an otherworldly being.  \n\n- **Romance:**  \n  - The romance was present but underdeveloped. I wanted more romantic moments and deeper connections between characters.  \n\n- **World-Building:**  \n  - The concept of a frozen world and a dying city was fascinating, but the world-building lacked depth and consistency.  \n\n- **Humor:**  \n  - The humor was present and enjoyable, but it wasn’t enough to carry the story.  \n\n- **Overall Enjoyment:**  \n  - The book felt lackluster and left me wanting more in almost every aspect.  \n  - If I were younger, I might have enjoyed it more, but as it stands, it didn’t meet my expectations.  \n  - Despite its flaws, I’m still intrigued by the other books in the series, partly due to the gorgeous covers.  \n\n**Conclusion:**  \nWhile the novel had an intriguing premise and likable main characters, it fell short in execution. The plot lacked focus, the romance and character development were underdeveloped, and the pacing was uneven. Despite some enjoyable humor and a fascinating concept, the book felt overly long and unsatisfying.  \n\n**Rating Scores:**  \n2/5 stars."
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "World-Building and Setting",
            "Expectation Fulfillment"
        ],
        "review": [
            "The characters, always my favorite aspect of any book, were absolutely hilarious! One was a grumpy figure who seemed allergic to fun, while the other was endlessly fascinated by humanity. Their dynamic was a joy to read, and Knox, with his flirty personality, quickly became my favorite. The cousin and her girlfriend were also adorable, adding to the story's charm. The representation in this book was outstanding; everything felt casual and natural, with no questioning or conflict. One of the main characters uses they/them pronouns, and this was treated as a given throughout the narrative, which was refreshingly inclusive.",
            "I have thoroughly enjoyed every book by this author, and this one was no exception! The writing is light and delightful, perfectly capturing the author's signature style. It's always a fun and charming experience.",
            "This book radiates warmth and coziness, perfect for enjoying in your favorite reading nook with a comforting drink. It left my heart feeling full and content. The well-crafted world-building creates a vivid and immersive setting that complements the story beautifully.",
            "This charming YA romance weaves together magic and supernatural elements in a delightful tale of two boys discovering love in unexpectedly hilarious ways."
        ],
        "conclusion": "Overall, I highly recommend this book! It’s a delightful, cozy read that combines humor, romance, and a touch of magic. The author has once again delivered a story that is both fun and heartwarming.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "142442816-nandini",
        "reviewer_followers": "51 followers",
        "reviewer_review_nums": "251 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Author's Style and Consistency:**  \n  I have loved every book by F.T. Lukens so far. They are always so fun and cute to read, and this was no disappointment! The writing was light and a delight to read, maintaining the author's signature style.\n\n- **Atmosphere and Wholesomeness:**  \n  This book was so wholesome and cozy, the type you sit in your comfy reading corner with while enjoying your favorite drink. It left my heart feeling full and content.\n\n- **World-Building:**  \n  The world-building was well done, creating a vivid and immersive setting that complemented the story perfectly.\n\n- **Characters and Dynamics:**  \n  The characters (always my favorite part of F.T. Lukens' books) were hilarious! One character was grumpy and acted like he was allergic to fun, while the other was fascinated by everything human. Their dynamic was hilarious to read, and Knox, with his flirty personality, was definitely my favorite. The cousin and her girlfriend were also incredibly cute and added to the charm of the story.\n\n- **Representation and Inclusivity:**  \n  The representation in this book was fantastic. I loved how casual everything was; there was no questioning or arguments over anything. One of the main characters uses they/them pronouns, and throughout the book, it was treated as an already established fact that no one questioned. This approach was very refreshing.\n\n- **Genre and Themes:**  \n  This is an adorable YA romance mixed with magic and supernatural elements. It’s a heartwarming story about two boys falling in love in the most hilarious ways.\n\n**Conclusion:**  \nOverall, I highly recommend this book! It’s a delightful, cozy read that combines humor, romance, and a touch of magic. F.T. Lukens has once again delivered a story that is both fun and heartwarming.\n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters"
        ],
        "review": [
            "The plot exhibited both strengths and weaknesses. The initial two-thirds of the book felt drawn out, often featuring mundane moments that hindered the pacing. However, the final act was exceptional, skillfully weaving together small details from earlier in the story to create a satisfying and emotionally impactful climax.",
            "The characters were a standout aspect of the story. Ellery and Knox made for a charming couple, while Charley and Zada brought additional warmth as an established pair. However, I felt that Charley’s “weirdness” was occasionally overemphasized, coming across as merely loud rather than fully developed."
        ],
        "conclusion": "Overall, this is a good cozy fantasy read, though not my favorite by the author. The first two-thirds of the book were slow and mundane, but the final act was exceptional, with a well-crafted climax that tied everything together. The characters and romance were strong points, but the pacing and emotional depth could have been improved.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "9324017-jennifer",
        "reviewer_followers": "53 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**\n\n- **Representation (5/5):**  \n  The representation in the novel was well-done and earned a high score.  \n\n- **Emotion (3/5):**  \n  The emotional depth of the story was somewhat lacking, particularly in the first two-thirds of the book, which felt mundane and slow. However, the emotional payoff in the final act was strong and engaging.  \n\n- **Characters (4/5):**  \n  The characters were a highlight of the story. Ellery and Knox were a cute, sweet couple, and Charley and Zada added charm as an established couple. My only critique is that Charley’s “weirdness” sometimes felt overemphasized and reduced to being loud, which didn’t fully land for me.  \n\n- **Plot (3/5):**  \n  The plot had its strengths and weaknesses. The first two-thirds of the book felt like a slog, with mundane moments that dragged on. However, the final act was excellent, with many small details from earlier in the story coming together for a satisfying and emotional climax.  \n\n- **Pacing (2/5):**  \n  The pacing was a significant issue. The majority of the book felt slow, with too much time spent on less interesting moments, which made it hard to stay engaged.  \n\n- **Romance (5/5):**  \n  The romance was a standout aspect of the novel. The relationships, particularly between Ellery and Knox, were sweet and well-developed.  \n\n**Conclusion:**  \nOverall, this is a good cozy fantasy read, though not my favorite by Lukens. The first two-thirds of the book were slow and mundane, but the final act was exceptional, with a well-crafted climax that tied everything together. The characters and romance were strong points, but the pacing and emotional depth could have been improved.  \n\n**Rating Scores:**  \n- Representation: 5/5  \n- Emotion: 3/5  \n- Characters: 4/5  \n- Plot: 3/5  \n- Pacing: 2/5  \n- Romance: 5/5  \n- Overall Score: 4/5"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes"
        ],
        "review": [
            "The plot is captivating and kept me engaged throughout. The ending is especially well-crafted, highlighting excellent storytelling.",
            "The characters were delightful. Ellery and Knox quickly captured my heart, while Charley and Zada were truly remarkable. I was pleasantly surprised by how much I ended up loving Bram, a side character who exceeded my expectations.",
            "The book delivers a touching message about embracing faith and the power of letting go, which resonated with me on a deep level."
        ],
        "conclusion": "This book was lovely, cute, and adorable, with an intriguing plot, well-developed characters, and a meaningful message. It’s now one of my all-time favorites, and I’m obsessed with the storytelling.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "78017871-alex-lakej",
        "reviewer_followers": "12 followers",
        "reviewer_review_nums": "185 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Plot:** The plot is intriguing and kept me on my toes the entire time. The ending was particularly well-crafted, showcasing great storytelling.  \n- **Characters:** The characters were all lovely. Ellery and Knox stole my heart quickly, and Charley and Zada were absolutely amazing. I didn’t expect to love Bram as much as I did, especially since he’s a side character, but he surprised me in the best way.  \n- **Themes:** The book carries a heartwarming message about allowing yourself to have faith and let go, which resonated deeply with me.  \n- **Timing:** I wish I had read this sooner, but I’m glad I got to experience it at the perfect time in my life.  \n\n**Conclusion:**  \nThis book was lovely, cute, and adorable, with an intriguing plot, well-developed characters, and a meaningful message. It’s now one of my all-time favorites, and I’m obsessed with the storytelling.  \n\n**Rating Scores:**  \n10/10"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Expectation Fulfillment"
        ],
        "review": [
            "The plot was decent but failed to deliver any truly extraordinary moments. I found myself waiting for a standout twist that never materialized. The ending felt rushed and served as an easy way out, leaving me unsatisfied with the conclusion I had hoped for.",
            "The characters were well-developed and engaging, showcasing significant depth and potential.",
            "The setting was well-crafted and enhanced the story's atmosphere. While the world-building was decent, it felt somewhat underdeveloped. The initial setup evoked the essence of Japanese horror, which piqued my interest, but the execution fell short of fully exploring the world’s potential. The concept of using made-up stories to scare children felt more substantial than the novel's own utilization of its setting.",
            "I began this book with high hopes, anticipating it would be as captivating as one of my favorites. Unfortunately, it fell short of those expectations, leading me to view it more critically."
        ],
        "conclusion": "While the book had strong elements like its characters and setting, it fell short in fully realizing its potential, particularly in world-building and plot execution. The ending left me wanting more, and I couldn’t help but feel that much more could have been done with the premise.",
        "rating": "3",
        "review_likes": "1",
        "reviewer_id": "167227987-kari",
        "reviewer_followers": "25 reviews",
        "reviewer_review_nums": "25 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Expectations vs. Reality:**  \n  I started this book with high expectations, hoping it would be as captivating as another favorite of mine. However, it didn’t quite meet those expectations, and I ended up viewing it more critically as a result.  \n\n- **Characters:**  \n  The characters were well-developed and engaging. They had potential, and I appreciated their depth.  \n\n- **Setting:**  \n  The setting was well-crafted and added to the atmosphere of the story.  \n\n- **World-Building:**  \n  The world-building was decent but felt underdeveloped. The initial setup reminded me of Japanese horror stories, which got me excited, but the execution didn’t fully explore the potential of the world. The \"made-up stories to scare little kids\" concept felt more substantial than how the novel utilized its own world.  \n\n- **Plot:**  \n  The plot was okay but lacked a truly mind-blowing moment. I kept waiting for something extraordinary to happen, but it never quite delivered.  \n\n- **Ending:**  \n  The ending felt rushed and like an easy way out. It didn’t provide the satisfying conclusion I was hoping for.  \n\n**Conclusion:**  \nWhile the book had strong elements like its characters and setting, it fell short in fully realizing its potential, particularly in world-building and plot execution. The ending left me wanting more, and I couldn’t help but feel that much more could have been done with the premise.  \n\n**Rating Scores:**  \n3.5/5"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The plot unfolded rapidly, covering a period of only about a month. I would have preferred a longer timeframe, such as a year, to allow for more depth.",
            "Although some characters lacked depth, each possessed a unique charm that made them memorable. The portrayal of queer individuals was handled skillfully, with no awkward conversations or extraneous explanations—everything was simply accepted. This aspect of the story was particularly commendable.",
            "While there were some inconsistencies and aspects of the world and magic system that weren’t fully explained, I found these elements didn’t significantly detract from the main themes of the book. Thus, I’m willing to overlook them.",
            "This charming book is an ideal choice for anyone seeking a light, fluffy read to balance out heavier literature."
        ],
        "conclusion": "Overall, this book is a charming and lighthearted read, ideal for those seeking a break from heavier material. While it has some flaws in pacing and world-building, its endearing characters and thoughtful representation make it a worthwhile read.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "153002092-iamnotacentipede",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "128 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Tone and Appeal:**  \n  This was a very adorable book, perfect for someone looking for something \"fluffy\" to read in between heavier books.  \n\n- **Character Development:**  \n  While some of the characters weren't very fleshed out, they each had a little charm that made them distinct and memorable.  \n\n- **Pacing and Timeline:**  \n  The plot moved very quickly, taking place over the course of maybe a month (at best). I would have personally preferred it to span a longer period, like a year.  \n\n- **World-Building and Consistency:**  \n  There were some inconsistencies, and much of the world and magic system wasn't fully explained. However, since the main topics of the book weren't heavily tied to these elements, I'm willing to overlook this.  \n\n- **Representation of Queer Characters:**  \n  The handling of queer people in this story was done very well. There were no awkward conversations or unnecessary explanations; everything was simply accepted as it was, which I found very commendable.  \n\n**Conclusion:**  \nOverall, this book is a charming and lighthearted read, ideal for those seeking a break from heavier material. While it has some flaws in pacing and world-building, its endearing characters and thoughtful representation make it a worthwhile read.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Enjoyment and Engagement",
            "Expectation Fulfillment"
        ],
        "review": [
            "The story felt somewhat rushed towards the end. I would have appreciated an additional chapter between the final two to allow the conclusion to develop more fully.",
            "Every book by this author reinforces my decision to make them an auto-buy. I couldn't put this one down and will definitely be adding a physical copy to my shelves when it's released.",
            "This story leans more into the paranormal than the authors' recent works, reminiscent of *Spell Bound*. If you enjoyed *Spell Bound*, you'll likely find much to appreciate in this tale as well."
        ],
        "conclusion": "This book is another fantastic addition to the author's works, blending paranormal elements with the beloved found family trope. While the pacing felt rushed towards the end and I missed Knox’s POV at times, it was still an engaging and enjoyable read that I would revisit and recommend.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "111466577-raelene",
        "reviewer_followers": "22 followers",
        "reviewer_review_nums": "754 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Author's Consistency and Appeal:**  \n  Every book I read by FT Lukens confirms that they are an auto-buy author for me. I could not put this down and will absolutely be picking up a physical copy for my shelves when it comes out.  \n\n- **Genre and Similarity to Previous Works:**  \n  This story was more paranormal than their last few books and felt most similar to *Spell Bound*. If you liked *Spell Bound*, there would be a lot about this story that would work for you as well.  \n\n- **Found Family Element:**  \n  I always love the found family element that this author includes in their books, and it was probably my favorite part of this one as well.  \n\n- **Pacing and Structure:**  \n  Towards the end, the story felt a bit rushed. I would have liked one more chapter between the last two to give the conclusion more room to breathe.  \n\n- **Narrative Perspective (Dual POV):**  \n  I really appreciated the dual POV. While I understand why it was just Ellery’s perspective for a while, I missed having Knox’s POV during that time.  \n\n- **Overall Enjoyment and Recommendation:**  \n  Despite the minor issues, I still really adored this book. I would definitely reread it and recommend it to others.  \n\n**Conclusion:**  \nThis book by FT Lukens is another fantastic addition to their works, blending paranormal elements with the beloved found family trope. While the pacing felt rushed towards the end and I missed Knox’s POV at times, it was still an engaging and enjoyable read that I would revisit and recommend.  \n\n**Rating Scores:**  \n4 out of 5 stars.  \n\n**Acknowledgments:**  \nThank you to the publisher and NetGalley for the opportunity to read and review an advanced copy of this book! I voluntarily read this book, and all thoughts and opinions are my own."
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "World-Building and Setting",
            "Themes"
        ],
        "review": [
            "Ellery's transformation from skepticism to a newfound sense of purpose and trust is both compelling and engaging. Knox's cheerful and uplifting demeanor perfectly contrasts with Ellery's initial doubts, resulting in a dynamic and heartwarming partnership.",
            "The author’s charming and effective writing brilliantly captures the found family trope. With a lighthearted and feel-good tone, this YA fantasy offers an enjoyable reading experience.",
            "The novel captivates with its intriguing premise: Ellery, a skeptic, learns that gods, goddesses, and supernatural creatures are real when she rescues Knox. Set against the backdrop of an unending winter, the quest to uncover its cause and connect with the goddess adds significant depth to the narrative.",
            "This story beautifully explores themes of belief, trust, and found family. It poignantly illustrates the fulfillment that comes from relying on others, even amidst the fear it may evoke, adding significant emotional depth to the narrative."
        ],
        "conclusion": "*Otherworldly* is a delightful YA fantasy that combines a unique premise, strong character development, and heartwarming themes of belief and found family. It’s a feel-good story with a charming tone that leaves a lasting impression.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "152849295-amelia",
        "reviewer_followers": "7 followers",
        "reviewer_review_nums": "481 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **World-Building and Premise:**  \n  The novel introduces a fascinating premise where Ellery, a skeptic, discovers that gods, goddesses, and supernatural creatures are real after rescuing Knox. The unending winter serves as a compelling backdrop, and the quest to uncover its cause and contact the goddess adds depth to the story.  \n\n- **Character Development:**  \n  Ellery’s journey from disbelief to finding purpose and trust in others is well-crafted and engaging. Knox’s cheerful and uplifting personality contrasts beautifully with Ellery’s initial skepticism, creating a dynamic and heartwarming partnership.  \n\n- **Themes and Emotional Impact:**  \n  The exploration of belief, trust, and found family is touching and resonates deeply. The idea of finding fulfillment in relying on others, despite the fear it brings, is a central theme that adds emotional weight to the story.  \n\n- **Writing Style and Tone:**  \n  The author’s writing is charming and effective, particularly in portraying the found family trope. The tone is lighthearted and feel-good, making it an enjoyable YA fantasy read.  \n\n- **Overall Enjoyment and Recommendation:**  \n  I found *Otherworldly* to be an adorable and uplifting read. It’s my first book by this author, but I’m eager to explore more of their works in the future.  \n\n**Conclusion:**  \n*Otherworldly* is a delightful YA fantasy that combines a unique premise, strong character development, and heartwarming themes of belief and found family. It’s a feel-good story with a charming tone that leaves a lasting impression.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language"
        ],
        "review": [
            "I admire how the author crafts their characters, presenting them as blank canvases for readers to shape and define, particularly the non-binary character Ellery. I hope they come to understand the significance of representation.",
            "Review:  \nAs an ESL teacher for teenagers, I’ve observed that my students struggle to follow the narrative in Ellery. They often feel confused by the use of \"they\" as a singular pronoun and some consider it unnecessary. Consequently, many of them chose to abandon the book. This challenge stems from their unfamiliarity with neutral singular pronouns referring to one person."
        ],
        "conclusion": "This novel is a solid 5-star read for me due to its innovative character development and the way it invites readers to shape Ellery's identity. However, the use of neutral pronouns for a singular character can be challenging for non-native English speakers, particularly teenagers, which may limit its accessibility for some audiences. Despite this, the book's representation of non-binary identity is meaningful and important.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "28201374-rafael-andrade",
        "reviewer_followers": "5 followers",
        "reviewer_review_nums": "325 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n  I love the way the author creates their characters; they are like a white canvas, and the readers are the ones who give shape and form to the non-binary Ellery.  \n\n- **Language and Accessibility:**  \n  As I teach teenagers English as a second language, they find it complicated to follow Ellery. They feel confused at first when \"they\" is used to refer to Ellery, and some of them found this unnecessary. As a result, they decided to drop the book. The problem is that they are not familiar with neutral plural pronouns being used to refer to one person.  \n\n- **Representation and Inclusivity:**  \n  I hope that they will understand someday what being represented means.  \n\n**Conclusion:**  \nThis novel is a solid 5-star read for me due to its innovative character development and the way it invites readers to shape Ellery's identity. However, the use of neutral pronouns for a singular character can be challenging for non-native English speakers, particularly teenagers, which may limit its accessibility for some audiences. Despite this, the book's representation of non-binary identity is meaningful and important.  \n\n**Rating Scores:**  \n5/5 stars."
    },
    {
        "aspects": [
            "Characters",
            "World-Building and Setting"
        ],
        "review": [
            "The cover art by Schechter instantly drew me in at the local bookshop, prompting an immediate purchase. I admire the consistent quality of the artwork across the series, which enhances its appeal. The novel boasts a cast of likable characters, including engaging, swoon-worthy protagonists.",
            "Lukens masterfully weaves established mythology into their storytelling, enriching the world they've crafted. Their innovative adaptation and expansion of mythological elements bring both depth and originality to the narrative."
        ],
        "conclusion": "This novel is a captivating and enjoyable read, featuring likable characters, creative world-building, and stunning cover art. It’s a book I’ll revisit and one that solidifies my admiration for the author’s storytelling.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "156177769-jolene",
        "reviewer_followers": "37 reviews",
        "reviewer_review_nums": "37 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Cover and Presentation:**  \n  - The cover art by Schechter immediately caught my attention at the local bookshop, and I purchased the book without hesitation.  \n  - I appreciate the consistent quality of the artwork on Lukens' books, which adds to their appeal.  \n\n- **Characters:**  \n  - The novel features a good cast of likable characters, including swoony protagonists that I found engaging.  \n\n- **World-Building and Mythology:**  \n  - Lukens excels at incorporating well-established mythology into their storytelling, enhancing the world they’ve created.  \n  - The way they adapt and expand on mythological elements adds depth and originality to the narrative.  \n\n- **Overall Enjoyment:**  \n  - The book was an absolutely delightful read, and I’ve already added it to my “will read again” pile.  \n  - I’m a huge fan of F.T. Lukens and could easily fill a bookcase with their works without ever growing tired of them.  \n\n**Conclusion:**  \nThis novel by F.T. Lukens is a captivating and enjoyable read, featuring likable characters, creative world-building, and stunning cover art. It’s a book I’ll revisit and one that solidifies my admiration for the author’s storytelling.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Enjoyment and Engagement"
        ],
        "review": [
            "While the book has its slow moments, it ultimately builds to an engaging conclusion. Ellery, who grew up on a farm, faces the challenges of an unending winter caused by a supernatural event that has plagued their family for five years. To support their family, Ellery moves to the city to live with a cousin, where they meet Knox, setting the stage for an intriguing journey.",
            "Ellery, initially a skeptic of the supernatural, finds her beliefs challenged through her connection with Knox. The characters are wonderfully compelling, and I truly loved them!",
            "The enchanting setting enhanced the story's magical atmosphere.",
            "I admit I judged this book by its cover, and I'm so glad I did! It turned out to be utterly charming and enchanting."
        ],
        "conclusion": "This was a delightful and magical read with a unique premise, lovable characters, and an enchanting setting. While the pacing had some slower moments, the story ultimately captivated me and left me thoroughly satisfied.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "56004948-allyson-anderson",
        "reviewer_followers": "7 followers",
        "reviewer_review_nums": "369 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Initial Impression and Appeal:**  \n  I definitely judged a book by its cover, and I'm so glad I did! This book was absolutely adorable and magical.  \n\n- **Plot and Premise:**  \n  Ellery grew up on a farm, but due to a supernatural occurrence, they have been experiencing winter for 5 years, causing their family to suffer. They move in with their cousin in the city to send money back to their family, and that's where they encounter Knox.  \n\n- **Character Development:**  \n  Ellery is not a believer in the supernatural world, but that slowly starts to change after getting to know Knox. I loved the characters so much!  \n\n- **Setting and Atmosphere:**  \n  The setting was enchanting and added to the magical feel of the story.  \n\n- **Pacing:**  \n  The book was a little slow at times, but it picks up and gets so good by the end.  \n\n**Conclusion:**  \nThis was a delightful and magical read with a unique premise, lovable characters, and an enchanting setting. While the pacing had some slower moments, the story ultimately captivated me and left me thoroughly satisfied.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters"
        ],
        "review": [
            "I really appreciated the strong bond between Ellery, Charley, and Zada—there was never a hint of conflict or doubt about their feelings for one another. However, I do wish Ellery hadn't been relegated to a damsel-in-distress role during much of the danger; I can overlook this, though. On a positive note, Knox stood out as a compelling hero."
        ],
        "conclusion": "This was a delightful read, blending sweetness, adventure, and a touch of danger. While I had a minor critique about Ellery's role, the strong character dynamics and well-handled backstory made the book truly enjoyable.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "10481536-amanda",
        "reviewer_followers": "140 reviews",
        "reviewer_review_nums": "140 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Overall Enjoyment:**  \n  I truly loved this book. It was soft and sweet for the majority of the story with a little adventure and a little danger sprinkled in.  \n\n- **Character Dynamics:**  \n  I loved the relationship between Ellery, Charley, and Zada. Their bond never wavered, and not a single thought of \"oh they hate me\" crossed their minds.  \n\n- **Character Development (Ellery):**  \n  I do wish that Ellery hadn't been thrown into the damsel-in-distress role for a lot of the danger, but I'll forgive Lukens for that.  \n\n- **Character Development (Knox):**  \n  Knox was a pretty great hero.  \n\n- **Backstory and Exposition:**  \n  I appreciated that for their backstory, we were mostly told instead of shown. We don't need to know how they left their family; we just need to know that was their life before and this is their life now.  \n\n**Conclusion:**  \nThis was a delightful read, blending sweetness, adventure, and a touch of danger. While I had a minor critique about Ellery's role, the strong character dynamics and well-handled backstory made the book truly enjoyable.  \n\n**Rating Scores:**  \n4.5 stars."
    },
    {
        "aspects": [
            "Characters",
            "Emotional Impact"
        ],
        "review": [
            "I appreciated that the story avoided misgendering and any form of homo-, trans-, or queerphobia. While these real issues are crucial to discuss, it was refreshing to escape into a safe, inclusive space free from such struggles. I became deeply invested in the relationship between the nonbinary MC and the male MC, cheering for them throughout the narrative.",
            "This story is stunning and heart-wrenching, yet warm and sweet. As a genderfluid reader, I found a deep connection with the nonbinary main character, which made me feel seen and resonated with me on many levels."
        ],
        "conclusion": "This novel is a heartfelt and inclusive story of love and found family, offering a safe and affirming space for queer readers. While it has a minor flaw, its emotional depth and representation make it a standout read.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "175030222-aliana-reads",
        "reviewer_followers": "29 reviews",
        "reviewer_review_nums": "29 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Emotional Impact:**  \n  The story is described as \"stunning, beautiful, amazing, heart-wrenching, warm, and sweet.\" It deeply resonated with me, especially as a genderfluid reader, because the main character (MC) is nonbinary, which made me feel seen and connected to the narrative.  \n\n- **Representation and Inclusivity:**  \n  I appreciated the absence of misgendering, homo/trans/queerphobia in the story. While these issues are real and important to address, it was refreshing to have a safe, inclusive space to escape to where these struggles weren't present.  \n\n- **Character Dynamics:**  \n  I was heavily invested in the relationship between the nonbinary MC and the male MC, rooting for them intensely throughout the story.  \n\n- **Minor Critique:**  \n  The only drawback for me was the excessive lip-licking, which felt overdone and slightly distracting.  \n\n**Conclusion:**  \nThis novel is a heartfelt and inclusive story of love and found family, offering a safe and affirming space for queer readers. While it has a minor flaw, its emotional depth and representation make it a standout read.  \n\n**Rating Scores:**  \n4.5 stars"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting"
        ],
        "review": [
            "The pacing is excellent, providing a quick yet immersive experience that's perfect for overcoming a reading slump. The author showcases a talent for storytelling, artfully intertwining heartwarming relationships with an engaging plot.",
            "The novel boasts well-crafted queer characters whose relatability adds depth to the story.",
            "*Otherworldly* offers a captivating and immersive fantasy world, providing readers with a delightful escape."
        ],
        "conclusion": "*Otherworldly* is a gem of a book that reignited my love for reading. Its captivating world, well-developed characters, and perfect pacing make it a must-read for fans of inclusive and imaginative fantasy.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "137116941-ebony",
        "reviewer_followers": "32 reviews",
        "reviewer_review_nums": "32 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **World-Building:**  \n  The fantasy world in *Otherworldly* by F.T. Lukens is captivating and immersive, making it a delightful escape for readers.  \n\n- **Character Development:**  \n  The novel features well-crafted queer characters who are relatable and add depth to the story.  \n\n- **Pacing:**  \n  The pacing is perfect, offering a quick yet immersive read that is ideal for breaking out of a reading slump.  \n\n- **Storytelling:**  \n  F.T. Lukens demonstrates a gift for storytelling, skillfully blending heartwarming relationships with an engaging plot.  \n\n- **Inclusivity:**  \n  The book is highly recommended for fans of inclusive fantasy, as it celebrates diversity and representation.  \n\n**Conclusion:**  \n*Otherworldly* by F.T. Lukens is a gem of a book that reignited my love for reading. Its captivating world, well-developed characters, and perfect pacing make it a must-read for fans of inclusive and imaginative fantasy.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "World-Building and Setting",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The romance between Knox and Ellery was the highlight of the book for me. It was sweet, wholesome, and beautifully executed. The amnesia trope was skillfully integrated, adding depth to their relationship.",
            "The world-building was expertly crafted, creating an interesting and immersive experience. The author skillfully avoided info-dumping, allowing the story to unfold naturally and effortlessly.",
            "This novel was a true delight, featuring a magical and cozy atmosphere that enhanced the reading experience. The found family trope resonated deeply with me, adding a meaningful layer to the story."
        ],
        "conclusion": "This novel was a highly enjoyable read, combining a magical and cozy atmosphere with strong world-building and a heartwarming romance. Despite a few minor frustrations, it was a masterful and engaging story.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "146263532-kaisa-sild",
        "reviewer_followers": "5 followers",
        "reviewer_review_nums": "826 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Enjoyment and Atmosphere:**  \n  The novel was incredibly enjoyable, with a magical and cozy atmosphere that made it a delight to read. The found family trope was particularly impactful and resonated deeply with me.  \n\n- **World-Building:**  \n  The world-building was masterfully executed. It was interesting and immersive, and the author managed to avoid info-dumping, making the experience feel effortless and natural.  \n\n- **Romance:**  \n  The romance between Knox and Ellery was my favorite part of the book. It was sweet, wholesome, and beautifully written. The amnesia trope was handled well, which added depth to their relationship.  \n\n- **Frustrations:**  \n  While the book was overall fantastic, there were a few frustrating moments that slightly detracted from the experience.  \n\n**Conclusion:**  \nThis novel was a highly enjoyable read, combining a magical and cozy atmosphere with strong world-building and a heartwarming romance. Despite a few minor frustrations, it was a masterful and engaging story.  \n\n**Rating Scores:**  \n4.75⭐"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes"
        ],
        "review": [
            "While the story had its moments, certain parts of the plot felt flat, leading me to deduct two stars.",
            "I absolutely adored Knox for being such a soft-hearted supernatural being, which I found endearing. I would also love to read more about Zada and Charley.",
            "I found a great deal of comfort in this book, likely due to the heartfelt found family trope woven throughout the story."
        ],
        "conclusion": "This book was a fun and comforting read, largely due to the endearing characters like Knox and the heartwarming found family trope. While the plot had some flat moments, the overall experience was enjoyable, and I’d love to see more of certain characters in the future.",
        "rating": "3",
        "review_likes": "1",
        "reviewer_id": "95015553-lara",
        "reviewer_followers": "6 followers",
        "reviewer_review_nums": "160 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n  - I absolutely adored Knox because, for a supernatural being, he was a total softie, and I totally loved that!  \n  - I also wouldn’t mind reading more about Zada & Charley.  \n\n- **Themes and Emotional Impact:**  \n  - I found a lot of comfort in this book. I don’t know why exactly, but I think the found family trope had something to do with it.  \n\n- **Plot Execution:**  \n  - At some points, the plot felt very flat, so I had to remove two stars.  \n\n- **Overall Enjoyment:**  \n  - This was a fun, quick read!  \n  - All in all, it was a very enjoyable book!  \n\n**Conclusion:**  \nThis book was a fun and comforting read, largely due to the endearing characters like Knox and the heartwarming found family trope. While the plot had some flat moments, the overall experience was enjoyable, and I’d love to see more of certain characters in the future.  \n\n**Rating Scores:**  \n- Mentioned deduction of two stars due to flat plot points (exact rating not specified)."
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "World-Building and Setting"
        ],
        "review": [
            "The characters are entertaining and relatable, making them engaging for readers.",
            "The novel is predominantly light-hearted, following a clear and predictable trajectory that guarantees a happy ending. Two pivotal turning points at the one-third and two-thirds marks introduce depth and maintain the narrative's engagement.",
            "The fantasy lore is thoughtfully crafted, offering enough detail to be engaging while leaving ample space for imagination and further exploration."
        ],
        "conclusion": "The novel delivers a light-hearted, enjoyable read with well-developed characters and a thoughtfully crafted fantasy world. The predictable yet engaging storyline, punctuated by key plot twists, ensures a satisfying and happy ending. The reader's enthusiasm for the author's work underscores the novel's appeal.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "23016847-amanda",
        "reviewer_followers": "5 followers",
        "reviewer_review_nums": "310 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Tone and Mood:** The novel is mostly light-hearted and follows a clear, predictable line, ensuring a happy ending. There are two significant story change points at about the 1/3 and 2/3 marks, which add depth and keep the narrative engaging.\n- **Character Development:** The characters are fun and enjoyable, making them relatable and engaging for the reader.\n- **World-Building:** The fantasy lore is well-thought-out, providing enough detail to make sense while leaving room for imagination and further exploration.\n- **Author's Reputation:** The reviewer admits to being a fan of F.T. Lukens, stating that anything by the author is an \"instaread,\" indicating a high level of trust and enjoyment in the author's work.\n\n**Conclusion:**\nThe novel by F.T. Lukens delivers a light-hearted, enjoyable read with well-developed characters and a thoughtfully crafted fantasy world. The predictable yet engaging storyline, punctuated by key plot twists, ensures a satisfying and happy ending. The reviewer's enthusiasm for the author's work underscores the novel's appeal.\n\n**Rating Scores:**\n{No specific rating scores mentioned in the review.}"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The plot's excessive jumping around made it disjointed, evoking a fan-fiction feel. The book's rapid pace and overly light tone became uncomfortable at times.",
            "The characters lacked depth and relatability, making it difficult to connect with them, even for a story centered around non-humans.",
            "While the story had its moments, certain lines felt cringe-worthy and detracted from the overall experience. The awkward and forced tone made it challenging to fully engage with the narrative.",
            "As a fan of this author and their previous works, I found this particular book disappointing. While I recognize that it may resonate with others, it simply wasn't to my taste."
        ],
        "conclusion": "Despite being a fan of the author's previous works, this novel fell short for me due to its overly fluffy tone, awkward writing, and disjointed plot. While it may appeal to others, it didn’t resonate with my preferences.",
        "rating": "2",
        "review_likes": "1",
        "reviewer_id": "84288402-laney-mills",
        "reviewer_followers": "3 followers",
        "reviewer_review_nums": "27 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Pacing and Tone:**  \n  - The book felt overly fast-paced and fluffy, to the point of being uncomfortable.  \n  - The tone was awkward and forced, making it difficult to enjoy the story.  \n\n- **Character Development:**  \n  - The characters felt unrealistic and hard to connect with, despite the story being about non-humans.  \n\n- **Plot Structure:**  \n  - The plot jumped around excessively, making it feel disjointed and reminiscent of fan-fiction.  \n\n- **Writing Style:**  \n  - Some lines were cringe-worthy and detracted from the overall reading experience.  \n\n- **Personal Enjoyment:**  \n  - While I am a fan of F.T. Lukens and have enjoyed their other works, this particular book missed the mark for me.  \n  - I acknowledge that others may love this book, but it was not my cup of tea.  \n\n**Conclusion:**  \nDespite being a fan of F.T. Lukens' previous works, this novel fell short for me due to its overly fluffy tone, awkward writing, and disjointed plot. While it may appeal to others, it didn’t resonate with my preferences.  \n\n**Rating Scores:**  \n2.5 stars."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Emotional Impact"
        ],
        "review": [
            "The narrative centers on a bargain and a bucket list, infusing the story with nostalgia and excitement. Knox's list of activities evokes the thrill of a scavenger hunt, making the tale both engaging and enjoyable.",
            "The phrase \"Love remembers\" perfectly captures the story's emotional depth, leaving a lasting impact."
        ],
        "conclusion": "This novel is a delightful blend of MM romance, found family, and supernatural whimsy. Knox’s innocence and the nostalgic bucket list theme make the story heartwarming and engaging. The found family dynamic feels authentic, and the snowy, magical setting enhances the overall charm. It’s a memorable read with emotional depth and a touch of nostalgia.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "91076888-ryann-rice",
        "reviewer_followers": "9 followers",
        "reviewer_review_nums": "1,055 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Romantic Dynamics (MM Romance):** The novel features a captivating MM romance between a human and a supernatural being, reminiscent of a crossroads demon. The relationship is sweet and heartfelt, with Knox being particularly endearing due to his innocence and charm.  \n- **Found Family Theme:** The found family aspect is a standout element, with the cast of characters creating a sense of authenticity and warmth. This dynamic made the story even more enjoyable than the author’s previous work, *In Deeper Waters*.  \n- **Supernatural and Whimsical Elements:** The story is infused with supernatural vibes, magic, and whimsy, creating an enchanting atmosphere. The snowy setting adds to the charm and complements the magical tone.  \n- **Plot and Themes:** The narrative revolves around a bargain and a bucket list, which adds a layer of nostalgia and excitement. Knox’s list of things to do evokes scavenger hunt/bucket list nostalgia, making the story engaging and fun.  \n- **Emotional Resonance:** The phrase “Love remembers” encapsulates the emotional depth of the story, leaving a lasting impression.  \n\n**Conclusion:**  \nThis novel is a delightful blend of MM romance, found family, and supernatural whimsy. Knox’s innocence and the nostalgic bucket list theme make the story heartwarming and engaging. The found family dynamic feels authentic, and the snowy, magical setting enhances the overall charm. It’s a memorable read with emotional depth and a touch of nostalgia.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language"
        ],
        "review": [
            "This charming story is fun, breezy, and lighthearted, featuring a quick and engaging plot. However, the supernatural elements are underdeveloped, lacking proper explanations.",
            "The characters are charming, especially the side couple, whose strong connection is beautifully captured in their plea: \"Adopt me, please!\"",
            "The novel is delightfully fluffy, featuring moments of adventure that enhance its lighthearted and enjoyable tone."
        ],
        "conclusion": "This novel by FT Lukens delivers a fun, lighthearted, and adorable story with charming characters and a refreshing plot. While the supernatural elements could have been more developed, the overall experience is enjoyable and fluffy, with moments of adventure that keep me engaged.",
        "rating": "3",
        "review_likes": "1",
        "reviewer_id": "28782884-norah-una-sumner",
        "reviewer_followers": "510 followers",
        "reviewer_review_nums": "879 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Plot and Pacing:**  \n  - The story is described as \"fun, breezy, and adorable,\" with a \"quick, refreshing, and fun plot.\"  \n  - However, the supernatural elements felt underdeveloped, as they were \"given to us without a proper explanation.\"  \n\n- **Character Development:**  \n  - The characters are \"cute,\" and the reviewer particularly enjoyed the side couple, expressing a strong connection by saying, \"adopt me, please.\"  \n\n- **Tone and Atmosphere:**  \n  - The novel is \"really fluffy\" and has moments of adventure, contributing to its lighthearted and enjoyable tone.  \n\n- **Overall Enjoyment:**  \n  - While not the reviewer's favorite by F.T. Lukens, it was still an enjoyable read, described as \"a bit underdeveloped but really fluffy and at times even rather adventurous.\"  \n\n**Conclusion:**  \nThis novel by F.T. Lukens delivers a fun, lighthearted, and adorable story with charming characters and a refreshing plot. While the supernatural elements could have been more developed, the overall experience is enjoyable and fluffy, with moments of adventure that keep the reader engaged.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Themes"
        ],
        "review": [
            "The novel boasts a cast of strong characters, including Ellery, Knox, Charley, and Zada. Even those who initially appear obnoxious, such as Bram (the Bird-god) and Hale (the Undead Guy), ultimately support Ellery, adding depth and complexity to the narrative.",
            "The book masterfully explores self-acceptance and the acceptance of others, while also addressing the diverse meanings of family. This nuanced portrayal deeply resonated with me."
        ],
        "conclusion": "This is a compelling novel with well-developed characters and meaningful themes. The exploration of self-acceptance and the concept of family made the story particularly impactful. While I initially considered it a 4.5-star book, I rounded up to 5 stars because of how much I enjoyed it.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "3768168-p-m",
        "reviewer_followers": "1,345 reviews",
        "reviewer_review_nums": "1,345 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Characters:**  \n  The novel features great characters like Ellery, Knox, Charley, and Zada. Even seemingly obnoxious characters like Bram (Bird-god) and Hale (Undead Guy) ultimately come through for Ellery, adding depth and complexity to the story.\n\n- **Themes:**  \n  The book excels in exploring the theme of self-acceptance and the acceptance of others. It also delves into the idea of family, emphasizing that family can mean different things to different people, which resonated deeply with me.\n\n**Conclusion:**  \nThis is a compelling novel with well-developed characters and meaningful themes. The exploration of self-acceptance and the concept of family made the story particularly impactful. While I initially considered it a 4.5-star book, I rounded up to 5 stars because of how much I enjoyed it.\n\n**Rating Scores:**  \n5/5 stars."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Emotional Impact",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The pacing of the story was well-balanced, maintaining engagement without feeling rushed or drawn out. The plot struck a perfect balance of intrigue and suspense, making it compelling without overwhelming the narrative.",
            "The characters were well-developed and had enough depth to be engaging, adding significant emotional weight to the story. The romance was a strong element that enhanced the book's charm.",
            "The writing was excellent and perfectly matched the book's overall tone.",
            "I thoroughly enjoyed the atmosphere of this book. Its charming and engaging vibe drew me in, evoking a range of emotions. I found myself crying twice, yet I also laughed, creating a well-balanced emotional experience.",
            "The humor was cleverly executed, eliciting multiple laughs from me throughout the book."
        ],
        "conclusion": "This was a charming and well-rounded book with a perfect blend of humor, emotion, and suspense. The characters, lore, and writing style all contributed to an engaging and enjoyable reading experience.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "111652523-julia",
        "reviewer_followers": "6 followers",
        "reviewer_review_nums": "427 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Vibes:** I really enjoyed the vibes of this book. It had a charming and engaging atmosphere that drew me in.  \n- **Characters:** The characters had enough depth to be interesting and were well-developed. They were lovely and added a lot of emotion to the story.  \n- **Lore:** The lore was intriguing and added richness to the world-building.  \n- **Pace:** The pacing was well-balanced, keeping the story engaging without feeling rushed or dragged out.  \n- **Romance:** The romance was a strong element of the book and added to its charm.  \n- **Humor:** The humor was well-executed and made me laugh multiple times throughout the book.  \n- **Emotional Impact:** The book evoked a range of emotions—I cried twice but also laughed, which created a balanced emotional experience.  \n- **Plot and Suspense:** The plot had the right amount of intrigue and suspense, making it compelling without overwhelming the story.  \n- **Writing Style:** The writing was really nice and complemented the overall tone of the book.  \n\n**Conclusion:**  \nThis was a charming and well-rounded book with a perfect blend of humor, emotion, and suspense. The characters, lore, and writing style all contributed to an engaging and enjoyable reading experience.  \n\n**Rating Scores:**  \n4.5⭐️"
    },
    {
        "aspects": [
            "Characters",
            "Enjoyment and Engagement"
        ],
        "review": [
            "I truly appreciate the inclusion of they/them pronouns for the main character. As someone from an older generation, I often feel anxious about inadvertently using incorrect pronouns. Books like this, which model the correct use of they/them, are invaluable and reassuring. I would love to see similar works in French, as integrating the iel pronoun into a more gendered language like French poses an even greater challenge.",
            "The story was decent, but it failed to leave a lasting impression."
        ],
        "conclusion": "This book stands out for its thoughtful and inclusive use of they/them pronouns, which I found both educational and reassuring. While the story itself was just okay, the representation and normalization of nonbinary pronouns made it a worthwhile read.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "177342607-gi-v",
        "reviewer_followers": "249 reviews",
        "reviewer_review_nums": "249 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation and Inclusivity:**  \n  - I really appreciate the use of they/them pronouns for the main character. As a member of an older generation, I often feel anxious about potentially causing hurt or offense by using incorrect pronouns. Books like this, which provide examples of using they/them correctly, are fantastic and helpful.  \n  - I would love to read similar books in French, as I think using the \"iel\" pronoun in a more gendered language like French would be even more challenging to incorporate fluidly.  \n\n- **Story Quality:**  \n  - The story itself was okay, but it didn’t stand out as particularly remarkable.  \n\n**Conclusion:**  \nThis book stands out for its thoughtful and inclusive use of they/them pronouns, which I found both educational and reassuring. While the story itself was just okay, the representation and normalization of nonbinary pronouns made it a worthwhile read.  \n\n**Rating Scores:**  \n- Representation and Inclusivity: 5/5  \n- Story Quality: 3/5"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting"
        ],
        "review": [
            "The villains fell short of their goals and were defeated three-quarters of the way through the book. This paved the way for a genuine hero's journey, making the ending all the more satisfying and rewarding.",
            "This story features relatable characters who could easily emerge from a Greek myth. I enjoyed the dynamic of the found family and the quirky supernatural beings that populate these pages. The diverse cast enriches the narrative, offering depth to the overall experience. The romantic elements are distinctly YA—centered around innocent kisses—but the emotions are profound. The characters demonstrate a willingness to make significant sacrifices for one another, which adds substantial emotional weight to their relationships.",
            "The author masterfully crafts a seamless world that blends realism with a fairy tale essence, reminiscent of Narnia—a vibe I absolutely adored."
        ],
        "conclusion": "This book is a delightful blend of fantasy, adventure, and heartfelt romance, with a world and characters that are both enchanting and relatable. The hero's journey and the satisfying ending make it a standout read.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "5970388-birgitta",
        "reviewer_followers": "3 followers",
        "reviewer_review_nums": "280 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **World-Building:**  \n  F.T. Lukens has a great way of creating a seamless world that is both realistic and fairy tale-like. The story gave me a Narnia vibe, which I absolutely loved.  \n\n- **Characters:**  \n  The characters are both relatable and could have walked out of a Greek myth. I loved all the characters, the found family, and the quirky supernaturals who inhabit these pages. The cast is truly diverse, which adds depth and richness to the story.  \n\n- **Romance:**  \n  The love stories in this book are truly YA—just kissing and quite innocent—but the feelings are very deep. The characters are willing to make great sacrifices for each other, which adds emotional weight to their relationships.  \n\n- **Plot and Pacing:**  \n  The villains were not that successful and were vanquished three-quarters of the way through the book. The rest of the story was a true hero's journey, which made the ending all the more satisfying and sweet.  \n\n- **Overall Enjoyment:**  \n  I did not want this book to end, that’s how much I loved it! I highly recommend this and all of Lukens' books to readers who love YA fantasy, adventure, and a diverse cast of characters.  \n\n**Conclusion:**  \nThis book is a delightful blend of fantasy, adventure, and heartfelt romance, with a world and characters that are both enchanting and relatable. The hero's journey and the satisfying ending make it a standout read.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "Enjoyment and Engagement"
        ],
        "review": [
            "Ellery was a wonderfully dependable character, while Knox brought a lovely brightness that added depth and charm to the story.",
            "The book's cozy and engaging tone made it a delightful read, while its warmth and sense of adventure kept me thoroughly entertained.",
            "Thank you to Simon & Schuster Canada for the ARC and to the author for this wonderful book. I'm looking forward to exploring their other works in the future."
        ],
        "conclusion": "This book was a delightful, cozy read filled with adventure, warmth, and lovable characters. It left me eager to read more from the author and grateful for the opportunity to experience it early.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "173841288-book-fae",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "23 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Overall Enjoyment:**  \n  The book did not disappoint. It was cute, fluffy, and filled with adventure and warmth, especially considering it revolves around a 5-year winter.  \n\n- **Character Development:**  \n  Ellery was an absolutely reliable character, and Knox was lovely and bright. Both characters added depth and charm to the story.  \n\n- **Writing Style and Tone:**  \n  The book had a cozy and engaging tone, making it a delightful read. The warmth and adventure kept me thoroughly entertained.  \n\n- **Recommendation:**  \n  I highly recommend getting this book when it releases on April 2nd. It’s worth going as feral as I did over this cozy story!  \n\n- **Gratitude and Future Interest:**  \n  Thank you to Simon and Schuster Canada for the ARC and to FT Lukens for such a wonderful book. I’m excited to explore their other works in the future.  \n\n**Conclusion:**  \nThis book was a delightful, cozy read filled with adventure, warmth, and lovable characters. It left me eager to read more from the author and grateful for the opportunity to experience it early.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language",
            "World-Building and Setting"
        ],
        "review": [
            "I adore the characters; they are intricately crafted and engaging, allowing for a strong personal connection. The queer representation is always authentic and meaningful, never feeling like a mere plot device, which I truly appreciate.",
            "I have enjoyed all of the author's books I've read, and *Otherworldly* is no exception. Their writing consistently resonates with me, and this book upholds the high standard I’ve come to expect.",
            "Lukens crafts immersive and captivating worlds, and *Otherworldly* is no exception, presenting a setting that is both rich and believable."
        ],
        "conclusion": "*Otherworldly* is another excellent addition to the author's body of work. With its compelling characters, immersive world-building, and authentic queer representation, it’s a book I thoroughly enjoyed and would highly recommend.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "93873-mandy",
        "reviewer_followers": "65 followers",
        "reviewer_review_nums": "974 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Author's Writing Style and Consistency:**  \n  I love all of Lukens's books (that I've read so far), and *Otherworldly* was no exception. Their writing consistently resonates with me, and this book maintained the high standard I’ve come to expect from their work.\n\n- **Character Development:**  \n  I love their characters. They are well-crafted and engaging, making it easy to connect with them on a personal level.\n\n- **World-Building:**  \n  The worlds Lukens creates are immersive and captivating. *Otherworldly* continued this trend, offering a setting that felt rich and believable.\n\n- **Representation:**  \n  The queer representation in Lukens's books is always authentic and meaningful. It never feels like a plot device, which I deeply appreciate.\n\n**Conclusion:**  \n*Otherworldly* is another excellent addition to Lukens's body of work. With its compelling characters, immersive world-building, and authentic queer representation, it’s a book I thoroughly enjoyed and would highly recommend.\n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Themes"
        ],
        "review": [
            "I found myself wanting to hug all the characters in this story. The main characters shared delightful, silly moments that I truly enjoyed. I especially appreciated the inclusion of a non-binary character whose narrative didn't focus on struggles related to their gender.",
            "The book's exploration of found family was heartwarming and resonated deeply with me."
        ],
        "conclusion": "*Otherworldly* is a delightful and heartwarming read with lovable characters, meaningful representation, and a strong found family theme. It’s a story that feels both cozy and magical, leaving me with a smile.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "145217819-chrissy-maclaughlin",
        "reviewer_followers": "6 followers",
        "reviewer_review_nums": "356 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Character Development:**  \n  I just wanted to hug all of the characters. The main characters had so many silly little moments that I absolutely loved.  \n- **Representation:**  \n  I appreciated seeing an NB character whose story didn’t revolve around struggles related to their gender.  \n- **Themes:**  \n  The epic found family aspect of this book was heartwarming and resonated deeply with me.  \n- **Overall Tone:**  \n  The book was so damn cute and had that signature F.T. Lukens charm that I adore.  \n\n**Conclusion:**  \n*Otherworldly* is a delightful and heartwarming read with lovable characters, meaningful representation, and a strong found family theme. It’s a story that feels both cozy and magical, leaving me with a smile.  \n\n**Rating Scores:**  \n4⭐️"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Writing and Language",
            "Themes",
            "Expectation Fulfillment"
        ],
        "review": [
            "The story was both entertaining and enjoyable.",
            "While I appreciated many aspects of the writing, I found it somewhat lacking. It occasionally leaned towards being overly expository, though I struggle to identify the specific elements that caused this impression. Listening to the audiobook further complicated my ability to pinpoint the exact issue.",
            "I’ve always appreciated the found-family theme, and it truly stood out in this novel.",
            "This is an excellent YA novel that I will definitely recommend to the teens in my life."
        ],
        "conclusion": "Overall, this was a very cute and enjoyable novel with a fun plot and a heartwarming found-family theme. While I had some reservations about the writing style, it didn’t detract significantly from my enjoyment. I consider it a great YA novel and will recommend it to younger readers.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "750618-h-j-swinford",
        "reviewer_followers": "68 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**  \n- **Plot and Theme:**  \n  - The story was fun and enjoyable.  \n  - I always love a good found-family theme, which was a highlight of the novel.  \n\n- **Writing Style:**  \n  - There was something about the writing that I didn’t totally love.  \n  - It sometimes felt too \"tell-y,\" though I’m not entirely sure what specifically bothered me.  \n  - Listening to the audiobook made it harder to pinpoint the exact issue with the writing.  \n\n- **Target Audience and Recommendation:**  \n  - I think it was a great YA novel.  \n  - I’ll definitely be recommending it to the teens in my house.  \n\n**Conclusion:**  \nOverall, this was a very cute and enjoyable novel with a fun plot and a heartwarming found-family theme. While I had some reservations about the writing style, it didn’t detract significantly from my enjoyment. I consider it a great YA novel and will recommend it to younger readers.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Enjoyment and Engagement",
            "Expectation Fulfillment"
        ],
        "review": [
            "The main characters appeared to be a rehash of those in *Spellbound*, lacking originality and depth.",
            "The plot had moments of intrigue, but was often dragged down by periods of tedium, resulting in a mixed experience overall.",
            "After thoroughly enjoying *Spellbound* last year, I had high hopes for this book. Unfortunately, it failed to meet those expectations."
        ],
        "conclusion": "While the book had its moments, it ultimately fell short of my expectations, particularly in comparison to *Spellbound*. The repetitive characters and inconsistent pacing made it a less enjoyable read overall.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "34047993-rea",
        "reviewer_followers": "6 followers",
        "reviewer_review_nums": "205 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Expectations vs. Reality:**  \n  I went into this book with high expectations after reading and loving *Spellbound* last year. Unfortunately, this book didn’t live up to those expectations.  \n- **Character Development:**  \n  The main characters felt like a repeat of those in *Spellbound*, lacking originality or depth.  \n- **Plot Engagement:**  \n  The plot was interesting at times but painfully boring at others, making it a mixed experience.  \n- **Overall Satisfaction:**  \n  I’m glad I finished the book, but I’m sad I didn’t love it as much as I hoped I would.  \n\n**Conclusion:**  \nWhile the book had its moments, it ultimately fell short of my expectations, particularly in comparison to *Spellbound*. The repetitive characters and inconsistent pacing made it a less enjoyable read overall.  \n\n**Rating Scores:**  \n3.5 (rounded up)."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Themes",
            "Expectation Fulfillment"
        ],
        "review": [
            "This story is slow-paced and cozy, making it an ideal read for the fall and winter seasons.",
            "Charming and relatable characters, including a non-binary protagonist, create a warm atmosphere. The story features a sweet, wholesome, slow-burn romance that unfolds beautifully.",
            "The story features a captivating spooky setting filled with intriguing creatures.",
            "This story beautifully explores the concepts of found family and queer representation, while addressing real-world issues such as religion and societal norms.",
            "A captivating urban fantasy that immerses readers in a warm and engaging atmosphere."
        ],
        "conclusion": "This novel is a perfect fall/winter read, offering a cozy and immersive experience with its likable characters, spooky yet inviting setting, and meaningful themes. The inclusion of queer representation, a slow-burn romance, and relatable societal commentary makes it a standout urban fantasy. Highly recommended for those seeking a slow-paced, heartwarming story.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "98537513-mila",
        "reviewer_followers": "13 reviews",
        "reviewer_review_nums": "13 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Characters:** Cozy and likable characters, including a non-binary main character.  \n- **Setting:** Spooky setting with intriguing creatures.  \n- **Themes:** Found family, queer representation, and themes that reflect real-world issues (e.g., religion and societal norms).  \n- **Romance:** Sweet, wholesome, slow-burn romance.  \n- **Pacing and Tone:** Slow-paced, cozy, and perfect for fall/winter reading.  \n- **Genre:** Urban fantasy with a comforting and engaging atmosphere.  \n\n**Conclusion:**  \nThis novel is a perfect fall/winter read, offering a cozy and immersive experience with its likable characters, spooky yet inviting setting, and meaningful themes. The inclusion of queer representation, a slow-burn romance, and relatable societal commentary makes it a standout urban fantasy. Highly recommended for those seeking a slow-paced, heartwarming story.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Themes",
            "Expectation Fulfillment"
        ],
        "review": [
            "The plot is quite simple and lacks excitement, making it feel somewhat dull. Additionally, the ending is resolved too quickly, which contributes to an overall sense of rushing in the story.",
            "The romance lacks depth and progression, failing to fully engage the reader.",
            "This novel masterfully intertwines magic and queer romance, offering authentic representation against a captivating snowy backdrop.",
            "The fantasy elements are subtle, which might disappoint readers seeking a more immersive magical experience."
        ],
        "conclusion": "While the novel has charming elements, such as its queer romance and snowy setting, it falls short in terms of plot complexity, pacing, and character development. The light fantasy elements and underdeveloped romance leave the story feeling incomplete, making it a somewhat underwhelming read despite its potential.",
        "rating": "3",
        "review_likes": "1",
        "reviewer_id": "108801483-sina",
        "reviewer_followers": "6 followers",
        "reviewer_review_nums": "332 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Genre and Themes:**  \n  - The novel combines magic and queer romance, with good representation and a snowy setting.  \n  - The fantasy elements are very light, which may not satisfy readers looking for a more immersive magical world.  \n\n- **Plot and Pacing:**  \n  - The plot is super simple and kind of boring.  \n  - The ending resolves rather quickly, leaving the story feeling rushed.  \n\n- **Character Development and Relationships:**  \n  - The romance feels underdeveloped, lacking the depth and progression needed to fully engage the reader.  \n\n- **Overall Enjoyment:**  \n  - The book was super cute but ultimately underwhelming.  \n  - It wasn’t bad, but it had the potential to be so much better.  \n\n**Conclusion:**  \nWhile the novel has charming elements, such as its queer romance and snowy setting, it falls short in terms of plot complexity, pacing, and character development. The light fantasy elements and underdeveloped romance leave the story feeling incomplete, making it a somewhat underwhelming read despite its potential.  \n\n**Rating Scores:**  \n- No specific rating scores mentioned in the review."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Themes"
        ],
        "review": [
            "The story is delightful, featuring engaging and vivid characters. Ellery, the brave protagonist, possesses a big heart. Their bargain with an unknown entity leads to a transformative and positive change.",
            "I was pleasantly surprised to see the main character, Ellery, identified as non-binary (they/them). It was refreshing to have a non-binary character take center stage. The relationship between Ellery and their cousin Charley was beautifully portrayed, and Charley's girlfriend, Zada, provided a delightful dynamic that had me rolling my eyes in amusement at their cuteness. Knox, a liminal creature, was also well-crafted, with his emotions resonating throughout the story. While he lives in the moment, his interactions with Ellery truly stand out. The secondary characters, including Hale, Lorelai, and Bram, were distinct and well-developed, adding depth to the narrative.",
            "The author's universe is captivating, and I look forward to exploring it further.",
            "This novel masterfully blends magic with the ordinary, showcasing love that triumphs against all odds. "
        ],
        "conclusion": "This novel is a delightful read with strong representation, well-developed characters, and a captivating story. Ellery's journey is both brave and heartwarming, and the relationships and world-building add depth to the narrative.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "1913454-trisha-thacker",
        "reviewer_followers": "12 followers",
        "reviewer_review_nums": "Author ",
        "reformatted_ori_review": "**Aspects:**  \n- **Representation and Diversity:**  \n  - It was a pleasant surprise to have the main character, Ellery, be non-binary (they/them). Having a non-binary character take center stage was a delight.  \n\n- **Character Development and Relationships:**  \n  - The relationships between Ellery and their cousin Charley were wonderfully done. Charley's girlfriend, Zada, was a constant source of enjoyment, and I found myself rolling my eyes along with Ellery at how cute they were together.  \n  - Knox, a liminal creature, was wonderfully written, and his emotions were palpable. He lives in the moment, but his moments with Ellery truly shine.  \n  - The secondary characters, such as Hale, Lorelai, and Bram, were well-written and distinct, adding depth to the story.  \n\n- **World-Building and Setting:**  \n  - The universe created by the author is engaging, and I would love to explore more of it.  \n\n- **Plot and Themes:**  \n  - The story itself is lovely, with engaging and vivid characters. Ellery is a brave protagonist with a big heart. They make a bargain with something unknown, which changes them for the better.  \n  - The novel beautifully portrays magic in the ordinary world and love defying all odds.  \n\n**Conclusion:**  \nThis novel is a delightful read with strong representation, well-developed characters, and a captivating story. Ellery's journey is both brave and heartwarming, and the relationships and world-building add depth to the narrative.  \n\n**Rating Scores:**  \n10/10 – Highly recommended for anyone who enjoys seeing magic in the ordinary world and love that defies all odds."
    },
    {
        "aspects": [
            "Writing and Language",
            "Emotional Impact",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The author possesses a remarkable talent for creating stories that are both engaging and emotionally fulfilling.",
            "The story was enchanting and warm, offering a deeply comforting and immersive experience.",
            "This book was absolutely captivating and addictive; I found it impossible to put down. It enveloped me like a warm blanket, and I loved it so much that I'm eagerly looking forward to reading more from this author."
        ],
        "conclusion": "*Otherworldly* is a beautifully written, enchanting, and addictive novel that left me feeling warm and comforted. The author's storytelling is exceptional, and I am eagerly looking forward to their future works.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "27172397-steph",
        "reviewer_followers": "51 reviews",
        "reviewer_review_nums": "51 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Engagement and Addictiveness:**  \n  The book was incredibly engaging and addictive. I couldn't put it down, and it felt like being wrapped up in a warm blanket.  \n\n- **Emotional Resonance:**  \n  The story was enchanting and warm, creating a deeply comforting and immersive experience.  \n\n- **Author's Craft:**  \n  The author has a unique ability to craft stories that are both captivating and emotionally satisfying.  \n\n- **Anticipation for Future Works:**  \n  I loved this book so much that I cannot wait to read more from the author.  \n\n**Conclusion:**  \n*Otherworldly* is a beautifully written, enchanting, and addictive novel that left me feeling warm and comforted. The author's storytelling is exceptional, and I am eagerly looking forward to their future works.  \n\n**Rating Scores:**  \nNot explicitly mentioned in the review."
    },
    {
        "aspects": [
            "Characters",
            "Enjoyment and Engagement",
            "Expectation Fulfillment"
        ],
        "review": [
            "I found it difficult to connect with the characters, which ultimately affected my overall experience of the story.",
            "I found the novel delightful, with a charming quality that set it apart. It surpassed the typical 3-star read for me, prompting me to round my rating up to a 4.",
            "My expectations may have been too high, particularly because I loved the author's previous work, *Spellbound*. This likely shaped my perception of the novel."
        ],
        "conclusion": "While the novel was cute and enjoyable, I didn’t feel as connected to the characters as I had hoped. My high expectations, influenced by my love for *Spellbound*, may have played a role in this. Overall, it was a solid read, but it didn’t quite meet my personal expectations.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "5585039-katie-lou",
        "reviewer_followers": "68 followers",
        "reviewer_review_nums": "278 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Enjoyment:** The novel was enjoyable and had a cute, charming quality to it. I found it more enjoyable than a typical 3-star read, which is why I rounded my rating up to a 4.\n- **Character Connection:** I didn’t connect with the characters as deeply as I had hoped. This lack of connection impacted my overall experience with the story.\n- **Expectations:** My expectations might have been set too high, especially since I absolutely adored the author’s previous work, *Spellbound*. This likely influenced my perception of the novel.\n\n**Conclusion:**\nWhile the novel was cute and enjoyable, I didn’t feel as connected to the characters as I had hoped. My high expectations, influenced by my love for *Spellbound*, may have played a role in this. Overall, it was a solid read, but it didn’t quite meet my personal expectations.\n\n**Rating Scores:**\n3.5 (rounded up to 4)."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Writing and Language",
            "World-Building and Setting",
            "Themes"
        ],
        "review": [
            "The story features a captivating journey through the underworld, infusing the plot with excitement and adventure.",
            "The story is enjoyable overall, but some moments felt a bit cringey, which slightly detracted from the experience.",
            "The book presents an enjoyable and captivating magic system that enriches the narrative.",
            "This charming urban fantasy centers on a non-binary/male (NB/M) romance, complemented by a side female/female (F/F) relationship. The story delves into themes of family, faith, and the tumultuous adventures of teenage life."
        ],
        "conclusion": "This urban fantasy novel is a fun read with a unique magic system, engaging relationships, and a mix of teen drama and adventure. Despite some cringey moments, it offers an entertaining journey through themes of family, faith, and the underworld.",
        "rating": "3",
        "review_likes": "1",
        "reviewer_id": "6899197-jen-appell",
        "reviewer_followers": "16 followers",
        "reviewer_review_nums": "505 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Genre and Themes:**  \n  The novel is a cute urban fantasy with a focus on a non-binary/male (NB/M) romance and a side female/female (F/F) relationship. It also explores themes of family, faith, and teen drama adventures.  \n\n- **Magic System:**  \n  The book features a fun and engaging magic system that adds depth to the story.  \n\n- **Plot and Setting:**  \n  The narrative includes a trip through the underworld, which adds an exciting and adventurous element to the plot.  \n\n- **Writing Style and Tone:**  \n  While the story is enjoyable overall, there were moments that felt a little cringey, which slightly detracted from the experience.  \n\n**Conclusion:**  \nThis urban fantasy novel is a fun read with a unique magic system, engaging relationships, and a mix of teen drama and adventure. Despite some cringey moments, it offers an entertaining journey through themes of family, faith, and the underworld.  \n\n**Rating Scores:**  \n3.5 ⭐"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "World-Building and Setting",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The ending is both powerful and satisfying, though the pacing did slow a bit around the three-quarter mark.",
            "I really enjoyed the world in which the story is set.",
            "Initially, it took me some time to fully engage with the story."
        ],
        "conclusion": "Overall, I enjoyed this novel. While it had some pacing issues in the middle, the world-building was captivating, and the ending left a strong impression. It stands out as the author's best work in my opinion.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "173888790-indie-kay",
        "reviewer_followers": "1 follower",
        "reviewer_review_nums": "186 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Engagement and Pacing:**  \n  - It took me a little while to get fully into the story.  \n  - Around the 3/4 mark, the pacing dragged a little.  \n\n- **World-Building:**  \n  - I really liked the world the story is set in.  \n\n- **Ending:**  \n  - The ending is very strong and satisfying.  \n\n- **Author Comparison:**  \n  - I think this is probably the best book I've read by this author.  \n\n**Conclusion:**  \nOverall, I enjoyed this novel. While it had some pacing issues in the middle, the world-building was captivating, and the ending left a strong impression. It stands out as the author's best work in my opinion.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "World-Building and Setting",
            "Themes",
            "Expectation Fulfillment"
        ],
        "review": [
            "F.T. has crafted a beautifully written book featuring unforgettable characters. Ellery and Knox are absolutely precious; I can't help but want to hug them both!",
            "I thoroughly enjoyed the lore and appreciated Knox's deep affection for the human realm.",
            "A heartwarming tale of found family!",
            "I was captivated by the premise of this story."
        ],
        "conclusion": "This novel is a beautifully crafted story with exceptional characters, a compelling premise, and rich lore. The dynamic between the two protagonists is heartwarming, and the theme of found family adds emotional depth to the narrative.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "18790080-emy-mellark",
        "reviewer_followers": "16 followers",
        "reviewer_review_nums": "57 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n  - \"F.T delivers a wonderfully beautiful book! with the best characters.\"  \n  - \"Ellery & Knox are just so precious; I just want to scrunch them all up.\"  \n\n- **Premise and Plot:**  \n  - \"I loved the premise behind this one.\"  \n\n- **World-Building and Lore:**  \n  - \"I loved reading the lore and how much Knox loved the human realm.\"  \n\n- **Themes and Emotional Impact:**  \n  - \"Such a lovely found family!\"  \n\n**Conclusion:**  \nThis novel by F.T. is a beautifully crafted story with exceptional characters, a compelling premise, and rich lore. The dynamic between Ellery and Knox is heartwarming, and the theme of found family adds emotional depth to the narrative.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting"
        ],
        "review": [
            "I have greatly enjoyed all of the author's work, and this book is no exception. While I find it slightly less compelling than their previous titles, I still appreciated it. My only criticism is that it occasionally felt repetitive and slow.",
            "I really enjoyed the main characters and the supporting cast, and I found the romance to be quite charming. While Ellery occasionally frustrated me, I always understood their perspective, which speaks to the quality of the writing.",
            "*Otherworldly* introduces a captivating magic concept of an eternal winter that effectively establishes the book's intriguing backdrop."
        ],
        "conclusion": "Overall, I found *Otherworldly* to be an enjoyable read with a unique magic concept and engaging characters. While it had some pacing issues and moments of repetitiveness, the story remained compelling, and the romance added a charming touch.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "37016646-daphne",
        "reviewer_followers": "46 followers",
        "reviewer_review_nums": "1,196 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Author's Work and Consistency:**  \n  I've enjoyed all of F.T. Lukens' work a lot, and this was no exception. I do like it a little less than their other books, but I still really enjoyed it.  \n\n- **World-Building and Magic Concept:**  \n  *Otherworldly* has a very fun magic concept of an eternal winter that really sets the stage for the book.  \n\n- **Characters and Relationships:**  \n  I enjoyed the main characters and supporting cast a lot, and the romance was cute.  \n\n- **Pacing and Repetitiveness:**  \n  My one gripe with the book is that it felt a bit repetitive and slow at times.  \n\n- **Character Development (Ellery):**  \n  Occasionally, Ellery got on my nerves a little. They were frustrating at times, but I could also always understand where they were coming from, so it was not badly written.  \n\n**Conclusion:**  \nOverall, I found *Otherworldly* to be an enjoyable read with a unique magic concept and engaging characters. While it had some pacing issues and moments of repetitiveness, the story remained compelling, and the romance added a charming touch.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Themes",
            "Emotional Impact"
        ],
        "review": [
            "The story resonated deeply with me as a queer reader, capturing the essence of queer experiences without relying on explicit labels. This approach felt both authentic and relatable, making the characters' identities impactful despite their ambiguity.",
            "The novel is a beautifully tender exploration of queer emotions, offering a heartwarming escape from a cold and lonely world. Its comforting yet ironic tone creates a deeply resonant experience that feels both safe and profoundly real."
        ],
        "conclusion": "This novel is a beautifully crafted, tender, and heartwarming story that explores queer themes in a way that feels both real and safe. It offers a much-needed emotional reprieve and is highly recommended.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "139063514-charlie",
        "reviewer_followers": "2 followers",
        "reviewer_review_nums": "73 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Emotional Impact:**  \n  - The novel was incredibly sweet and tender, evoking a heartachingly queer and deeply real emotional experience.  \n  - It felt like a safe and beautiful reprieve from the cold and lonely world, which was both comforting and ironic.  \n\n- **Themes and Representation:**  \n  - The story explored themes that resonated deeply with me as a queer reader, even though the characters' identities were not explicitly defined.  \n  - It captured the essence of queer experiences without relying on overt labels, which felt authentic and relatable.  \n\n- **Overall Recommendation:**  \n  - I wholeheartedly recommend this novel for its emotional depth, authenticity, and the sense of safety it provides.  \n\n**Conclusion:**  \nThis novel is a beautifully crafted, tender, and heartwarming story that explores queer themes in a way that feels both real and safe. It offers a much-needed emotional reprieve and is highly recommended.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Expectation Fulfillment"
        ],
        "review": [
            "The story's middle section dragged a bit, but the latter half picked up the pace significantly.",
            "I thoroughly enjoyed following all the characters, especially Knox, who was my favorite.",
            "The author consistently excels with their standalone fantasies, and I eagerly anticipate their next release.",
            "This delightful fantasy romance was a charming escape, especially reading a winter-themed story during the summer!"
        ],
        "conclusion": "Overall, this was a delightful fantasy romance with a charming winter theme, despite some pacing issues in the middle. The characters were engaging, and the author's storytelling remains consistently strong.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "142951466-shatterinseconds",
        "reviewer_followers": "6 followers",
        "reviewer_review_nums": "271 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Genre and Theme:**  \n  This was such a cute, enjoyable fantasy romance! It was great reading a winter-themed book in the summer.  \n\n- **Pacing:**  \n  While the middle started to become a little too slow, the latter half flew by.  \n\n- **Characters:**  \n  All the characters were so fun to follow—Knox was my favorite.  \n\n- **Author's Style and Consistency:**  \n  F.T. Lukens always hits it out of the park with their standalone fantasies, and I can't wait to read their next one.  \n\n**Conclusion:**  \nOverall, this was a delightful fantasy romance with a charming winter theme, despite some pacing issues in the middle. The characters were engaging, and the author's storytelling remains consistently strong.  \n\n**Rating Scores:**  \n4.5 stars"
    },
    {
        "aspects": [
            "Characters",
            "World-Building and Setting",
            "Themes",
            "Emotional Impact",
            "Expectation Fulfillment"
        ],
        "review": [
            "The story beautifully incorporates the found family trope, which I absolutely adore.",
            "The world-building is robust and well-crafted, enhancing the story’s depth.",
            "This story offers commendable queer representation, which I value as I seek more genre fiction featuring queer characters.",
            "I received these books as gifts from friends after expressing my interest in queer genre fiction. Initially, I hesitated to read them since romance isn't usually my preference. However, winning this book in a giveaway motivated me to dive in, and I'm glad I did.",
            "This novel is a charming and cozy YA romance infused with elements of fantasy, mythology, and horror that kept me captivated, even as someone who doesn't typically gravitate towards romance."
        ],
        "conclusion": "This novel is a delightful blend of romance, fantasy, and mythology, with strong world-building and queer representation. It pleasantly surprised me as a non-romance reader, and I’m now eager to explore more of the author’s work.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "74632444-kailen",
        "reviewer_followers": "90 reviews",
        "reviewer_review_nums": "90 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Genre and Themes:**  \n  - The novel is a cute and cozy YA romance with elements of fantasy, mythology, and horror, which kept me engaged despite not typically being a romance reader.  \n  - It features queer representation, which I appreciate, as I’ve been seeking more genre fiction with queer characters.  \n\n- **Character Dynamics:**  \n  - The story includes a found family trope, which I absolutely love.  \n\n- **World-Building:**  \n  - The world-building is solid and well-developed, adding depth to the story.  \n\n- **Personal Connection and Motivation:**  \n  - I received F.T. Lukens’ books as gifts from friends after expressing a desire for more queer genre fiction. However, I initially hesitated to read them because I’m not usually drawn to romance.  \n  - Winning this book in a giveaway motivated me to finally read it, and I’m glad I did.  \n\n- **Future Reading Plans:**  \n  - I enjoyed this book enough to consider reading *In Deeper Waters* next, as I have a soft spot for pirate stories.  \n\n**Conclusion:**  \nThis novel is a delightful blend of romance, fantasy, and mythology, with strong world-building and queer representation. It pleasantly surprised me as a non-romance reader, and I’m now eager to explore more of the author’s work.  \n\n**Rating Scores:**  \n- No explicit rating scores mentioned in the review."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting"
        ],
        "review": [
            "The ending was well-paced and felt appropriately timed, which I appreciated.",
            "The romance in the story was beautifully executed. I found Knox’s character particularly engaging, while Ellery's pessimism sometimes made it challenging to connect with her at first. However, the strong representation throughout the narrative added significant depth, enhancing the overall experience.",
            "I wish we had more exploration of the Other World, which felt underdeveloped."
        ],
        "conclusion": "Overall, this was a solid 4-star read for me. While Ellery’s pessimism slowed my initial engagement, the romance, pacing, and representation made it a satisfying fantasy love story.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "114848453-shana-travelersguidetobooks",
        "reviewer_followers": "10 followers",
        "reviewer_review_nums": "194 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Romance:** The romance was nicely done. I enjoyed Knox’s character, though I found his love interest, Ellery, to be too pessimistic at times.  \n- **Character Development:** Knox’s character stood out to me, but Ellery’s pessimism made it a bit harder to connect with her initially.  \n- **Pacing:** The ending was paced well and didn’t feel rushed, which I appreciated.  \n- **World-Building:** I wish we had gotten to explore more of the Other World, as it felt underdeveloped.  \n- **Representation:** I loved the representation in the story, which added depth to the narrative.  \n\n**Conclusion:**  \nOverall, this was a solid 4-star read for me. While Ellery’s pessimism slowed my initial engagement, the romance, pacing, and representation made it a satisfying fantasy love story.  \n\n**Rating Scores:**  \n4 stars."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language"
        ],
        "review": [
            "One weakness I observed was that some conflicts were treated too lightly, which made certain moments feel less impactful or resolved too swiftly.",
            "I thoroughly enjoyed the dynamic between the main characters. Their depth and well-developed personalities made the story relatable and engaging.",
            "This novel is the coziest and cutest fantasy romance I've ever read. Its delightful atmosphere made for an incredibly enjoyable experience that left a lasting impression."
        ],
        "conclusion": "Overall, this was a delightful fantasy romance with a cozy and charming atmosphere, complemented by well-crafted main characters. While the conflicts could have been more thoroughly explored, it was still an enjoyable read.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "166580906-j-r",
        "reviewer_followers": "12 followers",
        "reviewer_review_nums": "1,571 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Tone and Atmosphere:**  \n  The novel is described as the \"coziest, cutest fantasy romance\" I've ever read. The overall vibes of the story were incredibly enjoyable and left a lasting impression.  \n\n- **Characterization:**  \n  I totally loved the vibes of both main characters. They were well-developed and added depth to the story, making them relatable and engaging.  \n\n- **Conflict and Pacing:**  \n  One weakness I noticed was that the conflicts were a little glossed over at times. This made certain parts of the story feel less impactful or resolved too quickly.  \n\n**Conclusion:**  \nOverall, this was a delightful fantasy romance with a cozy and charming atmosphere, complemented by well-crafted main characters. While the conflicts could have been more thoroughly explored, it was still an enjoyable read.  \n\n**Rating Scores:**  \n4.5/5"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "World-Building and Setting"
        ],
        "review": [
            "This novel offers a captivating and heartwarming teenage romance set in a world enduring a relentless five-year winter. Ellery, a non-binary high schooler, leaves their struggling farm to seek work in the city, where they encounter Knox, a magical liminal being. As their bond deepens, the relationship becomes complicated by Knox's secret, which poses a threat to their blossoming connection.",
            "The romance is quite mild, featuring only a brief make-out session. While it has its sweet moments, the presence of the insta-love trope may not resonate with all readers. Ellery and Knox are engaging protagonists, but the supporting characters, Charlie and Zada, truly steal the spotlight. The magical side characters, such as Lorelei and Bram, are intriguing, though their limited appearances leave readers craving more.",
            "The book is a quick and enjoyable read, though it can be a bit overly sweet at times. Its smooth pacing makes it a perfect companion for stressful days or a refreshing break from heavier literature.",
            "The magical world is captivating, seamlessly blending human and magical realms. While the presence of magical creatures enriches the narrative, the story could explore this aspect more deeply."
        ],
        "conclusion": "*Otherworldly* is a readable and enjoyable novel, perfect for light reading or as a break from more intense books. While it lacks depth in some areas, its charming romance, intriguing magical elements, and standout supporting characters make it a worthwhile read.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "812146-rachel",
        "reviewer_followers": "15 followers",
        "reviewer_review_nums": "217 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Plot and Premise:**  \n  The novel presents a compelling and sweet teenage romance set in a world trapped in a ceaseless winter for five years. Ellery, a non-binary high schooler, leaves their failing farm to find work in the city, where they meet Knox, a magical liminal person. The story explores their growing attachment, complicated by Knox's secret, which threatens their budding relationship.  \n\n- **Writing Style and Pacing:**  \n  The book is a quick and easy read, though it occasionally feels overly sugary. The pacing is smooth, making it an accessible companion for a stressful day or a break from heavier reads.  \n\n- **Romance:**  \n  The romance is extremely tame, with only a brief make-out session. While it’s sweet, the insta-love trope is present, which may not appeal to all readers.  \n\n- **World-Building and Magic:**  \n  The magical world is intriguing, with its seamless merging of the human and magical realms. The inclusion of magical creatures adds depth, though the story doesn’t delve very deeply into this aspect.  \n\n- **Characters:**  \n  Ellery and Knox are engaging protagonists, but the supporting characters, Charlie and Zada, truly shine. The magical side characters, like Lorelei and Bram, are tantalizing, though their appearances are brief, leaving readers wanting more.  \n\n**Conclusion:**  \n*Otherworldly* is a readable and enjoyable novel, perfect for light reading or as a break from more intense books. While it lacks depth in some areas, its charming romance, intriguing magical elements, and standout supporting characters make it a worthwhile read.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Writing and Language",
            "Enjoyment and Engagement",
            "Expectation Fulfillment"
        ],
        "review": [
            "The author has become a must-read for me. Her stories consistently deliver the perfect blend of engaging characters, compelling plots, and enjoyable moments that keep me turning the pages!",
            "I’m thrilled to have received an ARC at YALLFest and can’t wait to explore the other worlds she has in store for me!",
            "This was a delightful cozy read, brimming with magic, first love, and the warmth of found family."
        ],
        "conclusion": "This novel is a delightful, cozy read that masterfully blends magic, first love, and the theme of found family. The author continues to impress with engaging storytelling and well-crafted characters, making their work a must-read for fans of the genre.",
        "rating": "5",
        "review_likes": "2",
        "reviewer_id": "83991476-allisha-lady-perfictionist",
        "reviewer_followers": "19 followers",
        "reviewer_review_nums": "157 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Genre and Tone:**  \n  - This was the most perfect cozy read! Full of magic, first love, and found family.  \n\n- **Author's Skill and Style:**  \n  - F.T. Lukens has become a must-buy author for me. Her stories always bring the right amount of characters, story, and fun that just keep you turning the pages!  \n\n- **Engagement and Enjoyment:**  \n  - I’m so excited to have received an ARC at YALLFest and cannot wait to see what other worlds she has in store for me in the future!  \n\n**Conclusion:**  \nThis novel is a delightful, cozy read that masterfully blends magic, first love, and the theme of found family. F.T. Lukens continues to impress with her engaging storytelling and well-crafted characters, making her a must-read author for me.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "Writing and Language",
            "Themes"
        ],
        "review": [
            "The novel offers a delightful and engaging queer romance that truly captivated me.",
            "Ellery's journey is compelling as they navigate choices that resonate with readers and evoke empathy. The novel excel in its portrayal of queer relationships, presenting them as natural and integral to the narrative without resorting to harmful tropes.",
            "The author weaves an engaging and comforting tale that skillfully balances romance and introspection.",
            "This story skillfully normalizes queer relationships, particularly between the main characters, Ellery and Knox, as well as supporting characters Charley and Zada, avoiding the pitfalls of depicting queer identities as sources of conflict or pain. The narrative weaves together religious and mythological elements, inviting readers to engage with these themes in a thoughtful manner."
        ],
        "conclusion": "This is a truly amazing story that skillfully blends romance, mythology, and empathy. The normalization of queer relationships and the thoughtful exploration of themes make it a standout read. I eagerly anticipate more works from this talented author.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "133364933-brianne-lewis",
        "reviewer_followers": "5 followers",
        "reviewer_review_nums": "178 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Plot and Themes:**  \n  - The novel presents a sharp, cozy, queer romantic tale that captivated me.  \n  - The story avoids using queer identities as a source of conflict or pain, instead normalizing queer relationships between the main characters, Ellery and Knox, as well as the supporting cast, Charley and Zada.  \n  - The narrative intertwines religious and mythological elements, allowing readers to explore these themes thoughtfully.  \n\n- **Character Development:**  \n  - Ellery’s journey is particularly compelling, as they navigate decisions about what is best for them, evoking empathy from the reader.  \n\n- **Writing Style and Tone:**  \n  - The author, F.T. Lukens, crafts a story that feels both engaging and comforting, with a tone that balances romance and introspection.  \n\n- **Representation and Inclusivity:**  \n  - The novel excels in its portrayal of queer relationships, presenting them as natural and integral to the story without relying on harmful tropes.  \n\n**Conclusion:**  \nThis is a truly amazing story that skillfully blends romance, mythology, and empathy. The normalization of queer relationships and the thoughtful exploration of themes make it a standout read. I eagerly anticipate more works from F.T. Lukens.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "World-Building and Setting",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The characters were delightful and engaging, adding both depth and charm to the narrative.",
            "The world-building was expertly crafted, creating an immersive and captivating setting that felt vibrant and alive.",
            "This book was delightful and kept me engaged from start to finish. It was a cozy read that I simply couldn't put down."
        ],
        "conclusion": "Overall, *Otherworldly* was a delightful and captivating read. It delivered on its promise of being a cozy and engaging story, with strong character development and immersive world-building.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "173901375-devan",
        "reviewer_followers": "21 reviews",
        "reviewer_review_nums": "21 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Engagement and Enjoyment:**  \n  The book was really cute, and I thoroughly enjoyed it. It was a great cozy read that kept me hooked from start to finish. I couldn't put it down.  \n- **Character Development:**  \n  The characters were fun and engaging, adding depth and charm to the story.  \n- **World-Building:**  \n  The world-building was well-crafted and immersive, making the setting feel alive and intriguing.  \n\n**Conclusion:**  \nOverall, *Otherworldly* was a delightful and captivating read. It delivered on its promise of being a cozy and engaging story, with strong character development and immersive world-building.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Writing and Language"
        ],
        "review": [
            "I thoroughly enjoyed the prologue, but upon reaching chapter one, I found the introduction of the main character, Ellery, to be less effective. Ellery is a non-binary character who uses they/them pronouns, which I appreciate. However, the author has difficulty incorporating these pronouns seamlessly, often defaulting to the character's name instead. This reliance on \"Ellery\" becomes repetitive and distracting, detracting from the overall reading experience.",
            "In just three pages, the name Ellery appeared nineteen times, including a half-page at the chapter's start. This excessive repetition made it challenging to continue reading, as it felt unnatural and disrupted the narrative flow."
        ],
        "conclusion": "While the novel starts with a promising prologue and introduces an important non-binary character, the repetitive and awkward use of the character's name instead of pronouns made the reading experience frustrating. I couldn't continue past the first chapter, which is disappointing given the potential for meaningful representation.",
        "rating": "1",
        "review_likes": "1",
        "reviewer_id": "152323519-alessa-levan",
        "reviewer_followers": "6 reviews",
        "reviewer_review_nums": "6 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Representation:**  \n  - I really enjoyed the prologue chapter, but when we get to chapter one, we are introduced to the first main character, Ellery, who I believe is non-binary and uses they/them pronouns.  \n  - While I appreciate the inclusion of non-binary characters, the author struggles to write effectively with non-binary pronouns. Instead of using \"they/them,\" the author relies heavily on the character's name, \"Ellery,\" which becomes repetitive and distracting.  \n\n- **Writing Style and Repetition:**  \n  - In just three pages, the name \"Ellery\" was used nineteen times, including on a half-page at the start of the chapter.  \n  - The excessive repetition of the character's name made it difficult for me to continue reading, as it felt unnatural and disrupted the flow of the narrative.  \n\n- **Potential and Disappointment:**  \n  - It's a shame because there is a clear need for more books featuring non-binary characters, and I was excited to see this representation.  \n  - Unfortunately, the way the story is written made it impossible for me to get past chapter one, despite my initial interest.  \n\n**Conclusion:**  \nWhile the novel starts with a promising prologue and introduces an important non-binary character, the repetitive and awkward use of the character's name instead of pronouns made the reading experience frustrating. I couldn't continue past the first chapter, which is disappointing given the potential for meaningful representation.  \n\n**Rating Scores:**  \n(No explicit rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Themes"
        ],
        "review": [
            "Ellery, the non-binary protagonist, is a relatable and brave character who expresses their feelings with clarity. Knox, the love interest, is charming and adds a sense of awe and wonder to the human experience.",
            "The book features minimal cursing but is otherwise clean, with no references to drinking, sex, or drugs. It delves into powerful themes of family, love, and sacrifice, making it appropriate for readers aged 14 and up."
        ],
        "conclusion": "This YA fantasy novel is a delightful and clean read, featuring a relatable non-binary protagonist and a charming love interest. With its strong themes of family, love, and sacrifice, it is a highly recommended book for readers aged 14 and above.",
        "rating": "5",
        "review_likes": "1",
        "reviewer_id": "15223509-katy",
        "reviewer_followers": "8 followers",
        "reviewer_review_nums": "258 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n  - Ellery, the non-binary protagonist, is grumpy, relatable, brave, and communicates their feelings clearly.  \n  - Knox, the love interest, is likable and brings a sense of awe and wonder about the human world.  \n\n- **Content and Themes:**  \n  - The book contains a little bit of cursing but is otherwise clean, with no drinking, sex, or drugs.  \n  - It explores strong themes of family, love, and sacrifice, making it suitable for readers aged 14 and above.  \n\n- **Overall Enjoyment and Recommendation:**  \n  - I found this to be a delightful YA fantasy read.  \n  - I would definitely recommend it to young adult readers for its engaging characters and meaningful themes.  \n\n**Conclusion:**  \nThis YA fantasy novel is a delightful and clean read, featuring a relatable non-binary protagonist and a charming love interest. With its strong themes of family, love, and sacrifice, it is a highly recommended book for readers aged 14 and above.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Characters",
            "Themes",
            "Enjoyment and Engagement"
        ],
        "review": [
            "I’ve enjoyed all of their books, and this one is no exception. The characters consistently shine, and this story is no different. From the very beginning, it was easy to love and root for Ellery and Knox.",
            "I appreciated the found family aspect of this novel, which brought depth and warmth to the story. The supernatural element was also intriguing and seamlessly woven into the plot.",
            "The story unfolded in unexpected ways, keeping me thoroughly engaged. Its unpredictable narrative made it difficult to put down."
        ],
        "conclusion": "The author delivers another captivating novel with strong character development, an unpredictable plot, and heartwarming themes of found family, all enhanced by an intriguing supernatural element. It’s a must-read for fans of their work.",
        "rating": "4",
        "review_likes": "1",
        "reviewer_id": "8037319-courtney-williams",
        "reviewer_followers": "10 followers",
        "reviewer_review_nums": "439 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Character Development:**  \n  I’ve loved all of F.T. Lukens' books, and this one was no exception. The characters are the shining points of their novels, and this story was the same. It was so easy to love and root for Ellery and Knox from the very beginning.  \n\n- **Plot Engagement:**  \n  The way the story unfolded was never obvious, which kept me invested throughout. The narrative was engaging and unpredictable, making it hard to put down.  \n\n- **Themes and Elements:**  \n  I loved the found family aspect of this novel, which added depth and warmth to the story. Additionally, the supernatural element was really interesting and well-integrated into the plot.  \n\n- **Recommendation:**  \n  This is a book I’ll definitely recommend in the future. It’s a standout read that combines compelling characters, an engaging plot, and unique themes.  \n\n**Conclusion:**  \nF.T. Lukens delivers another captivating novel with strong character development, an unpredictable plot, and heartwarming themes of found family, all enhanced by an intriguing supernatural element. It’s a must-read for fans of their work.  \n\n**Rating Scores:**  \n4.5 stars"
    },
    {
        "aspects": [
            "Characters",
            "Enjoyment and Engagement"
        ],
        "review": [
            "The pronouns assigned to one character significantly disrupted my reading experience.",
            "I struggled to enjoy this book and stopped reading after the second chapter. I found the flow unappealing."
        ],
        "conclusion": "The book failed to engage me due to its flow and the use of pronouns for a character, which made it difficult for me to connect with the story.",
        "rating": "1",
        "review_likes": "1",
        "reviewer_id": "28640802-mary-hester",
        "reviewer_followers": "36 reviews",
        "reviewer_review_nums": "36 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Engagement and Enjoyment:**  \n  I did not enjoy this book and only made it past the second chapter before quitting. The flow of the book was not enjoyable for me.  \n- **Character Representation:**  \n  The pronouns used for one of the characters completely disrupted my usual reading experience.  \n\n**Conclusion:**  \nThe book failed to engage me due to its flow and the use of pronouns for a character, which made it difficult for me to connect with the story.  \n\n**Rating Scores:**  \nNot explicitly mentioned in the review."
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Expectation Fulfillment"
        ],
        "review": [
            "The story took on a more serious tone than *Spell Bound*, with Ellery and Knox frequently under attack from creatures, gods, and goddesses from the Other World. While this heightened tension was engaging, it lacked the joy and fun I found in *Spell Bound*.",
            "I enjoyed watching Ellery and Knox fall in love, but I found it harder to connect with Ellery's grumpiness compared to Sun from *Spell Bound*, who, despite being grumpy, had a great sense of humor. However, Ellery did have some funny moments. I also really liked Charley and Zada; they were fun characters who added a lot to the story.",
            "One of the highlights of the story is Ellery’s journey through the Other World to reach Knox and the palace. I was captivated by the Orpheus and Eurydice “Don’t look back” trope and how it unfolded. Additionally, I appreciated the diverse array of beings from the Other World that Ellery and Knox encountered.",
            "I was initially thrilled by the concept of a paranormal boyfriend and an endless winter, but the story ultimately fell short of my expectations. I anticipated that Knox and Ellery would be together throughout the entire narrative, battling shades and attempting to end the long winter. I also expected the goddess of death to be somewhat kinder, though I realize that deities of death usually aren't pleased when mortals disrupt the natural order."
        ],
        "conclusion": "While I didn’t enjoy this story as much as *Spell Bound*, it had its moments, particularly in the world-building and Ellery’s journey through the Other World. The serious tone and Ellery’s grumpiness made it harder for me to connect with the story, but I still found it engaging enough to want to read the final version.",
        "rating": "3",
        "review_likes": "False",
        "reviewer_id": "82818029-justine-korson",
        "reviewer_followers": "6 followers",
        "reviewer_review_nums": "325 reviews",
        "reformatted_ori_review": "**Aspects:**\n- **Expectations vs. Reality:**  \n  I was really excited about the idea of a paranormal boyfriend and an endless winter, but the story didn’t meet my expectations as much as I’d hoped. I thought Knox and Ellery would be together throughout the entire story, fighting shades and trying to stop the long winter. I also expected the goddess of death to be a bit nicer, though I’m not sure why, since gods/goddesses of death aren’t typically happy when people thwart death.\n\n- **Character Dynamics:**  \n  I enjoyed watching Ellery and Knox fall in love, but Ellery’s grumpiness made it harder for me to connect with them compared to Sun from *Spell Bound*, who was also grumpy but had a great sense of humor. That said, Ellery did have their funny moments. I also really liked Charley and Zada—they were fun characters who added a lot to the story.\n\n- **Tone and Pacing:**  \n  The story felt more serious compared to *Spell Bound*, as Ellery and Knox were constantly being attacked or accosted by creatures, gods, and goddesses from the Other World. While this added tension, it didn’t give me the same joy and fun I experienced while reading *Spell Bound*.  \n\n- **World-Building and Plot:**  \n  One of the best parts of the story was Ellery’s journey through the Other World to reach Knox and the palace. I immediately recognized the Orpheus and Eurydice “Don’t look back” trope and was intrigued by how it played out. I also enjoyed seeing the variety of beings from the Other World that Ellery and Knox interacted with.  \n\n- **Unresolved Details:**  \n  At the end, Knox mentions stopping to talk to someone about returning to the human realm, but it’s unclear who he spoke to. I assume it was Arabelle, but this wasn’t clarified. I’m hoping the finished version of the book will address this. Despite this, I’m still planning to buy a physical copy to see if any details were expanded upon.\n\n**Conclusion:**  \nWhile I didn’t enjoy this story as much as *Spell Bound*, it had its moments, particularly in the world-building and Ellery’s journey through the Other World. The serious tone and Ellery’s grumpiness made it harder for me to connect with the story, but I still found it engaging enough to want to read the final version.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    },
    {
        "aspects": [
            "Plot and Storyline",
            "Characters",
            "World-Building and Setting",
            "Enjoyment and Engagement"
        ],
        "review": [
            "This story delves into themes of love in its many forms, the importance of choice, the concept of found family, and the courage to stand up for what is right. While the pacing is slow at times, which dampened my enjoyment, the narrative gains momentum in the final quarter and concludes powerfully.",
            "Ellery and Knox are likable protagonists, with Ellery's ordinariness providing a refreshing contrast to the larger-than-life characters around them. Initially skeptical of the supernatural, Ellery's perspective shifts upon meeting Knox, a liminal being who can only exist in the human realm through a binding bargain. Their sweet and charming dynamic drives a compelling journey, while a strong supporting cast adds depth to the narrative.",
            "*Otherworldly* presents a meticulously crafted world, featuring a city ensnared in perpetual winter and a diverse array of magical beings. The magic system is well-developed, and the supernatural elements are captivating.",
            "The book is missing the humor found in the author's other works, which I found disappointing. While the lack of humor aligns with the story's tone, I anticipated more energy or spark to keep me engaged."
        ],
        "conclusion": "*Otherworldly* has many strengths, including likable protagonists, a well-built world, and meaningful themes. However, the slow pacing and lack of humor made it less engaging than I had hoped. Despite these issues, the story finishes strong and has a lot to recommend it.",
        "rating": "3",
        "review_likes": "False",
        "reviewer_id": "3232771-kimberly",
        "reviewer_followers": "92 followers",
        "reviewer_review_nums": "2,264 reviews",
        "reformatted_ori_review": "**Aspects:**  \n- **Characters:**  \n  - Ellery and Knox are easy protagonists to like. Ellery stands out by being ordinary in a story filled with larger-than-life personalities. They are a skeptic when it comes to the supernatural, but their perspective shifts when they meet Knox.  \n  - Knox is a liminal being, a familiar who can only stay in the human realm when bound to a bargain. Their dynamic with Ellery is sweet and charming, and their journey together is compelling.  \n  - The supporting cast is strong, adding depth to the story.  \n\n- **World-Building:**  \n  - The world of *Otherworldly* is well-crafted, with a city trapped in eternal winter and a variety of magical beings. The magic system is thoughtfully developed, and the supernatural elements are intriguing.  \n\n- **Plot and Pacing:**  \n  - The story explores themes of love in many forms, choice, found family, and standing up for what is right.  \n  - The pace of the book is slow, which detracted from my enjoyment. It was easy to put down, though the story picks up in the last quarter and finishes strong.  \n\n- **Tone and Humor:**  \n  - The book lacks the humor present in F.T. Lukens’s other works, which I missed. While the absence of humor is logical given the story’s tone, I expected more energy or spark to engage me.  \n\n**Conclusion:**  \n*Otherworldly* has many strengths, including likable protagonists, a well-built world, and meaningful themes. However, the slow pacing and lack of humor made it less engaging than I had hoped. Despite these issues, the story finishes strong and has a lot to recommend it.  \n\n**Rating Scores:**  \n(No specific rating scores mentioned in the review.)"
    }
]